[{"id":"1.EN.OL.1","title":1.1,"text":"The student will continue to demonstrate growth in the use of oral language.","grade":"Grade 1","strand":"Oral Language","subject":"English","course":"English","subs":["Listen and respond to a variety of electronic media and other age-appropriate materials.","Tell and retell stories and events in logical order.","Participate in a variety of oral language activities, including choral speaking and reciting short poems, rhymes, songs, and stories with repeated patterns.","Participate in creative dramatics.","Express ideas orally in complete sentences."]},{"id":"1.EN.OL.2","title":1.2,"text":"The student will expand understanding and use of word meanings.","grade":"Grade 1","strand":"Oral Language","subject":"English","course":"English","subs":["Increase listening and speaking vocabularies.","Begin to ask for clarification and explanation of words and ideas.","Use common singular and plural nouns.","Use vocabulary from other content areas."]},{"id":"1.EN.OL.3","title":1.3,"text":"The student will adapt or change oral language to fit the situation.","grade":"Grade 1","strand":"Oral Language","subject":"English","course":"English","subs":["Initiate conversation with peers and adults.","Follow rules for conversation using appropriate voice level in small-group settings.","Ask and respond to questions.","Follow simple two-step oral directions.","Give simple two-step oral directions."]},{"id":"1.EN.OL.4","title":1.4,"text":"The student will orally identify, produce, and manipulate various units of speech sounds within words.","grade":"Grade 1","strand":"Oral Language","subject":"English","course":"English","subs":["Create rhyming words.","Count phonemes (sounds) in one-syllable words.","Blend sounds to make one-syllable words.","Segment one-syllable words into individual speech sounds (phonemes).","Add or delete phonemes (sounds) to make new words."]},{"id":"1.EN.RD.5","title":1.5,"text":"The student will apply knowledge of how print is organized and read.","grade":"Grade 1","strand":"Reading","subject":"English","course":"English","subs":["Read from left to right and from top to bottom.","Match spoken words with print.","Identify letters, words, sentences, and ending punctuation.","Read his/her own writing."]},{"id":"1.EN.RD.6","title":1.6,"text":"The student will apply phonetic principles to read and spell.","grade":"Grade 1","strand":"Reading","subject":"English","course":"English","subs":["Use beginning and ending consonants to decode and spell single-syllable words.","Use two-letter consonant blends to decode and spell single-syllable words.","Use beginning consonant digraphs to decode and spell single-syllable words.","Use short vowel sounds to decode and spell single-syllable words.","Blend beginning, middle, and ending sounds to recognize and read words.","Use word patterns to decode unfamiliar words.","Read and spell simple two-syllable compound words.","Read and spell commonly used sight words."]},{"id":"1.EN.RD.7","title":1.7,"text":"The student will use semantic clues and syntax to expand vocabulary when reading.","grade":"Grade 1","strand":"Reading","subject":"English","course":"English","subs":["Use words, phrases, and sentences.","Use titles and pictures.","Use information in the story to read words.","Use knowledge of sentence structure.","Use knowledge of story structure.","Reread and self-correct."]},{"id":"1.EN.RD.8","title":1.8,"text":"The student will expand vocabulary.","grade":"Grade 1","strand":"Reading","subject":"English","course":"English","subs":["Discuss meanings of words in context.","Develop vocabulary by listening to and reading a variety of texts.","Ask for the meaning of unknown words and make connections to familiar words.","Use text clues such as words or pictures to discern meanings of unknown words.","Use vocabulary from other content areas."]},{"id":"1.EN.RD.9","title":1.9,"text":"The student will read and demonstrate comprehension of a variety of fictional texts.","grade":"Grade 1","strand":"Reading","subject":"English","course":"English","subs":["Preview the selection.","Set a purpose for reading.","Relate previous experiences to what is read.","Make and confirm predictions.","Ask and answer who, what, when, where, why, and how questions about what is read.","Identify characters, setting, and important events.","Retell stories and events, using beginning, middle, and end.","Identify the main idea or theme.","Read and reread familiar stories, poems, and passages with fluency, accuracy, and meaningful expression."]},{"id":"1.EN.RD.10","title":1.1,"text":"The student will read and demonstrate comprehension of a variety of nonfiction texts.","grade":"Grade 1","strand":"Reading","subject":"English","course":"English","subs":["Preview the selection.","Use prior and background knowledge as context for new learning.","Set a purpose for reading.","Identify text features such as pictures, headings, charts, and captions.","Make and confirm predictions.","Ask and answer who, what, where, when, why, and how questions about what is read.","Identify the main idea.","Read and reread familiar passages with fluency, accuracy, and meaningful expression."]},{"id":"1.EN.RD.11","title":1.11,"text":"The student will use simple reference materials.","grade":"Grade 1","strand":"Reading","subject":"English","course":"English","subs":["Use knowledge of alphabetical order by first letter.","Use a picture dictionary to find meanings of unfamiliar words."]},{"id":"1.EN.WR.12","title":1.12,"text":"The student will print legibly.","grade":"Grade 1","strand":"Writing","subject":"English","course":"English","subs":["Form letters accurately.","Space words within sentences.","Use the alphabetic code to write unknown words phonetically."]},{"id":"1.EN.WR.13","title":1.13,"text":"The student will write to communicate ideas for a variety of purposes.","grade":"Grade 1","strand":"Writing","subject":"English","course":"English","subs":["Generate ideas.","Focus on one topic.","Revise by adding descriptive words when writing about people, places, things, and events.","Use complete sentences in final copies.","Begin each sentence with a capital letter and use ending punctuation in final copies.","Use correct spelling for commonly used sight words and phonetically regular words in final copies.","Share writing with others."]},{"id":"1.EN.WR.14","title":1.14,"text":"The student will use available technology for reading and writing.","grade":"Grade 1","strand":"Writing","subject":"English","course":"English","subs":[]},{"id":"1.CS.AP.1","title":1.1,"text":"The student will construct sets of step-by-step instructions (algorithms) either independently or collaboratively, including","grade":"Grade 1","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":["sequencing (including ordinal numbers); and;","simple loops (patterns and repetition)."]},{"id":"1.CS.AP.2","title":1.2,"text":"The student will construct programs to accomplish tasks as a means of creative expression using a block based programming language or unplugged activities, either independently or collaboratively including","grade":"Grade 1","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":["sequencing, ordinal numbers; and","simple loops (patterns and repetition)."]},{"id":"1.CS.AP.3","title":1.3,"text":"The student will analyze, correct, and improve (debug) an algorithm that includes sequencing.","grade":"Grade 1","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS.AP.4","title":1.4,"text":"The student will plan and create a design document to illustrate thoughts, ideas, and stories in a sequential (step-by-step) manner (e.g., story map, storyboard, sequential graphic organizer).","grade":"Grade 1","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS.AP.5","title":1.5,"text":"The student will categorize a group of items based on one or two attributes or the actions of each item, with or without a computing device.","grade":"Grade 1","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS.AP.6","title":1.6,"text":"The student will acknowledge that materials are created by others (e.g., author, illustrator)","grade":"Grade 1","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS.SYS.7","title":1.3,"text":"The student will identify components of computing systems that are common among different types of computing devices including desktop and laptop computers, tablets, and mobile phones.","grade":"Grade 1","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS.SYS.8","title":1.8,"text":"The student will identify, using accurate terminology, simple hardware and software problems that may occur during use (e.g., app or program is not working as expected, no sound is coming from the device, the device won't turn on).","grade":"Grade 1","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS.CY.9","title":1.9,"text":"The student will describe what is allowed and what is not allowed at school associated with the use of technology.","grade":"Grade 1","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS.CY.10","title":1.1,"text":"The student will identify and use strong passwords, explain why strong passwords should be used (e.g., protect name, address, and telephone number).","grade":"Grade 1","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS.DA.11","title":1.11,"text":"The student will identify and interpret data and organize it in a chart or graph in order to make a prediction, with or without a computing device.","grade":"Grade 1","strand":"Data & Analysis","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS.IC.12","title":1.12,"text":"The student will identify and explain responsible behaviors associated with using information and technology.","grade":"Grade 1","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS.NI.13","title":1.13,"text":"The student will, in a whole class environment, discuss how information can be communicated electronically (e.g., email, social media).","grade":"Grade 1","strand":"Networking & the Internet","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"1.CS24.AP.1","title":"1.AP.1","text":"The student will apply computational thinking by sorting items into categories based on multiple attributes and create patterns.","grade":"Grade 1","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe attributes of a set of objects.","List the attributes a set of objects have in common.","Sort and classify concrete objects based on multiple attributes.","Create repeating and increasing patterns."]},{"id":"1.CS24.AP.2","title":"1.AP.2","text":"The student will plan and implement algorithms that include the use of sequence and an event based on a predetermined task.","grade":"Grade 1","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Plan and create a design document that illustrates thoughts, ideas, and stories in a sequential manner.","Construct step-by-step instructions that include decision-making and repetition.","Identify and explain the role of events that are used in an algorithm.","Test algorithms that are sequential and contain an event."]},{"id":"1.CS24.AP.3","title":"1.AP.3","text":"The student will use the iterative design process to construct, test, and debug algorithms that include sequencing and an event.","grade":"Grade 1","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Discuss and describe the concept of debugging.","Analyze and explain the results of an algorithm.","Revise and improve an algorithm to produce desired outcomes."]},{"id":"1.CS24.CSY.1","title":"1.CSY.1","text":"The student will describe how computing components work together to create a computing system.","grade":"Grade 1","strand":"Computing Systems","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify and define hardware, software, and computing systems.","Identify common components of computing systems in different types of computing devices.","Describe how hardware and software work together to form a computing system."]},{"id":"1.CS24.CSY.2","title":"1.CSY.2","text":"The student will use accurate terminology to describe when a computing system might not work as expected.","grade":"Grade 1","strand":"Computing Systems","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify and describe a problem with a device or computing system when it does not work as expected.","Propose a solution to simple hardware or software issues"]},{"id":"1.CS24.CYB.1","title":"1.CYB.1","text":"The student will demonstrate safe and responsible use of computing technologies.","grade":"Grade 1","strand":"Cybersecurity","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe safe and responsible uses of computing technologies based on the school rules and acceptable use policy (AUP).","Demonstrate safe and responsible behaviors when using computing technologies and online communication.","Discuss the process for reporting inappropriate technology use at school or home.","Classify appropriate and inappropriate uses of technology at school or at home.","Explain the consequences of inappropriate uses of computing technologies."]},{"id":"1.CS24.CYB.2","title":"1.CYB.2","text":"The student will discuss the importance of using a password to protect private information.","grade":"Grade 1","strand":"Cybersecurity","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe the purpose of usernames and passwords.","Discuss how passwords are private information and are used to protect the privacy of information."]},{"id":"1.CS24.DA.1","title":"1.DA.1","text":"The student will explore how data can be stored and retrieved from various computing devices.","grade":"Grade 1","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify data formats used for various purposes, including audio, images, text, and video.","Explore and identify computing devices that collect, store, and/or display data."]},{"id":"1.CS24.DA.2","title":"1.DA.2","text":"The student will create representations of data to make predictions and draw conclusions.","grade":"Grade 1","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Collect and organize data with or without a computing device.","Create tables, object graphs, picture graphs, and models using abstraction.","Identify patterns and describe trends in data visualizations of various formats.","Use data to answer questions, draw conclusions, and make predictions."]},{"id":"1.CS24.IC.1","title":"1.IC.1","text":"The student will describe how computing technologies impact daily tasks and communication.","grade":"Grade 1","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Determine when tasks should be completed with or without computing devices.","Describe how computing devices are used in communication.","Describe healthy habits for using computing technologies."]},{"id":"1.CS24.IC.2","title":"1.IC.2","text":"The student will describe tasks and activities that use screens and categorize them based on their use.","grade":"Grade 1","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify daily routines and activities that can be completed with or without screens.","Classify the different uses of screen time as learning, entertainment, or communication."]},{"id":"1.CS24.IC.3","title":"1.IC.3","text":"The student will compare and contrast ways people complete tasks with and without computing technologies.","grade":"Grade 1","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify tasks that can be completed with and without computing technologies.","Discuss advantages and disadvantages of using and not using computing technologies.","Describe how the appropriate use of computing technologies can improve efficiency.","List computing technologies used in various careers."]},{"id":"1.CS24.NI.1","title":"1.NI.1","text":"The student will explain that computing devices and the use of the Internet allow people the ability to gather information and connect with others.","grade":"Grade 1","strand":"Networking & the Internet","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe how the Internet can be used to gather information.","Explain ways people communicate using computing devices and the Internet."]},{"id":"1.HSS.SK.0","title":"Skills 1","text":"The student will apply history and social science skills to practice citizenship in the classroom by","grade":"Grade 1","strand":"Skills","subject":"History & Social Science","course":"History & Social Science","subs":["practicing honesty and showing kindness to oneself and others;","recognizing the purpose of rules and practicing self-control;","being respectful of others and celebrating differences in ethnic origins, customs, and traditions;","working respectfully with one another to achieve a goal;","contributing one’s time and talents to help others in their homes, schools, and communities through jobs;","participating in classroom decision-making by voting; and","understanding that local and state government representatives are elected by citizens who vote."]},{"id":"1.HSS.CV.1","title":1.1,"text":"The student will apply history and social science skills to practice citizenship in the classroom by","grade":"Grade 1","strand":"Civics","subject":"History & Social Science","course":"History & Social Science","subs":["practicing honesty and showing kindness to oneself and others;","recognizing the purpose of rules and practicing self-control;","being respectful of others and celebrating differences in ethnic origins, customs, and traditions;","working respectfully with one another to achieve a goal;","contributing one’s time and talents to help others in their homes, schools, and communities through jobs;","participating in classroom decision-making by voting; and","understanding that local and state government representatives are elected by citizens who vote."]},{"id":"1.HSS.CV.2","title":1.2,"text":"The student will apply history and social science skills to explain how communities honor local and national traditions and recognize designated Virginia holidays, including, but not limited to","grade":"Grade 1","strand":"Civics","subject":"History & Social Science","course":"History & Social Science","subs":["Labor Day;","Columbus Day (Yorktown Victory Day);","Election Day;","Veterans Day;","Thanksgiving Day;","Christmas Day;","New Year’s Day;","Martin Luther King, Jr. Day;","George Washington Day (commonly known as Presidents’ Day);","Memorial Day;","Juneteenth; and","Independence Day."]},{"id":"1.HSS.CV.3","title":1.3,"text":"The student will apply history and social science skills to describe the symbols and traditions that honor and foster patriotism in the United States by","grade":"Grade 1","strand":"Civics","subject":"History & Social Science","course":"History & Social Science","subs":["learning the Pledge of Allegiance and the National Anthem and the ways people express respect for the American flag;","explaining the symbolism of the colors, stars, and stripes of the American flag;","identifying the Virginia flag, state capitol building, the cardinal as the state bird, and the dogwood as the state flower; and","explaining why people use symbols and have traditions."]},{"id":"1.HSS.HY.4","title":1.4,"text":"The student will apply history and social science skills to understand Virginia’s history","grade":"Grade 1","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["identifying and describing important events and locations throughout the early history of the Commonwealth, including, but not limited to Werowocomoco and the first English colony in North America at Jamestown;","describing how life in various Virginia communities has changed over time; and","identifying local cities or counties on a map of Virginia."]},{"id":"1.HSS.HY.5","title":1.5,"text":"The student will apply history and social science skills to describe contributions of Virginia’s diverse people and the stories of changemakers in the history of Virginia and their contributions to our Commonwealth, including, but not limited to","grade":"Grade 1","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["Indigenous people:Chief Powhatan and Pocahontas;","Explorers: John Smith and Christopher Newport;","Presidents: George Washington, Thomas Jefferson, James Madison, and James Monroe; and","Barrier Breakers: John Mercer Langston, Booker T. Washington, Maggie L. Walker, Barbara Johns, Arthur R. Ashe, Jr., and L. Douglas Wilder."]},{"id":"1.HSS.GE.6","title":1.6,"text":"The student will apply history and social science skills to develop geographic skills by","grade":"Grade 1","strand":"Geography","subject":"History & Social Science","course":"History & Social Science","subs":["using basic map symbols, including references to land, water, cities, and roads;","using cardinal directions on maps;","locating Virginia, the United States, continents, and oceans on maps and globes; and","constructing simple maps and including a title, map legend or key, and compass rose."]},{"id":"1.HSS.GE.7","title":1.7,"text":"The student will apply history and social science skills to connect geography to historic events of Virginia and the United States by","grade":"Grade 1","strand":"Geography","subject":"History & Social Science","course":"History & Social Science","subs":["identifying landforms and bodies of water of Virginia and describing how they affect the way people live;","understanding that the location of Virginia determines its climate and results in four distinct seasons;","locating the site of the Jamestown colony; and","locating Richmond and Washington, D.C., on Virginia and United States maps."]},{"id":"1.HSS.EC.8","title":1.8,"text":"The student will apply history and social science skills to explain how individuals make economic choices to meet their basic needs by","grade":"Grade 1","strand":"Economics","subject":"History & Social Science","course":"History & Social Science","subs":["identifying the difference between goods and services;","describing how people can be both consumers and producers;","describing ways people work to earn and save money to purchase goods and services;","describing goods and services produced in Virginia; and","describing why people must make choices, prioritizing needs over wants."]},{"id":"1.MT.NS.1","title":1.1,"text":"The student will","grade":"Grade 1","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["count forward orally by ones to 110, starting at any number between 0 and 110;","write the numerals 0 to 110 in sequence and out-of-sequence;","count backward orally by ones when given any number between 1 and 30; and","count forward orally by ones, twos, fives, and tens to determine the total number of objects to 110."]},{"id":"1.MT.NS.2","title":1.2,"text":"The student, given up to 110 objects, will","grade":"Grade 1","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["group a collection into tens and ones and write the corresponding numeral;","compare two numbers between 0 and 110 represented pictorially or with concrete objects, using the words greater than, less than or equal to; and","order three or fewer sets from least to greatest and greatest to least."]},{"id":"1.MT.NS.3","title":1.3,"text":"The student, given an ordered set of ten objects and/or pictures, will indicate the ordinal position of each object, first through tenth.","grade":"Grade 1","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"1.MT.NS.4","title":1.4,"text":"The student will","grade":"Grade 1","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["represent and solve practical problems involving equal sharing with two or four sharers; and","represent and name fractions for halves and fourths, using models."]},{"id":"1.MT.NS.5","title":1.5,"text":"The student, given a familiar problem situation involving magnitude, will","grade":"Grade 1","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["select a reasonable order of magnitude from three given quantities: a one-digit numeral, a two-digit numeral, and a three-digit numeral (e.g., 5, 50, 500); and","explain the reasonableness of the choice."]},{"id":"1.MT.CE.6","title":1.6,"text":"The student will create and solve single-step story and picture problems using addition and subtraction within 20.","grade":"Grade 1","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"1.MT.CE.7","title":1.7,"text":"The student will","grade":"Grade 1","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":["recognize and describe with fluency part-whole relationships for numbers up to 10; and","demonstrate fluency with addition and subtraction within 10."]},{"id":"1.MT.MG.8","title":1.8,"text":"The student will determine the value of a collection of like coins (pennies, nickels, or dimes) whose total value is 100 cents or less.","grade":"Grade 1","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"1.MT.MG.9","title":1.9,"text":"The student will investigate the passage of time and","grade":"Grade 1","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["tell time to the hour and half-hour, using analog and digital clocks; and","read and interpret a calendar."]},{"id":"1.MT.MG.10","title":1.1,"text":"The student will use nonstandard units to measure and compare length, weight, and volume.","grade":"Grade 1","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"1.MT.MG.11","title":1.11,"text":"The student will","grade":"Grade 1","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["identify, trace, describe, and sort plane figures (triangles, squares, rectangles, and circles) according to number of sides, vertices, and angles; and","identify and describe representations of circles, squares, rectangles, and triangles in different environments, regardless of orientation, and explain reasoning."]},{"id":"1.MT.PS.12","title":1.12,"text":"The student will","grade":"Grade 1","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["collect, organize, and represent various forms of data using tables, picture graphs, and object graphs; and","read and interpret data displayed in tables, picture graphs, and object graphs, using the vocabulary more, less, fewer, greater than, less than, and equal to."]},{"id":"1.MT.PA.13","title":1.13,"text":"The student will sort and classify concrete objects according to one or two attributes.","grade":"Grade 1","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"1.MT.PA.14","title":1.14,"text":"The student will identify, describe, extend, create, and transfer growing and repeating patterns.","grade":"Grade 1","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"1.MT.PA.15","title":1.15,"text":"The student will demonstrate an understanding of equality through the use of the equal symbol.","grade":"Grade 1","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"1.SC.SE.1","title":1.1,"text":"The student will demonstrate an understanding of scientific and engineering practices by...","grade":"Grade 1","strand":"Scientific & Engineering Practices","subject":"Science","course":"Science","subs":["asking questions and defining problems (ask questions and make predictions based on observations, identify a simple problem that can be solved through the development of a new tool or improved object)","planning and carrying out investigations (with guidance, conduct investigations to produce data, identify characteristics and properties of objects by observations, use tools to measure relative length, weight, volume, and temperature of common objects)","interpreting, analyzing, and evaluating data (use and share pictures, drawings, and/or writings of observations, describe patterns and relationships, classify and arrange objects based on a single physical characteristic or property, organize and represent various forms of data using tables, picture graphs, and object graphs, read and interpret data displayed in tables, picture graphs, and object graphs, using the vocabulary more, less, fewer, greater than, less than, and equal to)","constructing and critiquing conclusions and explanations (make simple conclusions based on data or observations, recognize unusual or unexpected results)","developing and using models (use physical models to demonstrate simple phenomena and natural processes)","obtaining, evaluating, and communicating information (communicate observations and data using simple graphs, pictures, drawings, numbers, speech and/or writing)"]},{"id":"1.SC.FM.2","title":1.2,"text":"The student will investigate and understand that objects can move in different ways. Key ideas include","grade":"Grade 1","strand":"Force, Motion, & Energy","subject":"Science","course":"Science","subs":["objects may have straight, circular, spinning, and back-and-forth motions; and","objects may vibrate and produce sound."]},{"id":"1.SC.MA.3","title":1.3,"text":"The student will investigate and understand that objects are made from materials that can be described by their physical properties. Key ideas include","grade":"Grade 1","strand":"Matter","subject":"Science","course":"Science","subs":["objects are made of one or more materials with different physical properties and can be used for a variety of purposes;","when a material is changed in size most physical properties remain the same; and","the type and amount of material determine how much light can pass through an object."]},{"id":"1.SC.LP.4","title":1.4,"text":"The student will investigate and understand that plants have basic life needs and functional parts that allow them to survive. Key ideas include","grade":"Grade 1","strand":"Living Systems & Processes","subject":"Science","course":"Science","subs":["plants need nutrients, air, water, light, and a place to grow;","structures of plants perform specific functions; and","plants can be classified based on a variety of characteristics."]},{"id":"1.SC.LP.5","title":1.5,"text":"The student will investigate and understand that animals, including humans, have basic life needs that allow them to survive. Key ideas include","grade":"Grade 1","strand":"Living Systems & Processes","subject":"Science","course":"Science","subs":["animals need air, food, water, shelter, and space (habitat);","animals have different physical characteristics that perform specific functions; and","animals can be classified based on a variety of characteristics."]},{"id":"1.SC.ES.6","title":1.6,"text":"The student will investigate and understand that there is a relationship between the sun and Earth. Key ideas include","grade":"Grade 1","strand":"Earth & Space Systems","subject":"Science","course":"Science","subs":["the sun is the source of energy and light that warms the Earth’s land, air, and water; and","the sun’s relative position changes in the Earth’s sky throughout the day."]},{"id":"1.SC.ES.7","title":1.7,"text":"The student will investigate and understand that there are weather and seasonal changes. Key ideas include","grade":"Grade 1","strand":"Earth & Space Systems","subject":"Science","course":"Science","subs":["changes in temperature, light, and precipitation occur over time;","there are relationships between daily weather and the season; and","changes in temperature, light, and precipitation affect plants and animals, including humans."]},{"id":"1.SC.ER.8","title":1.8,"text":"The student will investigate and understand that natural resources can be used responsibly. Key ideas include","grade":"Grade 1","strand":"Earth Resources","subject":"Science","course":"Science","subs":["most natural resources are limited;","human actions can affect the availability of natural resources; and","reducing, reusing, and recycling are ways to conserve natural resources."]},{"id":"1.VA.CP.1","title":1.1,"text":"The student will apply creative thinking to artmaking.","grade":"Grade 1","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Experiment with materials.","Make unconventional combinations of ideas or objects in artwork."]},{"id":"1.VA.CP.2","title":1.2,"text":"The student will apply a creative process for artmaking.","grade":"Grade 1","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Examine a variety of solutions to art-making challenges.","Describe steps used in the creation of works of art."]},{"id":"1.VA.CC.3","title":1.3,"text":"The student will analyze and interpret artwork using art vocabulary.","grade":"Grade 1","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Describe the visual qualities and content of works of art.","Describe similarities and differences among works of art.","Describe how ideas, opinions, and emotions are communicated in works of art"]},{"id":"1.VA.CC.4","title":1.4,"text":"The student will apply creative thinking to artmaking.","grade":"Grade 1","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"1.VA.CC.5","title":1.5,"text":"The student will share a response to art and explain why viewers may have different responses to works of art.","grade":"Grade 1","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"1.VA.HC.6","title":1.6,"text":"The student will explore and recognize cultural and historical influences of art.","grade":"Grade 1","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":["Explain a variety of reasons why works of art can have importance.","Describe how art is an integral part of one’s culture."]},{"id":"1.VA.HC.7","title":1.7,"text":"The student will identify artwork and artists in the community and Commonwealth.","grade":"Grade 1","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"1.VA.HC.8","title":1.8,"text":"The student will identify appropriate sources of information for learning about art","grade":"Grade 1","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"1.VA.IA.9","title":1.9,"text":"The student will recognize how artists use current technology and contemporary media to create works of art.","grade":"Grade 1","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"1.VA.IA.10","title":1.1,"text":"The student will apply creative thinking to artmaking.","grade":"Grade 1","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"1.VA.IA.11","title":1.11,"text":"The student will identify connections between the arts by incorporating or responding to music, theatre, or dance in their artwork.","grade":"Grade 1","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"1.VA.TA.12","title":1.12,"text":"The student will identify and use the following in works of art:","grade":"Grade 1","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Color—primary, secondary","Line—zigzag, dotted, wavy, spiral.","Shape—geometric, organic.","Texture—visual, tactile.","Pattern—alternating, repeating."]},{"id":"1.VA.TA.13","title":1.13,"text":"The student will identify and apply spatial relationships for composition.","grade":"Grade 1","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Arrange shapes in space within the picture plane.","Identify and use figure-ground relationships.","Identify and use size relationships."]},{"id":"1.VA.TA.14","title":1.14,"text":"The student will create observational drawings of people and objects in the environment.","grade":"Grade 1","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"1.VA.TA.15","title":1.15,"text":"The student will apply motor skills (e.g., cutting, modeling, molding, tearing, weaving) to create two- and three-dimensional works of art.","grade":"Grade 1","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"1.VA.TA.16","title":1.16,"text":"The student will apply a variety of media, materials, techniques, and processes to create artwork.","grade":"Grade 1","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"1.VA.TA.17","title":1.17,"text":"The student will create works of art inspired by a variety of sources and subjects.","grade":"Grade 1","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Use the senses of sight, touch, and hearing.","Create works of art inspired by stories or poems, ideas, and themes.","Depict personal experiences."]}]