[{"id":"2.HSS.HY.5","title":2.5,"text":"The student will use history and social science skills to identify the geographic location, use of resources, and contributions of Indigenous peoples past and present, including","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["Indigenous nations and tribes of the Eastern Woodlands;","Indigenous nations and tribes of the Plains;","Indigenous nations and tribes of the Southwest; and","understanding Tribal Sovereignty, including but not limited to the importance of land, history, and culture."]},{"id":"2.HSS.HY.6","title":2.6,"text":"The student will use history and social science skills to identify the geographic location, use of resources, and contributions of European explorers, and their influence on the development of North America, including, but not limited to the English, French, and Spanish.","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":[]},{"id":"2.HSS.HY.7","title":2.7,"text":"The student will apply history and social science skills to describe the revolutionaries who fought for America’s freedom (1764–1781), including, but not limited to","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["John Adams;","Benjamin Franklin;","Alexander Hamilton;","Patrick Henry;","Thomas Jefferson;","James Madison (“Father of the Constitution”);","Paul Revere; and","George Washington (“Father of our Country”)."]},{"id":"2.HSS.HY.8","title":2.8,"text":"The student will apply history and social science skills to understand the principles of American democracy and relate them to the founding of the nation by","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["identifying reasons for the settlement of the thirteen colonies;","explaining the relationships between the colonies and Great Britain; and","identifying key components of the Declaration of Independence."]},{"id":"2.HSS.HY.9","title":2.9,"text":"The student will apply history and social science skills to understand key events in United States history including, but not limited to","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["recognizing the reasons for moving the nation’s capital from Philadelphia to Washington, D.C., and the importance of the nation’s capital; and","describing the impact of the Louisiana Purchase on the westward expansion of the United States."]},{"id":"2.HSS.HY.10","title":2.1,"text":"The student will describe the contributions and roles of changemakers in United States history, including, but not limited to","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["Scholars and Inventors: Benjamin Franklin, Benjamin Banneker, Thomas Jefferson, George Washington Carver, Booker T. Washington, Orville and Wilbur Wright, Steve Jobs, Jonas Salk, Thomas Edison, Alexander Graham Bell, and Mary Jackson;","Explorers and Adventurers: Meriwether Lewis, William Clark, and Sacagawea, Neil Armstrong, Amelia Earhart;","Reformers and Champions: Abraham Lincoln, Theodore “Teddy” Roosevelt, Helen Keller, Thurgood Marshall, Rosa Parks, Jackie Robinson, Cesar Chavez, Dr. Martin Luther King, Jr., Sen. Daniel Inouye, John F. Kennedy, and Barack Obama."]}]