[{"id":"3.HSS.HY.4","title":3.4,"text":"The student will apply history and social science skills to describe the geographic, political, economic, and social structures and innovations of ancient Egypt by","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["locating ancient Egypt on a map of the world;","connecting the geography of ancient Egypt and its economy;","identifying and explaining the government;","describing the arts and innovations; and","identifying and explaining the architecture and its influence in the world today."]},{"id":"3.HSS.HY.5","title":3.5,"text":"The student will apply history and social science skills to describe the geographic, political, economic, and social structures and innovations of ancient China by","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["locating ancient China on a map of the world;","connecting the geography of ancient China and its economy;","identifying and explaining the government;","describing the arts and innovations; and","identifying and explaining the architecture and its influence in the world today."]},{"id":"3.HSS.HY.6","title":3.6,"text":"The student will apply history and social science skills to describe the geographic, political, economic, and social structures and innovations of ancient Greece by","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["locating ancient Greece on a map of the world;","describing the unique geography of ancient Greece;","identifying and explaining direct democracy;","describing the arts and innovations; and","identifying and explaining the architecture and its influence in the world today."]},{"id":"3.HSS.HY.7","title":3.7,"text":"The student will apply history and social science skills to describe the geographic, political, economic, and social structures and innovations of ancient Rome by","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["locating ancient Rome on a map of the world;","connecting the geography of ancient Rome and its economy;","identifying and explaining representative democracy;","describing the arts and innovations; and","identifying and explaining the architecture and its influence in the world today."]},{"id":"3.HSS.HY.8","title":3.8,"text":"The student will apply history and social science skills to describe the geographic, political, economic, and social structures and innovations of ancient empire of Mali by","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["locating ancient empire of Mali on a map of the world;","connecting the geography of ancient empire of Mali and its economy;","identifying and explaining the government;","describing the arts and innovations; and","identifying and explaining the architecture and its influence in the world."]},{"id":"3.HSS.HY.9","title":3.9,"text":"The student will apply history and social science skills to explain the basic structure of the United States government by","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["explaining the purpose of governments and understanding that other countries have governments similar to and different from the United States;","explaining how the Constitution supports the structure of the United States government;","identifying and describing the three branches of government;","explaining what governments do at the national, state, and local level; and","explaining how local, state, and national governments are organized."]}]