[{"id":"3.CS.AP.1","title":3.1,"text":"The student will construct sets of step-by-step instructions (algorithms), both independently and collaboratively","grade":"Grade 3","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":["using sequencing;","using loops (a wide variety of patterns such as repeating patterns or growing patterns); and","using events."]},{"id":"3.CS.AP.2","title":3.2,"text":"The student will construct programs to accomplish tasks as a means of creative expression using a block or text based programming language, both independently and collaboratively","grade":"Grade 3","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":["using sequencing;","using loops (a wide variety of patterns such as repeating patterns or growing patterns); and","identifying events."]},{"id":"3.CS.AP.3","title":3.3,"text":"The student will analyze, correct, and improve (debug) an algorithm that includes sequencing, events, and loops.","grade":"Grade 3","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.AP.4","title":3.4,"text":"The student will create a plan as part of the iterative design process, independently and/or collaboratively, using a variety of strategies (e.g., pair programming, storyboard, flowchart, pseudocode, story map).","grade":"Grade 3","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.AP.5","title":3.5,"text":"The student will compare and contrast a group of items based on attributes or actions classified into at least two sets and two subsets.","grade":"Grade 3","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.AP.6","title":3.6,"text":"The student will break down (decompose) a larger problem into smaller subproblems, independently or collaboratively","grade":"Grade 3","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.AP.7","title":3.7,"text":"The student will give credit to sources when borrowing or changing ideas (e.g., using information and pictures created by others, using music created by others, remixing programming projects).","grade":"Grade 3","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.SYS.8","title":3.8,"text":"The student will model how a computing system works including input and output","grade":"Grade 3","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.SYS.9","title":3.9,"text":"The student will identify, using accurate terminology, simple hardware and software problems that may occur during use, and apply strategies for solving problems (e.g., rebooting the device, checking for power, checking network availability, closing and reopening an app).","grade":"Grade 3","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.CY.10","title":3.1,"text":"The student will identify problems that relate to inappropriate use of computing devices and networks.","grade":"Grade 3","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.CY.11","title":3.11,"text":"The student will create examples of strong passwords, explain why strong passwords should be used, and demonstrate proper use and protection of personal passwords.","grade":"Grade 3","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.DA.12","title":3.12,"text":"The student will use a computer to observe and analyze data in order to draw conclusions and make predictions.","grade":"Grade 3","strand":"Data & Analysis","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.DA.13","title":3.13,"text":"The student will create an artifact using computing systems to model the attributes and behaviors associated with a concept (e.g., day and night, animal life cycles, plant life cycles).","grade":"Grade 3","strand":"Data & Analysis","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.IC.14","title":3.14,"text":"The student will identify computing technologies that have changed the world and express how those technologies influence, and are influenced by, cultural practices.","grade":"Grade 3","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.IC.15","title":3.15,"text":"The student will identify the positive and negative impacts of the pervasiveness of computers and computing in daily life (e.g., downloading videos and audio files, electronic appliances, wireless Internet, mobile computing devices, GPS systems, wearable computing).","grade":"Grade 3","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.IC.16","title":3.16,"text":"The student will identify social and ethical issues that relate to computing devices and networks.","grade":"Grade 3","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS.NI.17","title":3.17,"text":"The students will discuss in partners and as a class that information can be transmitted using computing devices via a network (e.g., email, blogging, video messaging).","grade":"Grade 3","strand":"Networking & the Internet","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"3.CS24.AP.1","title":"3.AP.1","text":"The student will apply computational thinking to design algorithms to extend patterns, processes, or components of a problem.","grade":"Grade 3","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify a pattern in an algorithm, process, or a problem.","Decompose a problem or task into a subset of smaller problems.","Design an algorithm to extend either a pattern, process, or component of a problem."]},{"id":"3.CS24.AP.2","title":"3.AP.2","text":"The student will plan and implement algorithms that consist of events and conditional control structures using a block-based programming language.","grade":"Grade 3","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe the concept of a conditional control structure.","Create a design document to plan an algorithm using plain language, pseudocode, or diagrams."]},{"id":"3.CS24.AP.3","title":"3.AP.3","text":"The student will use the iterative design process to create, test, and debug programs containing events, loops, and conditional structures in a block-based programming tool.","grade":"Grade 3","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create and test programs that consist of events, loops, and conditional structures.","Analyze and describe program results to assess validity of outcome.","Revise and improve programs to resolve errors or produce desired outcome."]},{"id":"3.CS24.CSY.1","title":"3.CSY.1","text":"The student will model how computing devices within a computing system work.","grade":"Grade 3","strand":"Computing Systems","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe the role of a processor in a computing system.","Explain the relationship between the inputs, processors, and outputs.","Discuss various types of input data a computer can accept and use.","Model how a computing system works including input and output, processors, and sensors."]},{"id":"3.CS24.CSY.2","title":"3.CSY.2","text":"The student will use accurate terminology when troubleshooting problems when a computing system is not working as expected.","grade":"Grade 3","strand":"Computing Systems","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify common troubleshooting strategies used to address a variety of hardware and software problems.","Explain and apply troubleshooting strategies related to simple hardware and software problems."]},{"id":"3.CS24.CYB.1","title":"3.CYB.1","text":"The student will apply safe practices to protect private information.","grade":"Grade 3","strand":"Cybersecurity","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify and distinguish personal information that should be private.","Describe the importance of using a strong password.","Create and use strong passwords to protect private information"]},{"id":"3.CS24.CYB.2","title":"3.CYB.2","text":"The student will identify the relationship between passwords and security risk.","grade":"Grade 3","strand":"Cybersecurity","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe how authentication and authorization protect private information.","Identify multiple authentication methods.","Discuss the security risk posed by not having a strong password."]},{"id":"3.CS24.CYB.3","title":"3.CYB.3","text":"The student will define and explain cybersecurity.","grade":"Grade 3","strand":"Cybersecurity","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Define cybersecurity.","Research and identify problems and consequences related to inappropriate use of computing devices and networks.","Model safe and responsible behaviors when using computing technologies and online communication."]},{"id":"3.CS24.DA.1","title":"3.DA.1","text":"The student will gather, store, and organize data to evaluate trends and identify patterns using a computing device.","grade":"Grade 3","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Formulate questions that require the collection or acquisition of data.","Gather, organize, sort, and store data.","Examine a labeled dataset to identify potential problems within the data.","Discuss how data discrepancies or problems impact predictions and results.","Draw conclusions and make predictions based on observed data."]},{"id":"3.CS24.DA.2","title":"3.DA.2","text":"The student will create and evaluate data representations and conclusions.","grade":"Grade 3","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create charts and graphs based on data collection.","Analyze data to identify patterns, draw conclusions, and make predictions."]},{"id":"3.CS24.DA.3","title":"3.DA.3","text":"The student will create models that can represent a physical object or process.","grade":"Grade 3","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create a model to represent a physical object or process.","Identify how computing devices are used to create models.","Discuss the advantages and disadvantages of using computing devices to create models."]},{"id":"3.CS24.IC.1","title":"3.IC.1","text":"The student will identify and examine the positive and negative impacts of the prevalence of computing technologies.","grade":"Grade 3","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify computing technologies that have changed the world.","Examine and explain how computing technologies influence and are influenced by culture.","Identify social and ethical issues related to the use of computing technologies."]},{"id":"3.CS24.IC.2","title":"3.IC.2","text":"The student will discuss and describe strategies to manage screen time.","grade":"Grade 3","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Define and describe screen time.","Explain the importance of responsible screen time management.","Discuss how screen time choices affect one's personal health and interactions with others"]},{"id":"3.CS24.IC.3","title":"3.IC.3","text":"The student will identify and describe computing technology careers and their impact on society.","grade":"Grade 3","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Research computing technology careers.","Describe the impact careers in computing technology have on society."]},{"id":"3.CS24.IC.4","title":"3.IC.4","text":"The student will demonstrate how to use information created by others with permission.","grade":"Grade 3","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Discuss copyright, piracy, and plagiarism.","Demonstrate how to use information created by others."]},{"id":"3.CS24.NI.1","title":"3.NI.1","text":"The student will describe computing networks.","grade":"Grade 3","strand":"Networking & the Internet","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Differentiate between a network and the Internet.","Identify the components of a computing network.","Describe how a computing device connects to a network.","Identify ways networks are used to transmit information."]},{"id":"3.EN.OL.1","title":3.1,"text":"The student will use effective communication skills in group activities.","grade":"Grade 3","strand":"Oral Language","subject":"English","course":"English","subs":["Listen attentively by making eye contact, facing the speaker, asking questions, and summarizing what is said.","Ask and respond to questions from teachers and other group members.","Explain what has been learned.","Use language appropriate for context.","Increase listening and speaking vocabularies."]},{"id":"3.EN.OL.2","title":3.2,"text":"The student will present brief oral reports using visual media.","grade":"Grade 3","strand":"Oral Language","subject":"English","course":"English","subs":["Speak clearly.","Use appropriate volume and pitch.","Speak at an understandable rate.","Organize ideas sequentially or around major points of information.","Use contextually appropriate language and specific vocabulary to communicate ideas."]},{"id":"3.EN.RD.3","title":3.3,"text":"The student will apply word-analysis skills when reading.","grade":"Grade 3","strand":"Reading","subject":"English","course":"English","subs":["Use knowledge of regular and irregular vowel patterns.","Decode regular multisyllabic words."]},{"id":"3.EN.RD.4","title":3.4,"text":"The student will expand vocabulary when reading.","grade":"Grade 3","strand":"Reading","subject":"English","course":"English","subs":["Use knowledge of homophones.","Use knowledge of roots, affixes, synonyms, and antonyms.","Apply meaning clues, language structure, and phonetic strategies.","Use context to clarify meaning of unfamiliar words.","Discuss meanings of words and develop vocabulary by listening and reading a variety of texts.","Use vocabulary from other content areas.","Use word reference resources including the glossary, dictionary, and thesaurus."]},{"id":"3.EN.RD.5","title":3.5,"text":"The student will read and demonstrate comprehension of fictional text and poetry.","grade":"Grade 3","strand":"Reading","subject":"English","course":"English","subs":["Set a purpose for reading.","Make connections between previous experiences and reading selections.","Make, confirm, or revise predictions.","Compare and contrast settings, characters, and events.","Identify the author’s purpose.","Ask and answer questions about what is read.","Draw conclusions about text.","Identify the problem and solution.","Identify the main idea.","Identify supporting details.","Use reading strategies to monitor comprehension throughout the reading process.","Differentiate between fiction and nonfiction.","Read with fluency and accuracy."]},{"id":"3.EN.RD.6","title":3.6,"text":"The student will continue to read and demonstrate comprehension of nonfiction texts.","grade":"Grade 3","strand":"Reading","subject":"English","course":"English","subs":["Identify the author’s purpose.","Use prior and background knowledge as context for new learning.","Preview and use text features.","Ask and answer questions about what is read.","Draw conclusions based on text.","Summarize major points found in nonfiction texts.","Identify the main idea.","Identify supporting details.","Compare and contrast the characteristics of biographies and autobiographies.","Use reading strategies to monitor comprehension throughout the reading process.","Identify new information gained from reading.","Read with fluency and accuracy."]},{"id":"3.EN.RD.7","title":3.7,"text":"The student will demonstrate comprehension of information from a variety of print and electronic resources.","grade":"Grade 3","strand":"Reading","subject":"English","course":"English","subs":["Use encyclopedias and other reference books, including online reference materials.","Use table of contents, indices, and charts."]},{"id":"3.EN.WR.8","title":3.8,"text":"The student will write legibly in cursive.","grade":"Grade 3","strand":"Writing","subject":"English","course":"English","subs":[]},{"id":"3.EN.WR.9","title":3.9,"text":"The student will write for a variety of purposes.","grade":"Grade 3","strand":"Writing","subject":"English","course":"English","subs":["Identify the intended audience.","Use a variety of prewriting strategies.","Write a clear topic sentence focusing on the main idea.","Write a paragraph on the same topic.","Use strategies for organization of information and elaboration according to the type of writing.","Include details that elaborate the main idea.","Revise writing for clarity of content using specific vocabulary and information."]},{"id":"3.EN.WR.10","title":3.1,"text":"The student will edit writing for correct grammar, capitalization, punctuation, and spelling.","grade":"Grade 3","strand":"Writing","subject":"English","course":"English","subs":["Use complete sentences.","Use transition words to vary sentence structure.","Use the word I in compound subjects.","Use past and present verb tense.","Use singular possessives.","Use commas in a simple series.","Use simple abbreviations.","Use apostrophes in contractions with pronouns and in possessives.","Use the articles a, an, and the correctly.","Use correct spelling for frequently used sight words, including irregular plurals."]},{"id":"3.EN.WR.11","title":3.11,"text":"The student will write a short report.","grade":"Grade 3","strand":"Writing","subject":"English","course":"English","subs":["Construct questions about the topic.","Identify appropriate resources.","Collect and organize information about the topic into a short report.","Understand the difference between plagiarism and using own words."]},{"id":"3.EN.WR.12","title":3.12,"text":"The student will use available technology for reading and writing.","grade":"Grade 3","strand":"Writing","subject":"English","course":"English","subs":[]},{"id":"3.HSS.SK.0","title":"Skills 3","text":"The student will apply history and social science skills to the content by","grade":"Grade 3","strand":"Skills","subject":"History & Social Science","course":"History & Social Science","subs":["analyzing and interpreting information sources, including, but not limited to artifacts, primary and secondary sources, charts, graphs, and diagrams;","applying geographic skills to identify and understand geographic features and connections;","developing questions, demonstrating curiosity, and engaging in critical thinking and analysis;","using evidence to construct timelines, classify events, and distinguish fact from opinion;","comparing and contrasting people, places, and events;","identifying cause-and-effect relationships to clarify and explain content;","using economic decision-making models to make informed economic decisions;","practicing civility, respect, hard work, honesty, trustworthiness, and responsible citizenship skills; and","using content vocabulary to demonstrate learning through oral and written products."]},{"id":"3.HSS.CV.1","title":3.1,"text":"The student will apply history and social science skills to define citizenship and explain the rights and responsibilities of United States citizenship by","grade":"Grade 3","strand":"Civics","subject":"History & Social Science","course":"History & Social Science","subs":["recognizing that Americans are people of diverse ethnic origins, customs, and traditions that are united by the basic principles of a republican form of government and respect for individual rights and freedoms;","describing the rights guaranteed to citizens in the First Amendment;","understanding the importance of supporting and defending the U.S. Constitution and the Bill of Rights;","respecting and following local, state, and federal laws;","taking part in the voting process when making classroom decisions;","running for elected office;","serving on a jury;","paying local, state, and federal taxes;","describing the purpose of rules; and","understanding responsible digital citizenship."]},{"id":"3.HSS.GE.2","title":3.2,"text":"The student will apply history and social science skills to locate and describe major geographic features of Africa, Antarctica, Asia, Australia, Europe, North America, and South America by","grade":"Grade 3","strand":"Geography","subject":"History & Social Science","course":"History & Social Science","subs":["locating and describing the seven continents and the five oceans; and","locating and describing the equator, the Prime Meridian, and the four hemispheres."]},{"id":"3.HSS.GE.3","title":3.3,"text":"The student will apply history and social science skills to describe major geographic features of ancient societies on a world map by","grade":"Grade 3","strand":"Geography","subject":"History & Social Science","course":"History & Social Science","subs":["identifying and locating major bodies of water;","identifying and locating major mountain ranges;","describing how geographic features impacted the lives of individuals; and","connecting the geography to major historic events."]},{"id":"3.HSS.HY.4","title":3.4,"text":"The student will apply history and social science skills to describe the geographic, political, economic, and social structures and innovations of ancient Egypt by","grade":"Grade 3","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["locating ancient Egypt on a map of the world;","connecting the geography of ancient Egypt and its economy;","identifying and explaining the government;","describing the arts and innovations; and","identifying and explaining the architecture and its influence in the world today."]},{"id":"3.HSS.HY.5","title":3.5,"text":"The student will apply history and social science skills to describe the geographic, political, economic, and social structures and innovations of ancient China by","grade":"Grade 3","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["locating ancient China on a map of the world;","connecting the geography of ancient China and its economy;","identifying and explaining the government;","describing the arts and innovations; and","identifying and explaining the architecture and its influence in the world today."]},{"id":"3.HSS.HY.6","title":3.6,"text":"The student will apply history and social science skills to describe the geographic, political, economic, and social structures and innovations of ancient Greece by","grade":"Grade 3","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["locating ancient Greece on a map of the world;","describing the unique geography of ancient Greece;","identifying and explaining direct democracy;","describing the arts and innovations; and","identifying and explaining the architecture and its influence in the world today."]},{"id":"3.HSS.HY.7","title":3.7,"text":"The student will apply history and social science skills to describe the geographic, political, economic, and social structures and innovations of ancient Rome by","grade":"Grade 3","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["locating ancient Rome on a map of the world;","connecting the geography of ancient Rome and its economy;","identifying and explaining representative democracy;","describing the arts and innovations; and","identifying and explaining the architecture and its influence in the world today."]},{"id":"3.HSS.HY.8","title":3.8,"text":"The student will apply history and social science skills to describe the geographic, political, economic, and social structures and innovations of ancient empire of Mali by","grade":"Grade 3","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["locating ancient empire of Mali on a map of the world;","connecting the geography of ancient empire of Mali and its economy;","identifying and explaining the government;","describing the arts and innovations; and","identifying and explaining the architecture and its influence in the world."]},{"id":"3.HSS.HY.9","title":3.9,"text":"The student will apply history and social science skills to explain the basic structure of the United States government by","grade":"Grade 3","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["explaining the purpose of governments and understanding that other countries have governments similar to and different from the United States;","explaining how the Constitution supports the structure of the United States government;","identifying and describing the three branches of government;","explaining what governments do at the national, state, and local level; and","explaining how local, state, and national governments are organized."]},{"id":"3.HSS.EC.10","title":3.1,"text":"The student will apply history and social science skills to explain the basic economic principles by","grade":"Grade 3","strand":"Economics","subject":"History & Social Science","course":"History & Social Science","subs":["defining production, distribution, and consumption of goods and services;","understanding different cultures and the natural, human, and capital resources they use in the production of goods and services;","recognizing that because people and regions cannot produce everything they want, they specialize in what they do best and trade for the rest; and","identifying examples of making an economic choice and explaining the idea of opportunity cost."]},{"id":"3.MT.NS.1","title":3.1,"text":"The student will","grade":"Grade 3","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["read, write, and identify the place and value of each digit in a six-digit whole number, with and without models;","round whole numbers, 9,999 or less, to the nearest ten, hundred, and thousand; and","compare and order whole numbers, each 9,999 or less."]},{"id":"3.MT.NS.2","title":3.2,"text":"The student will","grade":"Grade 3","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["name and write fractions and mixed numbers represented by a model;","represent fractions and mixed numbers with models and symbols; and","compare fractions having like and unlike denominators, using words and symbols (>, <, =, or ≠), with models."]},{"id":"3.MT.CE.3","title":3.3,"text":"The student will","grade":"Grade 3","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":["estimate and determine the sum or difference of two whole numbers; and","create and solve single-step and multistep practical problems involving sums or differences of two whole numbers, each 9,999 or less."]},{"id":"3.MT.CE.4","title":3.4,"text":"The student will","grade":"Grade 3","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":["represent multiplication and division through 10 × 10, using a variety of approaches and models;","create and solve single-step practical problems that involve multiplication and division through 10 x 10; and","demonstrate fluency with multiplication facts of 0, 1, 2, 5, and 10; and","solve single-step practical problems involving multiplication of whole numbers, where one factor is 99 or less and the second factor is 5 or less."]},{"id":"3.MT.CE.5","title":3.5,"text":"The student will solve practical problems that involve addition and subtraction with proper fractions having like denominators of 12 or less.","grade":"Grade 3","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"3.MT.MG.6","title":3.6,"text":"The student will","grade":"Grade 3","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["determine the value of a collection of bills and coins whose total value is $5.00 or less;","compare the value of two sets of coins or two sets of coins and bills; and","make change from $5.00 or less."]},{"id":"3.MT.MG.7","title":3.7,"text":"The student will estimate and use U.S. Customary and metric units to measure","grade":"Grade 3","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["length to the nearest half inch, inch, foot, yard, centimeter, and meter; and","liquid volume in cups, pints, quarts, gallons, and liters."]},{"id":"3.MT.MG.8","title":3.8,"text":"The student will estimate and","grade":"Grade 3","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["measure the distance around a polygon in order to determine its perimeter using U.S. Customary and metric units; and","count the number of square units needed to cover a given surface in order to determine its area."]},{"id":"3.MT.MG.9","title":3.9,"text":"The student will","grade":"Grade 3","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["tell time to the nearest minute, using analog and digital clocks;","solve practical problems related to elapsed time in one-hour increments within a 12-hour period; and","identify equivalent periods of time and solve practical problems related to equivalent periods of time."]},{"id":"3.MT.MG.10","title":3.1,"text":"The student will read temperature to the nearest degree.","grade":"Grade 3","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"3.MT.MG.11","title":3.11,"text":"The student will identify and draw representations of points, lines, line segments, rays, and angles.","grade":"Grade 3","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"3.MT.MG.12","title":3.12,"text":"The student will","grade":"Grade 3","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["define polygon;","identify and name polygons with 10 or fewer sides; and","combine and subdivide polygons with three or four sides and name the resulting polygon(s)."]},{"id":"3.MT.MG.13","title":3.13,"text":"The student will identify and describe congruent and noncongruent figures.","grade":"Grade 3","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"3.MT.PS.14","title":3.14,"text":"The student will investigate and describe the concept of probability as a measurement of chance and list possible outcomes for a single event.","grade":"Grade 3","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"3.MT.PS.15","title":3.15,"text":"The student will","grade":"Grade 3","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["collect, organize, and represent data in pictographs or bar graphs; and","read and interpret data represented in pictographs and bar graphs."]},{"id":"3.MT.PA.16","title":3.16,"text":"The student will identify, describe, create, and extend patterns found in objects, pictures, numbers and tables.","grade":"Grade 3","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"3.MT.PA.17","title":3.17,"text":"The student will create equations to represent equivalent mathematical relationships.","grade":"Grade 3","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"3.SC.SE.1","title":3.1,"text":"The student will demonstrate an understanding of scientific and engineering practices by...","grade":"Grade 3","strand":"Scientific & Engineering Practices","subject":"Science","course":"Science","subs":["asking questions and defining problems (ask questions that can be investigated and predict reasonable outcomes, ask questions about what would happen if a variable is changed, define a simple design problem that can be solved through the development of an object, tool, process, or system)","planning and carrying out investigations (with guidance, plan and conduct investigations, use appropriate methods and/or tools for collecting data, estimate length, mass, volume, and temperature, measure length, mass, volume, and temperature in metric and U.S. Customary units using proper tools, measure elapsed time, use tools and/or materials to design and/or build a device that solves a specific problem)","interpreting, analyzing, and evaluating data (organize and represent data in pictographs or bar graphs, read, interpret, and analyze data represented in pictographs and bar graphs, analyze data from tests of an object or tool to determine if it works as intended)","constructing and critiquing conclusions and explanations (use evidence (measurements, observations, patterns) to construct or support an explanation, generate and/or compare multiple solutions to a problem, describe how scientific ideas apply to design solutions)","developing and using models (use evidence (use models to demonstrate simple phenomena and natural processes, develop a model (e.g., diagram or simple physical prototype) to illustrate a proposed object, tool, or process)","obtaining, evaluating, and communicating information (read and comprehend reading-level appropriate texts and/or other reliable media, communicate scientific information, design ideas, and/or solutions with others)"]},{"id":"3.SC.FM.2","title":3.2,"text":"The student will investigate and understand that the direction and size of force affects the motion of an object. Key ideas include","grade":"Grade 3","strand":"Force, Motion, & Energy","subject":"Science","course":"Science","subs":["multiple forces may act on an object;","the net force on an object determines how an object moves;","simple machines increase or change the direction of a force; and","simple and compound machines have many applications."]},{"id":"3.SC.MA.3","title":3.3,"text":"The student will investigate and understand how materials interact with water. Key ideas include","grade":"Grade 3","strand":"Matter","subject":"Science","course":"Science","subs":["solids and liquids mix with water in different ways; and","many solids dissolve more easily in hot water than in cold water."]},{"id":"3.SC.LP.4","title":3.4,"text":"The student will investigate and understand that adaptations allow organisms to satisfy life needs and respond to the environment. Key ideas include","grade":"Grade 3","strand":"Living Systems & Processes","subject":"Science","course":"Science","subs":["populations may adapt over time;","adaptations may be behavioral or physical; and","fossils provide evidence about the types of organisms that lived long ago as well as the nature of their environments."]},{"id":"3.SC.LP.5","title":3.5,"text":"The student will investigate and understand that aquatic and terrestrial ecosystems support a diversity of organisms. Key ideas include","grade":"Grade 3","strand":"Living Systems & Processes","subject":"Science","course":"Science","subs":["ecosystems are made of living and nonliving components of the environment; and","relationships exist among organisms in an ecosystem."]},{"id":"3.SC.ES.6","title":3.6,"text":"The student will investigate and understand that soil is important in ecosystems. Key ideas include","grade":"Grade 3","strand":"Earth & Space Systems","subject":"Science","course":"Science","subs":["soil, with its different components, is important to organisms; and","soil provides support and nutrients necessary for plant growth."]},{"id":"3.SC.ES.7","title":3.7,"text":"The student will investigate and understand that there is a water cycle and water is important to life on Earth. Key ideas include","grade":"Grade 3","strand":"Earth & Space Systems","subject":"Science","course":"Science","subs":["there are many reservoirs of water on Earth;","the energy from the sun drives the water cycle; and","the water cycle involves specific processes."]},{"id":"3.SC.ER.8","title":3.8,"text":"The student will investigate and understand that natural events and humans influence ecosystems. Key ideas include","grade":"Grade 3","strand":"Earth Resources","subject":"Science","course":"Science","subs":["human activity affects the quality of air, water, and habitats;","water is limited and needs to be conserved;","fire, flood, disease, and erosion affect ecosystems; and","soil is a natural resource and should be conserved."]},{"id":"3.VA.CP.1","title":3.1,"text":"The student will apply creative thinking to artmaking.","grade":"Grade 3","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Use imaginative and expressive strategies to create works of art.","Create work in collaboration with others."]},{"id":"3.VA.CP.2","title":3.2,"text":"The student will apply a creative process for artmaking.","grade":"Grade 3","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Identify innovative solutions used by artists to solve artmaking challenges","Describe and use steps of the artmaking process, including brainstorming,preliminary sketching, and planning, to create works of art.","Collaborate with peers to identify ways to further develop an artwork."]},{"id":"3.VA.CC.3","title":3.3,"text":"The student will analyze and interpret artwork using art vocabulary.","grade":"Grade 3","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Identify distinguishing characteristics of a selection of art, such as landscape, portrait, still life, and narrative works.","Analyze personal works of art, using visual art vocabulary, such as the elements of art and/or principles of design.","Identify how works of art and craft communicate aspects of times, places, and cultures."]},{"id":"3.VA.CC.4","title":3.4,"text":"The student will express informed judgments about works of art.","grade":"Grade 3","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"3.VA.CC.5","title":3.5,"text":"The student will demonstrate skills needed to work collaboratively in an art community.","grade":"Grade 3","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Ask clarifying questions.","Take responsibility for the care of art tools and materials."]},{"id":"3.VA.HC.6","title":3.6,"text":"The student will explore and examine cultural and historical influences of art.","grade":"Grade 3","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":["Identify how history, culture, and the visual arts influence each other.","Compare and contrast works of art created by artists of diverse cultures.","Examine the relationship between form and function in the artifacts of a culture.","Compare and contrast art and architecture from a variety of cultures."]},{"id":"3.VA.HC.7","title":3.7,"text":"The student will determine reasons why art has value to people and communities.","grade":"Grade 3","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"3.VA.HC.8","title":3.8,"text":"The student will demonstrate ethical use of the Internet when exploring art topics.","grade":"Grade 3","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"3.VA.IA.9","title":3.9,"text":"The student will identify a variety of artists and art careers.","grade":"Grade 3","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"3.VA.IA.10","title":3.1,"text":"The student will explore and investigate the use of technology for creating and editing works of art.","grade":"Grade 3","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"3.VA.IA.11","title":3.11,"text":"The student will explain authentic opportunities for artmaking that demonstrate understanding of a concept learned in another content area.","grade":"Grade 3","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"3.VA.TA.12","title":3.12,"text":"The student will use the following in works of art:","grade":"Grade 3","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Color—intermediate, warm, cool.","Space—positive, negative.","Balance—symmetry, asymmetry, radial.","Contrast.","Pattern—decorative repeating motifs"]},{"id":"3.VA.TA.13","title":3.13,"text":"The student will identify and use foreground, middle ground, and background in twodimensional works of art.","grade":"Grade 3","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"3.VA.TA.14","title":3.14,"text":"The student will use organic and geometric shapes in observational drawing.","grade":"Grade 3","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"3.VA.TA.15","title":3.15,"text":"The student will identify quality and technical skill in works of art.","grade":"Grade 3","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"3.VA.TA.16","title":3.16,"text":"The student will use subtractive and additive processes in various media, including clay.","grade":"Grade 3","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"3.VA.TA.17","title":3.17,"text":"The student will develop ideas inspired by a variety of sources, including print, nonprint, and contemporary media, for incorporation into works of art.","grade":"Grade 3","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]}]