[{"id":"4.CS24.AP.1","title":"4.AP.1","text":"The student will apply computational thinking to identify patterns and design algorithms to compare and contrast multiple algorithms used for the same task.","grade":"Grade 4","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Decompose an algorithm, process, or problem into a subset of smaller problems.","Identify multiple algorithms for the same task.","Describe patterns within multiple algorithms.","Determine which algorithm is most effective for a given task."]},{"id":"4.CS24.AP.2","title":"4.AP.2","text":"The student will plan and implement algorithms that consist of sequencing, loops, variables, user input, and conditional control structures using a blockbased programming language.","grade":"Grade 4","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify user input and its role in improving a program.","Describe the concept of a variable.","Read and explain a design document to trace and predict an algorithm using plain language, pseudocode, or diagrams.","Create a design document to plan an algorithm using plain language, pseudocode, or diagrams.","Write programs that initialize, assign values to, name, and modify variables."]},{"id":"4.CS24.AP.3","title":"4.AP.3","text":"The student will use the iterative design process to create, test, and debug programs containing sequencing, loops, variables, user inputs, and conditional control structures in a block-based programming tool.","grade":"Grade 4","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create and test programs that consist of sequencing, loops, variables, user inputs, and conditional control structures.","Create and use variables to store and process data.","Trace and predict the value of variables that change over the course of the program's runtime.","Analyze and describe program results to assess validity of outcomes.","Revise and improve programs to resolve errors or produce desired outcomes."]}]