[{"id":"4.EN.RD.4","title":4.4,"text":"The student will expand vocabulary when reading.","strand":"Reading","subject":"English","course":"English","subs":["Use context to clarify meanings of unfamiliar words.","Use knowledge of roots, affixes, synonyms, antonyms, and homophones.","Use word-reference materials, including the glossary, dictionary, and thesaurus.","Develop vocabulary by listening to and reading a variety of texts.","Use vocabulary from other content areas."]},{"id":"4.EN.RD.5","title":4.5,"text":"The student will read and demonstrate comprehension of fictional texts, narrative nonfiction texts, and poetry.","strand":"Reading","subject":"English","course":"English","subs":["Explain the author’s purpose.","Describe how the choice of language, setting, characters, and information contributes to the author’s purpose.","Identify the main idea.","Summarize supporting details.","Identify the problem and solution.","Describe the relationship between text and previously read materials.","Identify sensory words.","Draw conclusions/make inferences about text.","Make, confirm, or revise predictions.","Identify cause and effect relationships.","Use reading strategies throughout the reading process to monitor comprehension.","Read with fluency and accuracy."]},{"id":"4.EN.RD.6","title":4.6,"text":"The student will read and demonstrate comprehension of nonfiction texts.","strand":"Reading","subject":"English","course":"English","subs":["Use text structures, such as type, headings, and graphics, to predict and categorize information in both print and digital texts.","Formulate questions that might be answered in the selection.","Explain the author’s purpose.","Identify the main idea.","Summarize supporting details.","Draw conclusions and make simple inferences using textual information as support.","Distinguish between cause and effect.","Distinguish between fact and opinion.","Use prior knowledge and build additional background knowledge as context for new learning.","Identify new information gained from reading.","Use reading strategies throughout the reading process to monitor comprehension.","Read with fluency and accuracy."]}]