[{"id":"4.VS.CWE.7","title":"VS.7","text":"The students will apply history and social science skills to understand the key people, events, and issues of the Civil War and Virginia’s role by","strand":"Civil War and Postwar Eras","subject":"Virginia Studies","course":"Virginia Studies","subs":["explaining the role of John Brown and the impact of the raid at Harper’s Ferry;","describing how the institution of slavery was the cause of the Civil War, and secondary factors that contributed to the secession of the southern states;","explaining the significance of the Underground Railroad and the contributions of Harriet Tubman;","explaining major events and issues that divided Virginians and led to secession, war, and the creation of West Virginia;","identifying major battles that took place in Virginia;","identifying and explaining the leadership roles of Virginians, including, but not limited to Thomas “Stonewall” Jackson, Robert E. Lee, William Harvey Carney, Winfield Scott, and Powhatan Beaty; and","evaluating the experiences and contributions of Indigenous Peoples and enslaved and free Blacks and their allies during the war, including, but not limited to Elizabeth Van Lew and Mary Bowser."]},{"id":"4.VS.CWE.8","title":"VS.8","text":"The student will apply history and social science skills to explain the reconstruction of Virginia following the Civil War by","strand":"Civil War and Postwar Eras","subject":"Virginia Studies","course":"Virginia Studies","subs":["describing what the Thirteenth, Fourteenth, and Fifteenth Amendments to the Constitution accomplished;","examining the effects of Reconstruction on life in Virginia;","describing the role that the “Freedmen’s Schools” played in the lives of African Americans in Virginia after the Civil War;","discussing the election of African American leader John Mercer to Congress in 1890;","describing the effect of the Supreme Court’s decision in Plessy v. Ferguson; and","analyzing the effects of segregation and “Jim Crow” laws on life in Virginia."]},{"id":"4.VS.CWE.9","title":"VS.9","text":"The student will apply history and social science skills to understand the ways in which Virginia became interconnected and diverse by","strand":"Civil War and Postwar Eras","subject":"Virginia Studies","course":"Virginia Studies","subs":["explaining the importance of railroads, waterways, new industries, and the growth of cities to Virginia’s economic development in the late 1800s; and'","explaining the economic and social transition from a rural society to a more urban society."]}]