[{"id":"5.CS24.AP.1","title":"5.AP.1","text":"The student will apply computational thinking to identify patterns, make use of decomposition to break down problems or processes into sub-components, and design algorithms.","grade":"Grade 5","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify patterns and repeated steps in an algorithm, problem, or process.","Decompose a problem or process into a subset of smaller problems or groups of sequential instructions.","Abstract relevant information to identify essential details.","Design an algorithm to solve a problem."]},{"id":"5.CS24.AP.2","title":"5.AP.2","text":"The student will plan and implement algorithms that consist of sequencing, loops, variables, user input, and nested conditional control structures using a block-based programming language.","grade":"Grade 5","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe the concept of nested conditional control structure.","Create a design document to trace and predict an algorithm using plain language, pseudocode, or diagrams.","Read, write, and interpret nested conditional control structures: \"if-else\" and \"ifelse\"; if-else statements."]},{"id":"5.CS24.AP.3","title":"5.AP.3","text":"The student will use the iterative design process to create, test, and debug programs containing sequencing, loops, variables, user inputs, nested conditional control structures, and two-way branching conditional control structures in a block-based programming tool.","grade":"Grade 5","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Use accurate terminology to describe and explain the iterative design process.","Create and test programs that consist of sequencing, loops, variables, user inputs, nested conditional control structures, and two-way branching conditional control structures.","Trace and predict outcomes of programs.","Analyze and describe program results to assess validity of outcomes.","Revise and improve programs to resolve errors or produce desired outcomes."]}]