[{"id":"5.CS24.IC.1","title":"5.IC.1","text":"The student will analyze the impact of inappropriate use of computing technologies.","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Predict consequences for inappropriate uses of computing technologies.","Describe how technology-related problems can be avoided or prevented.","Develop solutions for a scenario involving inappropriate use of computing technologies."]},{"id":"5.CS24.IC.2","title":"5.IC.2","text":"The student will explain the potential impact of excessive screen time on academic performance.","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Analyze data to determine the impact of screen time on academic performance.","Describe how academic behaviors that lead to academic success are impacted by daily screen time.","Differentiate usage of screen time that benefit and hinder academic performance."]},{"id":"5.CS24.IC.3","title":"5.IC.3","text":"The student will identify the impact of computing technologies on the workforce, culture, and global society.","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Research and analyze computing technology careers in global society.","Examine the impacts of diversity and inclusivity in computing technology fields globally.","Explore the impact of emerging technologies on workforce, culture, and global society."]},{"id":"5.CS24.IC.4","title":"5.IC.4","text":"The student will observe and examine intellectual property rights when considering the use of open-source licenses and copyrights.","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Distinguish between open-source licenses and copyrights.","Research risks associated with inappropriate use of various digital information sources.","Describe and use strategies to protect online digital content and resources."]},{"id":"5.CS24.IC.5","title":"5.IC.5","text":"The student will examine the effects of social interactions due to computing technologies.","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["List and explain how advances in computing technologies impact communication and collaboration.","Describe how computing technologies can be designed to engage and interact with users including those with diverse needs.","Evaluate activities conducted in the physical and online environments.","Create an artifact that illustrates a solution to address the need or want of a user"]}]