[{"id":"5.CS.AP.1","title":5.1,"text":"The student will construct sets of step-by-step instructions (algorithms) both independently and collaboratively,","grade":"Grade 5","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":["using sequencing;","using loops;","using variables to store and process data;","performing number calculations on variables (addition, subtraction, multiplication and division); and","using conditionals (if-statements)."]},{"id":"5.CS.AP.2","title":5.2,"text":"The student will construct programs to accomplish a task as a means of creative expression using a block or text based programming language, both independently and collaboratively","grade":"Grade 5","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":["using sequencing;","using loops;","using variables to store and process data;","performing number calculations on variables (addition, subtraction, multiplication and division); and","using conditionals (if-statements)."]},{"id":"5.CS.AP.3","title":5.3,"text":"The student will analyze, correct, and improve (debug) an algorithm that includes sequencing, events, loops, conditionals, and variables.","grade":"Grade 5","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.AP.4","title":5.4,"text":"The student will create a plan as part of the iterative design process, both independently and collaboratively using different strategies (e.g., pair programming, storyboard, flowchart, pseudocode, story map).","grade":"Grade 5","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.AP.5","title":5.5,"text":"The student will break down (decompose) a larger problem into smaller subproblems, both independently and collaboratively.","grade":"Grade 5","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.AP.6","title":5.6,"text":"The student will give credit to sources when borrowing or changing ideas (e.g., usinginformation, pictures created by others, using music created by others, remixingprogramming projects).","grade":"Grade 5","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.SYS.7","title":5.7,"text":"The student will model how a computing system works including input and output, processors, sensors, and storage.","grade":"Grade 5","strand":"Computing Systems","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.SYS.8","title":5.8,"text":"The student will identify, using accurate terminology, simple hardware and software problems that may occur during use and apply strategies for solving problems (e.g., rebooting the device, checking for power, checking network availability, closing and reopening an app.).","grade":"Grade 5","strand":"Computing Systems","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.CY.9","title":5.9,"text":"The student will evaluate and solve problems that relate to inappropriate use of computing devices and networks.","grade":"Grade 5","strand":"Cybersecurity","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.CY.10","title":5.1,"text":"The student will determine whether passwords are strong, explain why strong passwords should be used, and demonstrate proper use and protection of personal passwords.","grade":"Grade 5","strand":"Cybersecurity","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.DA.11","title":5.11,"text":"The student will use a computer to observe, analyze, and manipulate data in order to draw conclusions and make predictions.","grade":"Grade 5","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.DA.12","title":5.12,"text":"The student will create an artifact using computing systems to model the attributes and behaviors associated with a concept (e.g., plate tectonics).","grade":"Grade 5","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.DA.13","title":5.13,"text":"The student will use numeric values to represent non-numeric ideas in the computer (e.g., binary, ASCII, pixel attributes such as RGB).","grade":"Grade 5","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.IC.14","title":5.14,"text":"The student will give examples and explain how computer science has changed the world and express how computing technologies influence, and are influenced by, cultural practices.","grade":"Grade 5","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.IC.15","title":5.15,"text":"The student will evaluate and describe the positive and negative impacts of the pervasiveness of computers and computing in daily life (e.g., downloading videos and audio files, electronic appliances, wireless Internet, mobile computing devices, GPS systems, wearable computing).","grade":"Grade 5","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.IC.16","title":5.16,"text":"The student will explain social and ethical issues that relate to computing devices and networks.","grade":"Grade 5","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.CS.NI.17","title":5.17,"text":"The student will compare and contrast the difference between a local network and a worldwide network.","grade":"Grade 5","strand":"Networking & the Internet","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"5.MT.NS.1","title":5.1,"text":"The student, given a decimal through thousandths, will round to the nearest whole number, tenth, or hundredth","grade":"Grade 5","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"5.MT.NS.2","title":5.2,"text":"The student will","grade":"Grade 5","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["represent and identify equivalencies among fractions and decimals, with and without models; and","compare and order fractions, mixed numbers, and/or decimals in a given set, from least to greatest and greatest to least."]},{"id":"5.MT.NS.3","title":5.3,"text":"The student will","grade":"Grade 5","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["identify and describe the characteristics of prime and composite numbers; and","identify and describe the characteristics of even and odd numbers."]},{"id":"5.MT.CE.4","title":5.4,"text":"The student will create and solve single-step and multistep practical problems involving addition, subtraction, multiplication, and division of whole numbers.","grade":"Grade 5","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"5.MT.CE.5","title":5.5,"text":"The student will","grade":"Grade 5","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":["estimate and determine the product and quotient of two numbers involving decimals; and","create and solve single-step and multistep practical problems involving addition, subtraction, and multiplication of decimals, and create and solve single-step practical problems involving division of decimals."]},{"id":"5.MT.CE.6","title":5.6,"text":"The student will","grade":"Grade 5","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":["solve single-step and multistep practical problems involving addition and subtraction with fractions and mixed numbers; and","solve single-step practical problems involving multiplication of a whole number, limited to 12 or less, and a proper fraction, with models."]},{"id":"5.MT.CE.7","title":5.7,"text":"The student will simplify whole number numerical expressions using the order of operations.","grade":"Grade 5","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"5.MT.MG.8","title":5.8,"text":"The student will","grade":"Grade 5","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["solve practical problems that involve perimeter, area, and volume in standard units of measure; and","differentiate among perimeter, area, and volume and identify whether the application of the concept of perimeter, area, or volume is appropriate for a given situation."]},{"id":"5.MT.MG.9","title":5.9,"text":"The student will","grade":"Grade 5","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["given the equivalent measure of one unit, identify equivalent measurements within the metric system; and","solve practical problems involving length, mass, and liquid volume using metric units."]},{"id":"5.MT.MG.10","title":5.1,"text":"The student will identify and describe the diameter, radius, chord, and circumference of a circle.","grade":"Grade 5","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"5.MT.MG.11","title":5.11,"text":"The student will solve practical problems related to elapsed time in hours and minutes within a 24-hour period.","grade":"Grade 5","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"5.MT.MG.12","title":5.12,"text":"The student will classify and measure right, acute, obtuse, and straight angles.","grade":"Grade 5","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"5.MT.MG.13","title":5.13,"text":"The student will","grade":"Grade 5","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["classify triangles as right, acute, or obtuse and equilateral, scalene, or isosceles; and","investigate the sum of the interior angles in a triangle and determine an unknown angle measure."]},{"id":"5.MT.MG.14","title":5.14,"text":"The student will","grade":"Grade 5","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["recognize and apply transformations, such as translation, reflection, and rotation; and","investigate and describe the results of combining and subdividing polygons."]},{"id":"5.MT.PS.15","title":5.15,"text":"The student will determine the probability of an outcome by constructing a sample space or using the Fundamental (Basic) Counting Principle.","grade":"Grade 5","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"5.MT.PS.16","title":5.1,"text":"The student, given a practical problem, will","grade":"Grade 5","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["represent data in line plots and stem-and-leaf plots;","interpret data represented in line plots and stem-and-leaf plots; and","compare data represented in a line plot with the same data represented in a stem-andleaf plot."]},{"id":"5.MT.PS.17","title":5.17,"text":"The student, given a practical context, will","grade":"Grade 5","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["describe mean, median, and mode as measures of center;","describe mean as fair share;","describe the range of a set of data as a measure of spread; and","determine the mean, median, mode, and range of a set of data."]},{"id":"5.MT.PA.18","title":5.18,"text":"The student will identify, describe, create, express, and extend number patterns found in objects, pictures, numbers and tables.","grade":"Grade 5","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"5.MT.PA.19","title":5.19,"text":"The student will","grade":"Grade 5","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":["investigate and describe the concept of variable;","write an equation to represent a given mathematical relationship, using a variable","use an expression with a variable to represent a given verbal expression involving one operation; and","create a problem situation based on a given equation, using a single variable and one operation."]},{"id":"5.USI.SK.0","title":"Skills","text":"The student will apply history and social science skills to the content by","grade":"Grade 5","strand":"Skills","subject":"United States History to 1865","course":"United States History to 1865","subs":["synthesizing evidence from information sources including, but not limited to artifacts, primary and secondary sources, charts, graphs, and diagrams to understand events in United States history;","applying geographic skills to determine patterns and trends of people, places, or events;","developing questions, enhancing curiosity, and engaging in critical thinking and analysis;","integrating evidence to construct and analyze timelines, classify events, and distinguish fact from opinion;","comparing and contrasting historical, cultural, economic, and political perspectives;","determining and explaining cause-and-effect relationships;","using economic decision-making models to make a decision and explain the incentives and consequences of a specific choice;","engaging and communicating as a civil and informed individual with persons with different perspectives; and","developing products that reflect an understanding of content."]},{"id":"5.USI.GA.1","title":"USI.1","text":"The student will apply history and social science skills to understand the geography of North America by","grade":"Grade 5","strand":"Geography of North America","subject":"United States History to 1865","course":"United States History to 1865","subs":["locating North America in relation to the other continents and the oceans;","locating and describing major geographic regions and bodies of water of North America and their impact on the early history of the United States; and","locating the 50 states."]},{"id":"5.USI.EA.2","title":"USI.2","text":"The student will apply history and social science skills to describe how early cultures developed throughout North America by","grade":"Grade 5","strand":"Early Cultures of North America","subject":"United States History to 1865","course":"United States History to 1865","subs":["describing how archaeologists have recovered artifacts from ancient settlements, including, but not limited, to Cactus Hill in Virginia; and","locating and explaining where Indigenous peoples lived prior to the arrival of Europeans, with an emphasis on how the various geographic regions they inhabited influenced their daily lives."]},{"id":"5.USI.EA.3","title":"USI.3","text":"The student will apply history and social science skills to explain European exploration and colonization in North America by","grade":"Grade 5","strand":"Early Cultures of North America","subject":"United States History to 1865","course":"United States History to 1865","subs":["describing the motivations for, obstacles to, and accomplishments of the Dutch, English, French, Portuguese, and Spanish explorations; and","describing cultural and economic interactions between Indigenous peoples and Europeans that led to cooperation and conflict."]},{"id":"5.USI.EA.4","title":"USI.4","text":"The student will apply history and social science skills to understand how the Western Hemisphere, including the United States, impacted West Africa by","grade":"Grade 5","strand":"Early Cultures of North America","subject":"United States History to 1865","course":"United States History to 1865","subs":["identifying the location and characteristics of West African societies of Ghana, Mali, and Songhai before European exploration;","examining the arrival of the first Africans to colonial America at Old Point Comfort (Fort Monroe);","explaining the Transatlantic Slave Trade and its impact on the African coast and Western Hemisphere; and","identifying the cultural connections, conflicts, and common values of enslaved people in the Western Hemisphere, as well as challenges and hardships endured by enslaved people brought to the United States."]},{"id":"5.USI.CR.5","title":"USI.5","text":"The student will apply history and social science skills to explain the social, political, religious, economic, and geographic factors that shaped colonial America by","grade":"Grade 5","strand":"Colonial America and the American Revolution","subject":"United States History to 1865","course":"United States History to 1865","subs":["describing the characteristics and differences among the New England, the Mid-Atlantic, and the Southern colonies;","explaining Virginia’s importance as one of the most populous and wealthiest colonies;","comparing life from the perspectives of various groups, including, but not limited to large landowners, farmers, artisans, clergy, merchants, women, indentured servants, and enslaved and free Blacks;","explaining the specialization and interdependence of the regions; and","explaining the changing political and economic relationships between the colonies and Great Britain, including, but not limited to representative government and self-rule in the colonies."]},{"id":"5.USI.CR.6","title":"USI.6","text":"The student will apply history and social science skills to explain the American Revolution by","grade":"Grade 5","strand":"Colonial America and the American Revolution","subject":"United States History to 1865","course":"United States History to 1865","subs":["identifying the causes and effects of the French and Indian War;","identifying the issues of dissatisfaction that led to the American Revolution, including, but not limited to the “injuries and usurpations” outlined in the Declaration of Independence;","comparing and contrasting the political ideas and principles that shaped the revolutionary movement;","describing the leadership roles of individuals, including, but not limited to George Washington, Benjamin Franklin, Thomas Jefferson, Patrick Henry, Thomas Paine, John Adams, and the Marquis de Lafayette; and","examining the causes, course, and consequences of key events and battles of the era."]},{"id":"5.USI.NE.7","title":"USI.7","text":"The student will apply history and social science skills to describe the challenges faced by the new nation by","grade":"Grade 5","strand":"A New Nation and its Expansion","subject":"United States History to 1865","course":"United States History to 1865","subs":["explaining the strengths, weaknesses, and outcomes of the government established by the Articles of Confederation;","describing the Constitutional Convention and the development of the Constitution of the United States, with emphasis on the role of James Madison;","examining constitutional issues debated, including the role of the national government and the debate over ratifying of the Constitution, the influence of the Federalist Papers, and the reasons for the addition of the Bill of Rights;","explaining the Three-Fifths Compromise; and","examining the three branches of government."]},{"id":"5.USI.NE.8","title":"USI.8","text":"The student will apply history and social science skills to explain westward expansion and reform in America from 1801 to 1861 by","grade":"Grade 5","strand":"A New Nation and its Expansion","subject":"United States History to 1865","course":"United States History to 1865","subs":["describing how territorial expansion affected the political map of the United States, including, but not limited to the Louisiana Purchase, the Lewis and Clark expedition and the role of Sacagawea, the acquisitions of Florida, Texas, Oregon, and California, and the results of the Mexican American War;","describing the causes, course of events, and effects of the War of 1812, the role of Andrew Jackson, and the development of the Monroe Doctrine;","identifying geographic, economic, and religious motivations that influenced the movement of settlers;","analyzing the impact of westward expansion on Indigenous peoples, including, but not limited to the Indian Removal policies, the Trail of Tears, and the Seminole Wars;","explaining technological advancements and innovations and their effects on life in America, including but not limited to the cotton gin, the reaper, the steam engine, and the steam locomotive;","describing major developments in the abolitionist and women’s suffrage movements; and","explaining how the expansion of U.S. territory led to increased momentum for the abolitionist and women’s suffrage movements."]},{"id":"5.USI.CVW.9","title":"USI.9","text":"The student will apply history and social science skills to understand the cause, major events, and effects of the Civil War by","grade":"Grade 5","strand":"The Civil War","subject":"United States History to 1865","course":"United States History to 1865","subs":["describing how slavery and its expansion was the primary cause of the cultural, economic, and constitutional issues that divided the nation and led to the secession of southern states;","describing the differences in the economies of the North and the South, growth of agriculture and industry, and how those economies impacted the outcome of the war;","evaluating the leadership and impact of Abraham Lincoln during the Civil War;","describing how individuals influenced the course of the Civil War, including, but not limited to Jefferson Davis, Ulysses S. Grant, Robert E. Lee, William Tecumseh Sherman, Thomas “Stonewall” Jackson, and Frederick Douglass;","describing major political texts during the war, including but not limited to Lincoln’s Inaugural Address, the Emancipation Proclamation, the Gettysburg Address, and Lincoln’s Second Inaugural Address; and","analyzing the effects of the war from various perspectives of Union and Confederate soldiers, Indigenous peoples, women, European Americans, and enslaved and free Blacks during the war including, but not limited to Clara Barton, John Brown, Robert Smalls, Harriet Tubman, Elizabeth Van Lew, and Mary Bowser."]},{"id":"5.VA.CP.1","title":5.1,"text":"The student will apply creative thinking to artmaking.","grade":"Grade 5","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Express personal ideas, images, and themes through artistic choices of media, techniques, and subject matter.","Demonstrate resilience and resourcefulness in solving art challenges."]},{"id":"5.VA.CP.2","title":5.2,"text":"The student will apply a creative process for artmaking.","grade":"Grade 5","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Apply steps of the creative process, including brainstorming, researching, preliminary sketching, planning, reflecting, and refining, to synthesize ideas for and create works of art.","Use specific criteria to self-evaluate a finished product."]},{"id":"5.VA.CC.3","title":5.3,"text":"The student will analyze, interpret, and evaluate artwork using art vocabulary.","grade":"Grade 5","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Compare and contrast natural and constructed environments.","Analyze and interpret works of art based on visual properties and context.","Interpret an artist’s point of view based on contextual information.","Develop criteria to evaluate the work of self and others."]},{"id":"5.VA.CC.4","title":5.4,"text":"The student will select a preferred work of art and defend the selection.","grade":"Grade 5","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"5.VA.CC.5","title":5.5,"text":"The student will apply skills needed to work collaboratively in an art community.","grade":"Grade 5","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Effectively use listening skills.","Apply communication skills in class discussions and presentations.","Recognize a variety of strengths in others and oneself."]},{"id":"5.VA.HC.6","title":5.6,"text":"The student will explore and examine cultural and historical influences of art","grade":"Grade 5","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":["Describe how criteria used to assess the importance of art may vary over time.","Examine the influence of historic events on works of art","Describe similarities and differences among art and artists from a variety of diverse cultures and experiences.","Compare and contrast contemporary and historical works of art, including architecture."]},{"id":"5.VA.HC.7","title":5.7,"text":"The student will describe how artists contribute to society","grade":"Grade 5","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"5.VA.HC.8","title":5.8,"text":"The student will define intellectual property as it relates to art.","grade":"Grade 5","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"5.VA.IA.9","title":5.9,"text":"The student will describe various commercial art careers.","grade":"Grade 5","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"5.VA.IA.10","title":5.1,"text":"The student will investigate and explore approaches to time-based media such as video, traditional animation, digital animation, and game design.","grade":"Grade 5","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"5.VA.IA.11","title":5.11,"text":"The student will explore authentic opportunities for how artmaking skills are used for problem-solving.","grade":"Grade 5","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"5.VA.TA.12","title":5.12,"text":"The student will use the following to express meaning in works of art:","grade":"Grade 5","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Color—student-mixed hues, tints, shades, tones.","Form—convex, concave, positive, negative.","Texture—surface embellishment.","Value—gradation to create the illusion of depth on a two-dimensional surface.","Balance—formal, informal.","Pattern—repetition to create rhythm."]},{"id":"5.VA.TA.13","title":5.13,"text":"The student will apply and emphasize spatial relationships and perspective techniques in the composition of works of art.","grade":"Grade 5","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Use atmospheric perspective in works of art.","Use size and proportion to emphasize spatial relationships in works of art."]},{"id":"5.VA.TA.14","title":5.14,"text":"The student will draw the human figure in proportion from observation.","grade":"Grade 5","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"5.VA.TA.15","title":5.15,"text":"The student will execute and complete works of art with attention to detail and skill in the use of art materials.","grade":"Grade 5","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"5.VA.TA.16","title":5.16,"text":"The student will use a variety of media, materials, techniques, and processes to create artwork.","grade":"Grade 5","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Create sculpture in the round, high relief, or bas-relief, using three-dimensional media, including clay","Combine various craft techniques in works of art."]},{"id":"5.VA.TA.17","title":5.17,"text":"The student will create works of art inspired by a variety of sources, subjects, and other fields of knowledge.","grade":"Grade 5","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]}]