[{"id":"5.SC.FM.2","title":5.2,"text":"The student will investigate and understand that energy can take many forms. Key ideas include","strand":"Force, Motion, & Energy","subject":"Science","course":"Science","subs":["energy is the ability to do work or to cause change;","there are many different forms of energy;","energy can be transformed; and","energy is conserved."]},{"id":"5.SC.FM.3","title":5.3,"text":"The student will investigate and understand that there is a relationship between force and energy of moving objects. Key ideas include","strand":"Force, Motion, & Energy","subject":"Science","course":"Science","subs":["moving objects have kinetic energy;","motion is described by an object’s direction and speed;","changes in motion are related to net force and mass;","when objects collide, the contact forces transfer energy and can change objects’ motion; and","friction is a force that opposes motion."]},{"id":"5.SC.FM.4","title":5.4,"text":"The student will investigate and understand that electricity is transmitted and used in daily life. Key ideas include","strand":"Force, Motion, & Energy","subject":"Science","course":"Science","subs":["electricity flows easily through conductors but not insulators;","electricity flows through closed circuits;","static electricity can be generated by rubbing certain materials together;","electrical energy can be transformed into radiant, mechanical, and thermal energy; and","a current flowing through a wire creates a magnetic field."]},{"id":"5.SC.FM.5","title":5.5,"text":"The student will investigate and understand that sound can be produced and transmitted. Key ideas include","strand":"Force, Motion, & Energy","subject":"Science","course":"Science","subs":["sound is produced when an object or substance vibrates;","sound is the transfer of energy;","different media transmit sound differently; and","sound waves have many uses and applications."]},{"id":"5.SC.FM.6","title":5.6,"text":"The student will investigate and understand that visible light has certain characteristics and behaves in predictable ways. Key ideas include","strand":"Force, Motion, & Energy","subject":"Science","course":"Science","subs":["visible light is radiant energy that moves in transverse waves;","the visible spectrum includes light with different wavelengths;","matter influences the path of light; and","radiant energy can be transformed into thermal, mechanical, and electrical energy."]}]