[{"id":"5.USI.EA.2","title":"USI.2","text":"The student will apply history and social science skills to describe how early cultures developed throughout North America by","strand":"Early Cultures of North America","subject":"United States History to 1865","course":"United States History to 1865","subs":["describing how archaeologists have recovered artifacts from ancient settlements, including, but not limited, to Cactus Hill in Virginia; and","locating and explaining where Indigenous peoples lived prior to the arrival of Europeans, with an emphasis on how the various geographic regions they inhabited influenced their daily lives."]},{"id":"5.USI.EA.3","title":"USI.3","text":"The student will apply history and social science skills to explain European exploration and colonization in North America by","strand":"Early Cultures of North America","subject":"United States History to 1865","course":"United States History to 1865","subs":["describing the motivations for, obstacles to, and accomplishments of the Dutch, English, French, Portuguese, and Spanish explorations; and","describing cultural and economic interactions between Indigenous peoples and Europeans that led to cooperation and conflict."]},{"id":"5.USI.EA.4","title":"USI.4","text":"The student will apply history and social science skills to understand how the Western Hemisphere, including the United States, impacted West Africa by","strand":"Early Cultures of North America","subject":"United States History to 1865","course":"United States History to 1865","subs":["identifying the location and characteristics of West African societies of Ghana, Mali, and Songhai before European exploration;","examining the arrival of the first Africans to colonial America at Old Point Comfort (Fort Monroe);","explaining the Transatlantic Slave Trade and its impact on the African coast and Western Hemisphere; and","identifying the cultural connections, conflicts, and common values of enslaved people in the Western Hemisphere, as well as challenges and hardships endured by enslaved people brought to the United States."]}]