[{"id":"6.CS24.DA.1","title":"6.DA.1","text":"The student will utilize computational tools to collect and organize data.","grade":"Grade 6","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Select and use appropriate computational tools to collect data.","Organize data to make it easier to understand and use.","Clean data to remove and correct errors.","Analyze data sources for accuracy and reliability."]},{"id":"6.CS24.DA.2","title":"6.DA.2","text":"The student will utilize computational tools to visualize and evaluate data.","grade":"Grade 6","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify different types of visual representations of data.","Compare various visual representations and identify when each should be used.","Create charts, graphs, models, and simulations to visualize data.","Describe and synthesize information from a visual representation of data."]},{"id":"6.CS24.DA.3","title":"6.DA.3","text":"The student will make predictions and draw conclusions from data visualizations.","grade":"Grade 6","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Visualize data using appropriate graphs, charts, and data visualization techniques to enhance understanding and communicate findings effectively.","Use computational tools to analyze patterns within data sets and identify trends.","Draw conclusions and make predictions based on the analysis and interpretation of the data visualization.","Utilize simulations and models to formulate, refine, and test hypotheses."]},{"id":"6.CS24.DA.4","title":"6.DA.4","text":"The student will identify ways people curate and provide training data.","grade":"Grade 6","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify and list ways people provide data that is used as training data.","Discuss the role of human intervention in curating training data.","Identify and describe the effect training data has on the accuracy of artificial intelligence systems."]}]