[{"id":"6.CS24.AP.1","title":"6.AP.1","text":"The student will apply computational thinking to identify patterns, make use of decomposition to break down problems or processes into sub-components, and design algorithms.","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify patterns and repeated steps in an algorithm, problem, or process.","Decompose an algorithm, problem, or process into sub-components.","Abstract relevant information to identify essential details.","Design algorithms using abstraction to accomplish a task or express a computational process."]},{"id":"6.CS24.AP.2","title":"6.AP.2","text":"The student will plan and implement algorithms that include conditional control structures and collection of numeric data using a block-based or textbased tool.","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create a decision tree diagram to illustrate the decision-making process.","Read and write programs that initialize Boolean, integer, and decimal number variables.","Read and write programs that collect numeric data from users.","Read and write programs that contain nested conditional control structures.","Predict the results of logic expressions that use Boolean operators: and, or, and not; including expressions that use relational expressions as one or more operands."]},{"id":"6.CS24.AP.3","title":"6.AP.3","text":"The student will use the iterative design process to create, test, and debug programs using a block-based or text-based programming language.","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create and test programs that uses multiple conditional control structures.","Incorporate existing code, media, or libraries into original programs.","Trace and predict outcomes of programs.","Analyze and describe program results to assess validity of outcomes.","Analyze the outcomes of programs to identify logic and syntax errors.","Incorporate feedback from others to refine program.","Revise and improve programs to resolve errors and produce desired outcomes."]},{"id":"6.CS24.AP.4","title":"6.AP.4","text":"The student will demonstrate proper attribution when incorporating ideas and works of others.","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify and give proper attribution of information and assets from the Internet and other sources."]}]