[{"id":"6.CS.AP.1","title":6.1,"text":"The student will construct programs to accomplish a task as a means of creative expression or scientific exploration using a block based or text based programming language, both independently and collaboratively,","grade":"Grade 6","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":["combining control structures such as if-statements and loops; and","creating clearly named variables that represent different data types, including numeric and non-numeric data, and perform operations on their values."]},{"id":"6.CS.AP.2","title":6.2,"text":"The student will trace programs to predict outcomes and debug (correct and improve) for correctness.","grade":"Grade 6","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.AP.3","title":6.3,"text":"The student will seek and incorporate feedback from team members and users to refine a program that meets user needs.","grade":"Grade 6","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.AP.4","title":6.4,"text":"The student will incorporate existing code, media, and libraries into original programs, and give attribution.","grade":"Grade 6","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.SYS.5","title":6.5,"text":"The student will design projects that combine hardware and software components to collect and exchange data.","grade":"Grade 6","strand":"Computing Systems","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.CY.6","title":6.6,"text":"The student will identify physical and digital security measures used to protect electronic information.","grade":"Grade 6","strand":"Cybersecurity","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.DA.7","title":6.7,"text":"The student will explain how binary sequences are used to represent digital data. Exclusion: Conversions between binary and base-ten numbers are beyond the scope of these standards.","grade":"Grade 6","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.DA.8","title":6.8,"text":"The student will collect data using computational tools then clean and organize to make it more useful and reliable.","grade":"Grade 6","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.DA.9","title":6.9,"text":"The student will explain the insight and knowledge gained from digitally processed data by using appropriate visualizations.","grade":"Grade 6","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.DA.10","title":6.1,"text":"The student will use models and simulations to formulate, refine, and test hypotheses.","grade":"Grade 6","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.IC.11","title":6.11,"text":"The student will explain how computing has impacted innovations in other fields.","grade":"Grade 6","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.IC.12","title":6.12,"text":"The student will explore careers related to data","grade":"Grade 6","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.CS.NI.13","title":6.13,"text":"The student will explain why the speed of data transmission across the Internet can vary depending on the type of data being transmitted.","grade":"Grade 6","strand":"Networking & the Internet","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"6.EN.COM.1","title":6.1,"text":"The student will participate in and contribute to small-group activities.","grade":"Grade 6","strand":"Communication","subject":"English","course":"English","subs":["Communicate as leader and contributor.","Evaluate own contributions to discussions.","Summarize and evaluate group activities.","Analyze the effectiveness of participant interactions."]},{"id":"6.EN.COM.2","title":6.2,"text":"The student will present, listen critically, and express opinions in oral presentations.","grade":"Grade 6","strand":"Communication","subject":"English","course":"English","subs":["Distinguish between fact and opinion.","Compare and contrast viewpoints.","Present a convincing argument.","Paraphrase and summarize what is heard.","Use language and vocabulary appropriate to audience, topic, and purpose."]},{"id":"6.EN.COM.3","title":6.3,"text":"The student will understand the elements of media literacy.","grade":"Grade 6","strand":"Communication","subject":"English","course":"English","subs":["Compare and contrast auditory, visual, and written media messages.","Identify the characteristics and effectiveness of a variety of media messages.","Craft and publish audience-specific media messages."]},{"id":"6.EN.RD.4","title":6.4,"text":"The student will read and learn the meanings of unfamiliar words and phrases within authentic texts.","grade":"Grade 6","strand":"Reading","subject":"English","course":"English","subs":["Identify word origins and derivations.","Use roots, cognates, affixes, synonyms, and antonyms to expand vocabulary.","Use context and sentence structure to determine meanings and differentiate among multiple meanings of words.","Identify and analyze figurative language.","Use word-reference materials.","Extend general and specialized vocabulary through speaking, listening, reading, and writing."]},{"id":"6.EN.RD.5","title":6.5,"text":"The student will read and demonstrate comprehension of a variety of fictional texts, narrative nonfiction, and poetry.","grade":"Grade 6","strand":"Reading","subject":"English","course":"English","subs":["Identify the elements of narrative structure, including setting, character, plot, conflict, and theme.","Make, confirm, and revise predictions.","Describe how word choice and imagery contribute to the meaning of a text.","Describe cause and effect relationships and their impact on plot.","Use prior and background knowledge as context for new learning.","Use information in the text to draw conclusions and make inferences.","Explain how character and plot development are used in a selection to support a central conflict or story line.","Identify the main idea.","Identify and summarize supporting details.","Identify and analyze the author’s use of figurative language.","Identify transitional words and phrases that signal an author’s organizational pattern.","Use reading strategies to monitor comprehension throughout the reading process."]},{"id":"6.EN.RD.6","title":6.6,"text":"The student will read and demonstrate comprehension of a variety of nonfiction texts.","grade":"Grade 6","strand":"Reading","subject":"English","course":"English","subs":["Use text structures such as type, headings, and graphics to predict and categorize information in both print and digital texts.","Use prior knowledge and build additional background knowledge as context for new learning.","Identify questions to be answered.","Make, confirm, or revise predictions.","Draw conclusions and make inferences based on explicit and implied information.","Differentiate between fact and opinion.","Identify main idea.","Summarize supporting details.","Compare and contrast information about one topic, which may be contained in different selections.","Identify the author’s organizational pattern.","Identify cause and effect relationships.","Use reading strategies to monitor comprehension throughout the reading process."]},{"id":"6.EN.WR.7","title":6.7,"text":"The student will write narration, description, exposition, and persuasion.","grade":"Grade 6","strand":"Writing","subject":"English","course":"English","subs":["Identify audience and purpose.","Use a variety of prewriting strategies including graphic organizers to generate and organize ideas.","Organize writing structure to fit mode or topic.","Establish a central idea and organization.","Compose a topic sentence or thesis statement if appropriate.","Write multiparagraph compositions with elaboration and unity.","Select vocabulary and information to enhance the central idea, tone, and voice.","Expand and embed ideas by using modifiers, standard coordination, and subordination in complete sentences.","Revise sentences for clarity of content including specific vocabulary and information.","Use computer technology to plan, draft, revise, edit, and publish writing."]},{"id":"6.EN.WR.8","title":6.8,"text":"The student will edit writing for correct grammar, capitalization, punctuation, spelling, sentence structure, and paragraphing.","grade":"Grade 6","strand":"Writing","subject":"English","course":"English","subs":["Use a variety of graphic organizers, including sentence diagrams, to analyze and improve sentence formation and paragraph structure.","Use subject-verb agreement with intervening phrases and clauses.","Use pronoun-antecedent agreement to include indefinite pronouns.","Maintain consistent verb tense across paragraphs.","Eliminate double negatives.","Use quotation marks with dialogue.","Choose adverbs to describe verbs, adjectives, and other adverbs.","Use correct spelling for frequently used words."]},{"id":"6.EN.RE.9","title":6.9,"text":"The student will find, evaluate, and select appropriate resources for a research product.","grade":"Grade 6","strand":"Research","subject":"English","course":"English","subs":["Collect information from multiple sources including online, print, and media.","Evaluate the validity and authenticity of texts.","Use technology as a tool to research, organize, evaluate, and communicate information.","Cite primary and secondary sources.","Define the meaning and consequences of plagiarism and follow ethical and legal guidelines for gathering and using information."]},{"id":"6.MT.NS.1","title":6.1,"text":"The student will represent relationships between quantities using ratios, and will use appropriate notations, such as a/b, a to b, and a:b.","grade":"Grade 6","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"6.MT.NS.2","title":6.2,"text":"The student will","grade":"Grade 6","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["represent and determine equivalencies among fractions, mixed numbers, decimals, and percents; and","compare and order positive rational numbers."]},{"id":"6.MT.NS.3","title":6.3,"text":"The student will","grade":"Grade 6","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["identify and represent integers;","compare and order integers; and","identify and describe absolute value of integers"]},{"id":"6.MT.NS.4","title":6.4,"text":"The student will recognize and represent patterns with whole number exponents and perfect squares.","grade":"Grade 6","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"6.MT.CE.5","title":6.5,"text":"The student will","grade":"Grade 6","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":["multiply and divide fractions and mixed numbers;","solve single-step and multistep practical problems involving addition, subtraction, multiplication, and division of fractions and mixed numbers; and","solve multistep practical problems involving addition, subtraction, multiplication, and division of decimals."]},{"id":"6.MT.CE.6","title":6.6,"text":"The student will","grade":"Grade 6","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":["add, subtract, multiply, and divide integers;","solve practical problems involving operations with integers; and","simplify numerical expressions involving integers"]},{"id":"6.MT.MG.7","title":6.7,"text":"The student will","grade":"Grade 6","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["derive π (pi);","solve problems, including practical problems, involving circumference and area of a circle; and","solve problems, including practical problems, involving area and perimeter of triangles and rectangles."]},{"id":"6.MT.MG.8","title":6.8,"text":"The student will","grade":"Grade 6","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["identify the components of the coordinate plane; and","identify the coordinates of a point and graph ordered pairs in a coordinate plane."]},{"id":"6.MT.MG.9","title":6.9,"text":"The student will determine congruence of segments, angles, and polygons.","grade":"Grade 6","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"6.MT.PS.10","title":6.1,"text":"The student, given a practical situation, will","grade":"Grade 6","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["represent data in a circle graph;","make observations and inferences about data represented in a circle graph; and","compare circle graphs with the same data represented in bar graphs, pictographs, and line plots."]},{"id":"6.MT.PS.11","title":6.11,"text":"The student will","grade":"Grade 6","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["represent the mean of a data set graphically as the balance point; and","determine the effect on measures of center when a single value of a data set is added, removed, or changed."]},{"id":"6.MT.PA.12","title":6.12,"text":"The student will","grade":"Grade 6","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":["represent a proportional relationship between two quantities, including those arising from practical situations;","determine the unit rate of a proportional relationship and use it to find a missing value in a ratio table;","determine whether a proportional relationship exists between two quantities; and","make connections between and among representations of a proportional relationship between two quantities using verbal descriptions, ratio tables, and graphs."]},{"id":"6.MT.PA.13","title":6.13,"text":"The student will solve one-step linear equations in one variable, including practical problems that require the solution of a one-step linear equation in one variable.","grade":"Grade 6","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"6.MT.PA.14","title":6.14,"text":"The student will","grade":"Grade 6","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":["represent a practical situation with a linear inequality in one variable; and","solve one-step linear inequalities in one variable, involving addition or subtraction, and graph the solution on a number line."]},{"id":"6.SC.SC.1","title":6.1,"text":"The student will demonstrate an understanding of scientific and engineering practices by","grade":"Grade 6","subject":"Science","course":"Science","subs":["asking questions and defining problems (ask questions to determine relationships between independent and dependent variables, develop hypotheses and identify independent and dependent variables, offer simple solutions to design problems)","planning and carrying out investigations (independently and collaboratively plan and conduct observational and experimental investigations; identify variables, constants, and controls where appropriate, and include the safe use of chemicals and equipment, evaluate the accuracy of various methods for collecting data, take metric measurements using appropriate tools, use tools and materials to design and/or build a device to solve a specific problem)","interpreting, analyzing, and evaluating data (organize data sets to reveal patterns that suggest relationships, construct, analyze, and interpret graphical displays of data, compare and contrast data collected by different groups and discuss similarities and differences in findings, use data to evaluate and refine design solutions)","constructing and critiquing conclusions and explanations (construct explanations that includes qualitative or quantitative relationships between variables, construct scientific explanations based on valid and reliable evidence obtained from sources (including the students’ own investigations), generate and compare multiple solutions to problems based on how well they meet the criteria and constraints)","developing and using models (use scale models to represent and estimate distance,  use, develop, and revise models to predict and explain phenomena, evaluate limitations of models)","obtaining, evaluating, and communicating information (read scientific texts, including those adapted for classroom use, to obtain scientific and/or technical information, gather, read, and synthesize information from multiple appropriate sources and assess the credibility, accuracy, and possible bias of each publication, construct, use, and/or present an argument supported by empirical evidence and scientific reasoning)"]},{"id":"6.SC.SC.2","title":6.2,"text":"The student will investigate and understand that the solar system is organized and the various bodies in the solar system interact. Key ideas include","grade":"Grade 6","subject":"Science","course":"Science","subs":["matter is distributed throughout the solar system;","planets have different sizes and orbit at different distances from the sun;","gravity contributes to orbital motion; and","the understanding of the solar system has developed over time."]},{"id":"6.SC.SC.3","title":6.3,"text":"The student will investigate and understand that there is a relationship between the sun, Earth, and the moon. Key ideas include","grade":"Grade 6","subject":"Science","course":"Science","subs":["Earth has unique properties;","the rotation of Earth in relationship to the sun causes day and night;","the movement of Earth and the moon in relationship to the sun causes phases of the moon;","Earth’s tilt as it revolves around the sun causes the seasons; and","the relationship between Earth and the moon is the primary cause of tides."]},{"id":"6.SC.SC.4","title":6.4,"text":"The student will investigate and understand that there are basic sources of energy and that energy can be transformed. Key ideas include","grade":"Grade 6","subject":"Science","course":"Science","subs":["the sun is important in the formation of most energy sources on Earth;","Earth’s energy budget relates to living systems and Earth’s processes;","radiation, conduction, and convection distribute energy; and","energy transformations are important in energy usage."]},{"id":"6.SC.SC.5","title":6.5,"text":"The student will investigate and understand that all matter is composed of atoms. Key ideas include","grade":"Grade 6","subject":"Science","course":"Science","subs":["atoms consist of particles, including electrons, protons, and neutrons;","atoms of a particular element are similar but differ from atoms of other elements;","elements may be represented by chemical symbols;","two or more atoms interact to form new substances, which are held together by electrical forces (bonds);","compounds may be represented by chemical formulas;","chemical equations can be used to model chemical changes; and","a few elements comprise the largest portion of the solid Earth, living matter, the oceans, and the atmosphere."]},{"id":"6.SC.SC.6","title":6.6,"text":"The student will investigate and understand that water has unique physical properties and has a role in the natural and human-made environment. Key ideas include","grade":"Grade 6","subject":"Science","course":"Science","subs":["water is referred to as the universal solvent;","water has specific properties;","thermal energy has a role in phase changes;","water has a role in weathering;","large bodies of water moderate climate; and","water is important for agriculture, power generation, and public health."]},{"id":"6.SC.SC.7","title":6.7,"text":"The student will investigate and understand that air has properties and that Earth’s atmosphere has structure and is dynamic. Key ideas include","grade":"Grade 6","subject":"Science","course":"Science","subs":["air is a mixture of gaseous elements and compounds;","the atmosphere has physical characteristics;","properties of the atmosphere change with altitude;","there is a relationship between air movement, thermal energy, and weather conditions;","atmospheric measures are used to predict weather conditions; and","weather maps give basic information about fronts, systems, and weather measurements."]},{"id":"6.SC.SC.8","title":6.8,"text":"The student will investigate and understand that land and water have roles in watershed systems. Key ideas include","grade":"Grade 6","subject":"Science","course":"Science","subs":["a watershed is composed of the land that drains into a body of water;","Virginia is composed of multiple watershed systems which have specific features;","the Chesapeake Bay is an estuary that has many important functions; and","natural processes, human activities, and biotic and abiotic factors influence the health of a watershed system."]},{"id":"6.SC.SC.9","title":6.9,"text":"The student will investigate and understand that humans impact the environment and individuals can influence public policy decisions related to energy and the environment. Key ideas include","grade":"Grade 6","subject":"Science","course":"Science","subs":["natural resources are important to protect and maintain;","renewable and nonrenewable resources can be managed;","major health and safety issues are associated with air and water quality;","major health and safety issues are related to different forms of energy;","preventive measures can protect land-use and reduce environmental hazards; and","there are cost/benefit tradeoffs in conservation policies."]},{"id":"6.SEL.SEA.1","title":"SeA1:5-6","text":"Recognize and understand the interaction between one’s own thoughts and emotions. (Critical Thinking)","grade":"Grade 6","strand":"Self-Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning"},{"id":"6.SEL.SEA.2","title":"SeA2:5-6","text":"Develop a positive identity and recognize personal strengths, interests, values, and challenges. (Creative Thinking)","grade":"Grade 6","strand":"Self-Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can analyze how my personal strengths give me confidence in multiple settings.","I can identify actions I can take to overcome personal challenges.","I can understand the relationship between my values and interests.","I can develop an awareness of and comfort with my membership in multiple groups in society."]},{"id":"6.SEL.SEM.1","title":"SeM1:5-6","text":"Develop and demonstrate strategies for managing and expressing one's own emotions to persevere in challenging situations. (Communication)","grade":"Grade 6","strand":"Self-Management","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can identify the difference between healthy and unhealthy stress levels.","I can proactively plan and apply a coping skill for handling a stressful situation that typically causes me to experience uncomfortable emotions.","I can identify and utilize strategies for persevering through challenges and setbacks."]},{"id":"6.SEL.SEM.2","title":"SeM2:5-6","text":"Demonstrate the skills related to achieving personal and academic goals. (Creative Thinking)  SOCIAL AWARENESS","grade":"Grade 6","strand":"Self-Management","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can identify the importance of setting academic goals for personal growth.","I can plan, implement, and monitor progress towards reaching my goals.","I can manage my time to help me achieve my goals."]},{"id":"6.SEL.SOA.1","title":"SoA1:5-6","text":"Demonstrate the ability to empathize with and show gratitude for others, including those with different and diverse perspectives, abilities, backgrounds, and cultures. (Collaboration)","grade":"Grade 6","strand":"Social Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can empathize with others’ thoughts, perspectives, and emotions.","I can gain a broader understanding by asking questions and listening to those with different perspectives, backgrounds, and cultures.","I can express gratitude for others, including those with different perspectives."]},{"id":"6.SEL.SOA.2","title":"SoA2:5-6","text":"Demonstrate the ability to understand broader historical and social contexts’ impact on humanity. (Citizenship) RELATIONSHIP SKILLS","grade":"Grade 6","strand":"Social Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can identify when people are treated unfairly.","I can explain how stereotypes can create bias."]},{"id":"6.SEL.RES.1","title":"ReS1:5-6","text":"Apply verbal and non-verbal communication and listening skills to interact with others, form and maintain positive relationships, and resolve conflict constructively. (Communication)","grade":"Grade 6","strand":"Relationship Skills","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can explain and demonstrate how positive communication skills help build and maintain healthy relationships. (Incorporate social media)","I can use active listening to successfully understand multiple perspectives.","I can outline and practice the use of conflict resolution skills with adult support.","I can demonstrate how I will navigate situations when I might feel pressured to go along with injustice."]},{"id":"6.SEL.RES.2","title":"ReS2:5-6","text":"Demonstrate the ability to effectively collaborate and navigate relationships while valuing different and diverse perspectives, abilities, backgrounds, and cultures. (Collaboration)","grade":"Grade 6","strand":"Relationship Skills","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can independently perform different roles in a group setting.","I can self-assess my relationship building skills.","I can recognize how positive and negative peer pressure affect me.","I can demonstrate how to give and receive feedback in a constructive way."]},{"id":"6.SEL.DEM.1","title":"DeM1:5-6","text":"Demonstrate the ability to evaluate, through reflection, the benefits and consequences of various actions within the decision-making process. (Critical Thinking)","grade":"Grade 6","strand":"Decision Making","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can determine what is within my control, what is outside of my control and what is within my influence when facing a problem.","I can show curiosity about a social problem by asking questions and gathering evidence to identify potential solutions.","I can identify the multiple outcomes that can result from my choices."]},{"id":"6.SEL.DEM.2","title":"DeM2:5-6","text":"Demonstrate the ability to make ethical decisions as a global citizen and evaluate outcomes based on one's own identity and the impact on humanity. (Citizenship)","grade":"Grade 6","strand":"Decision Making","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can identify the multiple outcomes that can result from my choices.","I can explain how the perspectives of others should be considered when making decisions."]},{"id":"6.USII.SK.0","title":"Skills","text":"The student will apply history and social science skills to the content by","grade":"Grade 6","strand":"Skills","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["synthesizing evidence from information sources, including, but not limited to artifacts, primary and secondary sources, charts, graphs, and diagrams to understand events in United States history;","applying geographic skills to determine and predict patterns and trends of people, places, and events;","developing questions, enhancing curiosity, and engaging in critical thinking and analysis;","integrating evidence to construct and analyze timelines, classify events, and distinguish fact from opinion;","comparing and contrasting people, places, events, and historical and political perspectives;","determining and explaining cause-and-effect relationships;","using an economic decision-making model to analyze the costs and benefits and explain the incentives and consequences of a specific choice made in U.S. history;","engaging and communicating as a civil and informed individual with persons with different perspectives; and","developing products that reflect an understanding of content."]},{"id":"6.USII.WP.1","title":"USII.1","text":"The student will apply history and social science skills to examine westward expansion after the mid-19th century by","grade":"Grade 6","strand":"Westward Expansion and Its Impact on Indigenous Peoples","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["explaining how technology allowed settlers to adapt to the physical features and climate of the West;","identifying the motivations for westward expansion;","examining the impact of policies, legislation, and treaties associated with the growth of the nation; and","explaining the effect that the growth of the United States had on Indigenous peoples."]},{"id":"6.USII.ER.2","title":"USII.2","text":"The student will apply history and social science skills to understand the ongoing effects of Reconstruction on American life after the mid-19th century by","grade":"Grade 6","strand":"Effects of Reconstruction","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["describing the impact of the assassination of Abraham Lincoln and the political aftermath of the Civil War;","analyzing the goals and effects of the Reconstruction Amendments, the Freedmen’s Bureau, and civil rights policies that changed the meaning of citizenship in the United States;","describing the legacies of Abraham Lincoln and the Gettysburg Address, Ulysses S. Grant, Robert E. Lee, Hiram Revels, and Frederick Douglass;","describing the role of Congress and the Supreme Court in Reconstruction plans and policies, including, but not limited to Lincoln’s Ten Percent Plan;","describing the role and motivations of individuals who sought to gain from Reconstruction, including, but not limited to formerly enslaved people elected to office during the years right after the Civil War; and","explaining how the 1876 presidential election led to the end of Reconstruction."]},{"id":"6.USII.IG.3","title":"USII.3","text":"The student will apply history and social science skills to understand how industrialization changed life in rural and urban America after the Civil War by","grade":"Grade 6","strand":"Industrialization and Growth","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["explaining relationships among natural resources, transportation, and industrial development from 1865;","explaining the impact of new inventions, the rise of big business, the growth of industry, and the changes to life on American farms in response to industrialization;","evaluating and explaining the impact of the Progressive Movement on child labor, working conditions, the rise of organized labor, support for eugenics as a social policy, immigration policy, women’s suffrage, and the temperance movement;","explaining the events, factors, and motivations that caused individuals and groups to migrate to the United States towards the end of the 19th century;","examining the cause-and-effect relationship between rapid population growth and city government services and infrastructure;","explaining how governmental actions, including, but not limited to the Chinese Exclusion Act of 1882, caused harm to Chinese Americans and other immigrants;","explaining how various groups worked to alleviate the issues facing new immigrants and how immigrants advocated for themselves; and","describing the technological advances and the broader impact of the 1893 Chicago World's Fair on America’s rise as a world leader in innovation, business, and trade."]},{"id":"6.USII.IG.4","title":"USII.4","text":"The student will apply history and social science skills to explain the changing role of the United States from the late 19th century through World War I by","grade":"Grade 6","strand":"Industrialization and Growth","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["explaining the legacy of Theodore Roosevelt, including, but not limited to conservation contributions, progressivism, the building of the Panama Canal, and his role in the Spanish-American War;","explaining the reasons for and results of the Spanish-American War, including the Roosevelt Corollary to the Monroe Doctrine;","analyzing the major causes and consequences of World War I and examining the roles of key leaders and groups;","examining the evolution of warfare tactics and technology, including, but not limited to  cavalry, air, submarine, chemical, trench warfare, and other technological advancements;","explaining how the war was a catalyst for the United States gaining international power and expanded its sphere of international influence; and","examining how post-war sanctions and the failure of the League of Nations set the stage for World War II."]},{"id":"6.USII.IG.5","title":"USII.5","text":"The student will apply history and social science skills to understand the social, political, economic, and technological changes of the early 20th century by","grade":"Grade 6","strand":"Industrialization and Growth","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["explaining how capitalism and free markets helped foster developments in factory and labor productivity, transportation, and communication and how rural electrification changed American life and the standard of living;","examining how the rise of communism affected America, including, but not limited to the first Red Scare;","describing the reasons for and impact of the Great Migration;","describing the events and leaders that lead to prohibition, the Women’s Suffrage Movement, and the passage of the Nineteenth Amendment, including, but not limited to Susan B. Anthony, Lucy Burns, Elizabeth Cady Stanton, Carrie Chapman Catt, Ida B. Wells-Barnett, and Sojourner Truth;","examining the art, literature, and music of the 1920s and 1930s, including, but not limited to the Roaring Twenties and the Harlem Renaissance;","analyzing the causes of the Great Depression and the impact of the Dust Bowl on the lives of Americans;","describing the features, effects, programs, and lasting institutions of Franklin D. Roosevelt’s New Deal;","describing racial segregation, housing discrimination via redlining, the rise of “Jim Crow” laws, Black Codes, and threats of violence, including, but not limited to intimidation, lynchings, armed conflicts, suppressed voting rights, and limits on political participation  faced by African Americans and other people during post-Reconstruction; and","analyzing events and impacts of African American leaders in response to “Jim Crow,” including, but not limited to the formation of the NAACP, strikes, protests, the role of HBCUs, and the work of leaders like Booker T. Washington, W.E.B. DuBois, Mary White Ovington, Ida B. Wells-Barnett."]},{"id":"6.USII.ST.6","title":"USII.6","text":"The student will apply history and social science skills to understand the major causes and events of World War II and the effects of America’s role by","grade":"Grade 6","strand":"The Second World War and America's Transformation","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["explaining the rise and spread of fascism and totalitarianism internationally and the policy of appeasement towards Nazi Germany;","explaining the causes and events that led to American involvement in the war, including the attack on Pearl Harbor;","locating and describing the major events and turning points of the war in Europe, including, but not limited to the allied invasion of Italy, the invasion of Normandy (D-Day), the Battle of the Bulge, and the Battle of Berlin;","locating and describing the major events and turning points of the war in the Pacific, including, but not limited to the Battle of Iwo Jima, the Battle of Midway, and the Battle of Okinawa;","explaining and evaluating the role of key political and military leaders of the Allies and Axis powers, including, but not limited to the United States, Germany, Japan, the Soviet Union, Italy, and Great Britain;","identifying the roles and sacrifices of American armed forces, including prisoners of war, women, and segregated units, as well as other notable heroics, including, but not limited to the contributions of the Tuskegee Airmen, the 442nd Regimental Combat Team, Women's Army Auxiliary Corps, the Women Airforce Service Pilots, the Navajo Code Talkers, and the Bedford boys;","evaluating the effects of the war on the home front, including, but not limited to women in the workforce, the incarceration of Japanese Americans, rationing, conservation, and war bonds;","examining the causes and consequences of the Holocaust, including, but not limited to Jewish life before the Holocaust, antisemitism, the rise of the Nazi Party, Nuremberg Laws, persecution of Jews and other targeted groups, resistance efforts, the United States’ response, and the Nuremberg Trials; and","describing the events that led to the surrender of the Axis Powers and America’s role in the Allied victory, including, but not limited to the Manhattan Project, as well as events that shaped post-war peace."]},{"id":"6.USII.CW.7","title":"USII.7","text":"The student will apply history and social science skills to understand the transformation of U.S. foreign policy between the end of World War II and the new millennium by","grade":"Grade 6","strand":"Cold War","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["explaining how key decisions and agreements, including, but not limited to the Atlantic Charter, formation of the United Nations, and NATO, established international allies;","describing the Marshall Plan’s objectives for rebuilding Europe, the occupation and reconstruction of Japan, and the emergence of the United States and the Soviet Union as superpowers;","describing the differences between communism and a democratic nation, including, but not limited to self-governance and economic philosophy;","examining the role of the United States in fighting communism and defending freedom during the Cold War, including, but not limited to the Berlin Airlift, conflicts in Korea and Vietnam, the roles of John F. Kennedy and Nikita Khrushchev during the Cuban missile crisis, the fall of the Berlin Wall, and the collapse of communism in Eastern Europe; and","explaining the collapse of communism in the Soviet Union and Eastern Europe and the end of the Cold War, including the actions of Ronald Reagan and Mikhail Gorbachev."]},{"id":"6.USII.LEC.8","title":"USII.8","text":"The student will apply history and social science skills to analyze the key changing patterns of society during the second half of the 20th and early 21st centuries by","grade":"Grade 6","strand":"Late 20th-Early 21st Century","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["examining the contributions of key leaders and events during the Civil Rights Era, including, but not limited to Robert Kennedy, Dr. Martin Luther King, Jr., Malcolm X, Medgar Evers, John Lewis, Rosa Parks, Ruby Bridges, Jonathan Daniels, Dorothy Height, the Selma march, sit-ins, and boycotts;","explaining the significance of urban renewal plans, including, but not limited to Jackson Ward in Richmond and Vinegar Hill in Charlottesville;","examining key events of the 1960s and 1970s, including, but not limited to the Apollo Missions, the moon landing, assassinations, the women’s movement, the creation of public sector labor unions, Watergate and Nixon’s resignation, and the passing of the Clean Air Act and the Clean Water Act;","describing the impact of the Baby Boom, the changing demographics of the United States, and the ending of the military draft; and","describing the protections and provisions of the Americans with Disabilities Act (ADA);","describing the similarities and differences between the objectives of the women’s movement of the early and mid-20th century;","describing expanded educational and economic opportunities for military veterans, women, and minorities; and","describing how the terrorist attacks of September 11, 2001, including the heroic sacrifices of Flight 93 passengers, significantly impacted domestic policies, American society, and global perspectives on the war on terror."]},{"id":"6.USII.SCT.9","title":"USII.9","text":"The student will apply history and social science skills by","grade":"Grade 6","strand":"Science and Technology Since the Turn of the Century","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["studying the iterative and ongoing advancements in science and technology; and","describing the changes in American culture related to music, art, media, and communication, as well as advancements in American economics related to banking, business, and industry."]},{"id":"6.VA.CP.1","title":6.1,"text":"The student will apply creative thinking to communicate personal ideas, experiences, and narratives in works of art.","grade":"Grade 6","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"6.VA.CP.2","title":6.2,"text":"The student will apply steps of a creative process.","grade":"Grade 6","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Use, and record in a digital or traditional sketchbook/journal, steps of the creative process, including brainstorming, preliminary sketching, planning, reflecting, peer critiquing, refining, and elaborating, to create works of art.","Explain the relationship between artmaking processes and finished products."]},{"id":"6.VA.CC.3","title":6.3,"text":"The student will analyze, interpret, and evaluate artwork.","grade":"Grade 6","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Use critical thinking skills when describing, responding to, interpreting, and evaluating works of art.","Describe ideas and emotions expressed in works of art.","Identify how visual language communicates meaning","Examine the components of an artist’s style, including materials, design, technique, subject matter, and purpose.","Apply personal criteria to evaluate artwork."]},{"id":"6.VA.CC.4","title":6.4,"text":"The student will formulate, justify, and examine personal responses to art.","grade":"Grade 6","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Describe how the beliefs and values of a viewer may influence ideas and opinions about works of art.","Respond to questions about why artists create works of art.","Describe how works of art can evoke personal sensory, emotional, and aesthetic responses."]},{"id":"6.VA.CC.5","title":6.5,"text":"The student will develop communication and collaboration skills for a community of artists.","grade":"Grade 6","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Contribute to class discussions.","Identify procedures for the safety and care of art materials and tools."]},{"id":"6.VA.HC.6","title":6.6,"text":"The student will explore and understand historical and cultural influences of art.","grade":"Grade 6","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":["Explore how the ethnic heritage, culture, and personal identities of artists influence their work","Examine the roles of crafts in communities."]},{"id":"6.VA.HC.7","title":6.7,"text":"The student will describe ways artists contribute to their communities and society through their work.","grade":"Grade 6","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"6.VA.HC.8","title":6.8,"text":"The student will identify and apply digital citizenship skills related to intellectual property in art research, creation, use of source materials, and sharing.","grade":"Grade 6","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"6.VA.IA.9","title":6.9,"text":"The student will investigate various types of art careers.","grade":"Grade 6","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"6.VA.IA.10","title":6.1,"text":"The student will investigate and explore how to create a narrative using time-based media.","grade":"Grade 6","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"6.VA.IA.11","title":6.11,"text":"The student will explore cross-curricular connections with art content.","grade":"Grade 6","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"6.VA.TA.12","title":6.12,"text":"The student will use elements of art and principles of design to express meaning in works of art.","grade":"Grade 6","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Color—relationships.","Line—variation, implied.","Texture—visual, tactile.","Value—gradation.","Proportion—realistic, distorted."]},{"id":"6.VA.TA.13","title":6.13,"text":"The student will use a variety of perspective techniques to create the illusion of space in works of art.","grade":"Grade 6","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"6.VA.TA.14","title":6.14,"text":"The student will apply a variety of techniques including gesture and continuous line in observational drawings.","grade":"Grade 6","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"6.VA.TA.15","title":6.15,"text":"The student will exercise increasing skill and control in the use of media and techniques.","grade":"Grade 6","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"6.VA.TA.16","title":6.16,"text":"The student will use modeling, assembling, or carving to create three-dimensional works of art.","grade":"Grade 6","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"6.VA.TA.17","title":6.17,"text":"The student will create artworks from a variety of subject matter.","grade":"Grade 6","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]}]