[{"id":"6.USII.IG.3","title":"USII.3","text":"The student will apply history and social science skills to understand how industrialization changed life in rural and urban America after the Civil War by","grade":"Grade 6","strand":"Industrialization and Growth","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["explaining relationships among natural resources, transportation, and industrial development from 1865;","explaining the impact of new inventions, the rise of big business, the growth of industry, and the changes to life on American farms in response to industrialization;","evaluating and explaining the impact of the Progressive Movement on child labor, working conditions, the rise of organized labor, support for eugenics as a social policy, immigration policy, women’s suffrage, and the temperance movement;","explaining the events, factors, and motivations that caused individuals and groups to migrate to the United States towards the end of the 19th century;","examining the cause-and-effect relationship between rapid population growth and city government services and infrastructure;","explaining how governmental actions, including, but not limited to the Chinese Exclusion Act of 1882, caused harm to Chinese Americans and other immigrants;","explaining how various groups worked to alleviate the issues facing new immigrants and how immigrants advocated for themselves; and","describing the technological advances and the broader impact of the 1893 Chicago World's Fair on America’s rise as a world leader in innovation, business, and trade."]},{"id":"6.USII.IG.4","title":"USII.4","text":"The student will apply history and social science skills to explain the changing role of the United States from the late 19th century through World War I by","grade":"Grade 6","strand":"Industrialization and Growth","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["explaining the legacy of Theodore Roosevelt, including, but not limited to conservation contributions, progressivism, the building of the Panama Canal, and his role in the Spanish-American War;","explaining the reasons for and results of the Spanish-American War, including the Roosevelt Corollary to the Monroe Doctrine;","analyzing the major causes and consequences of World War I and examining the roles of key leaders and groups;","examining the evolution of warfare tactics and technology, including, but not limited to  cavalry, air, submarine, chemical, trench warfare, and other technological advancements;","explaining how the war was a catalyst for the United States gaining international power and expanded its sphere of international influence; and","examining how post-war sanctions and the failure of the League of Nations set the stage for World War II."]},{"id":"6.USII.IG.5","title":"USII.5","text":"The student will apply history and social science skills to understand the social, political, economic, and technological changes of the early 20th century by","grade":"Grade 6","strand":"Industrialization and Growth","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["explaining how capitalism and free markets helped foster developments in factory and labor productivity, transportation, and communication and how rural electrification changed American life and the standard of living;","examining how the rise of communism affected America, including, but not limited to the first Red Scare;","describing the reasons for and impact of the Great Migration;","describing the events and leaders that lead to prohibition, the Women’s Suffrage Movement, and the passage of the Nineteenth Amendment, including, but not limited to Susan B. Anthony, Lucy Burns, Elizabeth Cady Stanton, Carrie Chapman Catt, Ida B. Wells-Barnett, and Sojourner Truth;","examining the art, literature, and music of the 1920s and 1930s, including, but not limited to the Roaring Twenties and the Harlem Renaissance;","analyzing the causes of the Great Depression and the impact of the Dust Bowl on the lives of Americans;","describing the features, effects, programs, and lasting institutions of Franklin D. Roosevelt’s New Deal;","describing racial segregation, housing discrimination via redlining, the rise of “Jim Crow” laws, Black Codes, and threats of violence, including, but not limited to intimidation, lynchings, armed conflicts, suppressed voting rights, and limits on political participation  faced by African Americans and other people during post-Reconstruction; and","analyzing events and impacts of African American leaders in response to “Jim Crow,” including, but not limited to the formation of the NAACP, strikes, protests, the role of HBCUs, and the work of leaders like Booker T. Washington, W.E.B. DuBois, Mary White Ovington, Ida B. Wells-Barnett."]}]