[{"id":"6.USII.IG.5","title":"USII.5","text":"The student will apply history and social science skills to understand the social, political, economic, and technological changes of the early 20th century by","grade":"Grade 6","strand":"Industrialization and Growth","subject":"United States History 1865 to the Present","course":"United States History 1865 to the Present","subs":["explaining how capitalism and free markets helped foster developments in factory and labor productivity, transportation, and communication and how rural electrification changed American life and the standard of living;","examining how the rise of communism affected America, including, but not limited to the first Red Scare;","describing the reasons for and impact of the Great Migration;","describing the events and leaders that lead to prohibition, the Women’s Suffrage Movement, and the passage of the Nineteenth Amendment, including, but not limited to Susan B. Anthony, Lucy Burns, Elizabeth Cady Stanton, Carrie Chapman Catt, Ida B. Wells-Barnett, and Sojourner Truth;","examining the art, literature, and music of the 1920s and 1930s, including, but not limited to the Roaring Twenties and the Harlem Renaissance;","analyzing the causes of the Great Depression and the impact of the Dust Bowl on the lives of Americans;","describing the features, effects, programs, and lasting institutions of Franklin D. Roosevelt’s New Deal;","describing racial segregation, housing discrimination via redlining, the rise of “Jim Crow” laws, Black Codes, and threats of violence, including, but not limited to intimidation, lynchings, armed conflicts, suppressed voting rights, and limits on political participation  faced by African Americans and other people during post-Reconstruction; and","analyzing events and impacts of African American leaders in response to “Jim Crow,” including, but not limited to the formation of the NAACP, strikes, protests, the role of HBCUs, and the work of leaders like Booker T. Washington, W.E.B. DuBois, Mary White Ovington, Ida B. Wells-Barnett."]}]