[{"id":"7.CS24.AP.1","title":"7.AP.1","text":"The student will apply computational thinking to design programs to accomplish a task as a means of creative expression or scientific exploration.","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify patterns and repeated steps in an algorithm, problem, or process.","Decompose an algorithm, problem, or process into sub-components.","Abstract relevant information to identify essential details.","Contrast various algorithms to solve reasoning problems when accomplishing a task."]},{"id":"7.CS24.AP.2","title":"7.AP.2","text":"The student will plan and implement algorithms that include sequencing, loops, variables, user input, conditional control structures, and functions using a block-based or text-based programming tool.","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe the concept of functions for use in a computer program.","Plan an algorithm using plain language, pseudocode, or diagrams.","Read and write programs that collect and use numeric and text data from users.","Read and write programs that contain nested conditionals and nested loops."]},{"id":"7.CS24.AP.3","title":"7.AP.3","text":"The student will use the iterative design process to create, test, and debug programs using a block-based or text-based programming language.","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create and test programs that contain multiple control structures.","Trace and predict outcomes of programs.","Analyze the outcomes of programs to identify logic and syntax errors.","Analyze and describe the results of a program to assess validity of outcomes.","Revise and improve an algorithm to resolve errors or produce desired outcomes."]},{"id":"7.CS24.AP.4","title":"7.AP.4","text":"The student will apply proper attribution when incorporating other sources into original work.","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Apply proper methods of attribution when using work from the Internet and other sources.","Incorporate information or assets from the Internet into a program with proper attribution."]}]