[{"id":"7.CS24.IC.1","title":"7.IC.1","text":"The student will assess the national and global impact of computing technologies.","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Discuss specific examples of how computing technologies have influenced various national and global industries and sectors.","Analyze the implications of emerging technologies and potential real-world impact nationally and globally.","Evaluate the environmental impact of computing technologies nationally and globally"]},{"id":"7.CS24.IC.2","title":"7.IC.2","text":"The student will describe and explain the impact of screen time on interactions with others","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe the positive and negative impact of social media on socialization.","Research the type of data collected on social media and online platforms that monitor social interactions.","Describe and explain the evolution of screen time and the impact it has had on social interactions.","Create a social media usage plan that demonstrates safe practices, meaningful use, and a balanced approach."]},{"id":"7.CS24.IC.3","title":"7.IC.3","text":"The student will identify individual preferences, skillset, and experiences and determine how these relate to a chosen computer science career field.","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Use a career interest assessment to identify and categorize preferences, skillsets, and experiences.","Evaluate and connect personal skillsets, interests, talents, and values to a computer science career."]},{"id":"7.CS24.IC.4","title":"7.IC.4","text":"The student will identify and apply strategies to prevent personal and public works from being pirated and plagiarized.","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Discuss and describe intellectual property protections.","Research and list safeguards used to prevent intellectual property infringement."]},{"id":"7.CS24.IC.5","title":"7.IC.5","text":"The student will evaluate the effect of Artificial Intelligence (AI) in various professions.","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Research AI integration in various professions and evaluate its impact on the job market and society.","Examine and analyze the impact on job creation and changes in employment needs based on the use of AI.","Evaluate and explain the benefits and drawbacks of the implementation of AI technologies in various professions"]}]