[{"id":"7.CVE.PP.8","title":"CE.8","text":"The student will apply history and social science skills to examine the political process at the local, state, and national levels of government by","grade":"Grade 7","strand":"The Political Process","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the origins, history, and functions of political parties;","analyzing campaigns for elective office, with emphasis on the roles of candidates, volunteers, the media, voters, and poll watchers;","explaining the role of campaign contributions and the cost of campaigns;","examining the history of and requirements for voter registration; and","describing the role of the Electoral College in the election of the president and vice president."]},{"id":"7.CVE.PP.9","title":"CE.9","text":"The student will apply history and social science skills to explain the role of the media and social media and the influence on local, state, and national levels of government by","grade":"Grade 7","strand":"The Political Process","subject":"Civics & Economics","course":"Civics & Economics","subs":["explaining the role and rights of the press in reporting events;","describing the effect biased reporting can have on public opinion;","explaining that individuals play in the political policy-making process by expressing their opinions formally or informally via print, electronically, or in person;","evaluating the effect of social media on political campaigns, politics, and civic discourse;","identifying the source of information and considering possible motivations or biases of its creator; and","evaluating multiple sources describing the same event or idea and reflecting on the reasons for any discrepancies."]},{"id":"7.CVE.PP.10","title":"CE.10","text":"The students will apply history and social science skills to analyze the role of public participation in American civic life by","grade":"Grade 7","strand":"The Political Process","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing duties of citizens, including paying taxes, serving on a jury, following the law, voting, and registering for selective service;","evaluating voting dates and processes in Virginia; and","explaining voter eligibility and requirements for registration."]}]