[{"id":"7.CVE.SK.0","title":"Skills","text":"The student will apply history and social science skills to the content by","grade":"Grade 7","strand":"Skills","subject":"Civics & Economics","course":"Civics & Economics","subs":["selecting and synthesizing evidence from information sources, including, but not limited to artifacts, primary and secondary sources, charts, graphs, and diagrams to understand civics and economics;","applying geographic skills to determine and predict patterns and trends of people, places, or events;","developing questions, enhancing curiosity, and engaging in critical thinking and analysis;","integrating evidence to construct and analyze timelines, classify events, and to distinguish fact and opinion;","comparing and contrasting historical, cultural, economic, and political perspectives;","determining and explaining cause and effect relationships;","analyzing the costs and benefits and incentives and consequences of a specific choice using various economic decision-making models;","engaging and communicating as a civil and informed individual with persons with different perspectives; and","developing products that reflect an understanding of research, content, and civics and economic concepts."]},{"id":"7.CVE.ACG.1","title":"CE.1","text":"The student will apply history and social science skills to explain the foundations of the American constitutional democracy by","grade":"Grade 7","strand":"American Constitutional Government","subject":"Civics & Economics","course":"Civics & Economics","subs":["explaining the fundamental principles of limited government, republicanism, federalism, checks and balances, separation of powers, and popular sovereignty;","describing the Magna Carta, English common law, charters of the Virginia Company of London (April 10, 1606; May 23, 1609; and March 12, 1612), the Virginia Declaration of Rights, the Declaration of Independence, the Articles of Confederation, and the Virginia Statute for Religious Freedom and their influence on the Constitution of Virginia and the Constitution of the United States, including the Bill of Rights;","comparing and contrasting debates, compromises, and plans surrounding the drafting and ratification of the U.S. Constitution and the Bill of Rights;","describing the purpose of the Constitution of the United States as stated in its Preamble;","explaining the fundamental concepts of the U.S. government, including but not limited to  due process, equal justice under the law, equal protection, elections and a representative government, limited government, right to private property, rule of law, Supremacy Clause, and separation of powers; and","describing the procedures for amending the Constitution of Virginia and the Constitution of the United States."]},{"id":"7.CVE.ACG.2","title":"CE.2","text":"The student will apply history and social science skills to analyze how American constitutional government functions at the national level by","grade":"Grade 7","strand":"American Constitutional Government","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the structure and powers of the government (the three branches of government);","explaining the legislative branch and the lawmaking process as explained in Article I of the U.S. Constitution;","explaining the particular role and powers of the executive branch as explained in Article II of the U.S. Constitution;","explaining the particular role and powers of the judicial branch as explained in Article III of the U.S. Constitution; and","explaining the principle of separation of powers and the operation of checks and balances."]},{"id":"7.CVE.ACG.3","title":"CE.3","text":"The student will apply history and social science skills to analyze how constitutional government functions at the state level by","grade":"Grade 7","strand":"American Constitutional Government","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the structure and powers of the state government (the three branches of government);","explaining the state lawmaking process;","describing the roles and powers of the executive branch and regulatory boards as they affect states;","explaining the relationship between state governments and the national government in the federal system, referencing Federalist No.10 and Federalist No. 51; and","explaining the principle of separation of powers and the operation of checks and balances at the state level."]},{"id":"7.CVE.ACG.4","title":"CE.4","text":"The student will apply history and social science skills to analyze American constitutional government at the local level by","grade":"Grade 7","strand":"American Constitutional Government","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the structure and powers of the local government and explaining the local lawmaking process;","describing how state, national, and international issues and events impact local decision making; and","comparing and contrasting powers and responsibilities of local, state, federal, and tribal governments, including, but not limited to citizen engagement, how each is financed, and how they work together and independently."]},{"id":"7.CVE.ACG.5","title":"CE.5","text":"The student will apply history and social science skills to explain the judicial systems established by the Constitution of Virginia and the Constitution of the United States by","grade":"Grade 7","strand":"American Constitutional Government","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the system of state and federal courts, including, but not limited to jurisdiction and judicial review;","describing how due-process protections seek to ensure justice;","comparing and contrasting civil and criminal cases; and","explaining the effects of Supreme Court cases affecting the judiciary, including, but not limited to Marbury v. Madison."]},{"id":"7.CVE.CCL.6","title":"CE.6","text":"The student will apply history and social science skills to define citizenship by","grade":"Grade 7","strand":"Citizenship and Civic Life","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the processes by which an individual becomes a citizen of the United States;","describing the rights and privileges guaranteed by the First Amendment, including freedoms of religion, speech, press, assembly, and petition, the rights guaranteed by due process and equal protection under the law (Fifth, Sixth, and Fourteenth Amendments), and protection from unreasonable government search and seizure (Fourth Amendment);","examining ways to peacefully work for change in communities or the nation by participating in political campaigns and methods of peacefully petitioning the government for change;","examining how civic participation can address community needs and serve the public good, including the importance of volunteering, staying informed about current issues, and respecting differing beliefs in a diverse society;","examining the process and importance of immigration policies at different points in U.S. history; and","reviewing the criteria and exam for naturalizing U.S. citizens."]},{"id":"7.CVE.CCL.","title":"CE.7","text":"The student will apply history and social science skills that exhibit effective and respectful participation in civic life, including, but not limited to civility, trustworthiness and honesty, courtesy and respect for the rights of others, personal responsibility, military service, self-reliance, hard work, respect for the law, patriotism, and service in one’s community.","grade":"Grade 7","strand":"Citizenship and Civic Life","subject":"Civics & Economics","course":"Civics & Economics","subs":[]},{"id":"7.CVE.PP.8","title":"CE.8","text":"The student will apply history and social science skills to examine the political process at the local, state, and national levels of government by","grade":"Grade 7","strand":"The Political Process","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the origins, history, and functions of political parties;","analyzing campaigns for elective office, with emphasis on the roles of candidates, volunteers, the media, voters, and poll watchers;","explaining the role of campaign contributions and the cost of campaigns;","examining the history of and requirements for voter registration; and","describing the role of the Electoral College in the election of the president and vice president."]},{"id":"7.CVE.PP.9","title":"CE.9","text":"The student will apply history and social science skills to explain the role of the media and social media and the influence on local, state, and national levels of government by","grade":"Grade 7","strand":"The Political Process","subject":"Civics & Economics","course":"Civics & Economics","subs":["explaining the role and rights of the press in reporting events;","describing the effect biased reporting can have on public opinion;","explaining that individuals play in the political policy-making process by expressing their opinions formally or informally via print, electronically, or in person;","evaluating the effect of social media on political campaigns, politics, and civic discourse;","identifying the source of information and considering possible motivations or biases of its creator; and","evaluating multiple sources describing the same event or idea and reflecting on the reasons for any discrepancies."]},{"id":"7.CVE.PP.10","title":"CE.10","text":"The students will apply history and social science skills to analyze the role of public participation in American civic life by","grade":"Grade 7","strand":"The Political Process","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing duties of citizens, including paying taxes, serving on a jury, following the law, voting, and registering for selective service;","evaluating voting dates and processes in Virginia; and","explaining voter eligibility and requirements for registration."]},{"id":"7.CVE.ED.11","title":"CE.11","text":"The student will apply history and social science skills to analyze how economic decisions are made in the marketplace and in daily life by","grade":"Grade 7","strand":"Economic Decisions","subject":"Civics & Economics","course":"Civics & Economics","subs":["explaining that because of scarcity, consumers, producers, and governments must make economic choices, and understanding that all choices have an opportunity cost;","explaining the importance of innovation and productivity, including the freedom to choose occupations, the role of technology, and the development of human capital; and","comparing and contrasting free-market, command, and mixed economies to determine how each affects the allocation of limited resources and the subsequent effects on individuals’ lives."]},{"id":"7.CVE.ED.12","title":"CE.12","text":"The student will apply history and social science skills to describe the United States economy by","grade":"Grade 7","strand":"Economic Decisions","subject":"Civics & Economics","course":"Civics & Economics","subs":["evaluating the shared fundamental principles and connection of free enterprise and democracy;","describing the critical components of the United States economy, such as limited government, private property, markets, consumer sovereignty, and competition;","explaining the effect of supply and demand in a market economy on consumer prices and the concept of inflation;","describing the types of business organizations and the role of entrepreneurship;","explaining the role of consumers, producers, and government interactions on the economy;","explaining how financial institutions are critical to creating capital to fuel economic growth for individuals and the larger economy by channeling funds from savers to borrowers through lending; and","analyzing the role of Virginia in the United States and global economies, with an emphasis on the effect of technological innovations."]},{"id":"7.CVE.ED.13","title":"CE.13","text":"The student will apply history and social science skills to analyze the role of government in the United States economy by","grade":"Grade 7","strand":"Economic Decisions","subject":"Civics & Economics","course":"Civics & Economics","subs":["examining the effect of competition in the marketplace;","explaining how and why government provides certain public goods and services;","describing how local, state, and federal governments allocate their budgets and collect taxes to pay for goods and services;","explaining the structure and main function of the Federal Reserve System and how it acts as the nation’s central bank;","explaining the role of government currency and analyzing the purpose of a money economy;","describing how governments regulate commerce to protect consumers, the environment, competition in the marketplace, and property rights; and","evaluating how and why governments regulate industry, labor, competition, and monopolies in the marketplace."]},{"id":"7.CVE.ED.14","title":"CE.14","text":"The student will apply history and social science skills to explain career opportunities and understand the fundamentals of personal finance by","grade":"Grade 7","strand":"Economic Decisions","subject":"Civics & Economics","course":"Civics & Economics","subs":["identifying the talents, interests, and aspirations that can influence career choice;","identifying the attitudes and behaviors that strengthen the individual work ethic and promote career success;","identifying human capital, abilities, intellectual and physical skills, work habits, and education and the changing supply of and demand for them in the economy;","examining the effect of technological change and globalization on career opportunities;","describing the importance of education to one’s intellectual life, lifelong learning, and personal goals;","analyzing the role of financial responsibility in good citizenship, including, but not limited to evaluating common forms of credit, savings, and investments;","describing the importance of equal opportunities for access to education and training; and","researching jobs and careers in the public and private sector and understanding the pathways to various careers."]},{"id":"7.CS.AP.1","title":7.1,"text":"The student will construct programs to accomplish a task as a means of creative expression or scientific exploration using a block based or text based programming language, both independently and collaboratively,","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":["combining control structures such as if-statements and loops including compound conditionals; and","creating clearly named variables that represent different data types, including numeric and non-numeric data, and perform operations on their values."]},{"id":"7.CS.AP.2","title":7.2,"text":"The student will document programs to make them easier to follow, test, and debug.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.AP.3","title":7.3,"text":"The student will distribute tasks and maintain a project timeline when collaboratively developing computational artifacts.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.AP.4","title":7.4,"text":"The student will decompose problems and subproblems into parts to facilitate the design, implementation, and review of programs.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.SYS.5","title":7.5,"text":"The student will describe how the Internet connects devices and networks all over the world. Exclusion: Specific devices used to implement the Internet are beyond the scope of these standards.","grade":"Grade 7","strand":"Computing Systems","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.CY.6","title":7.6,"text":"The student will describe how physical and digital security measures protect electronic information.","grade":"Grade 7","strand":"Cybersecurity","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.CY.7","title":7.7,"text":"The student will identify existing cybersecurity concerns associated with Internet use and Internet-based systems and potential options to address these issues.","grade":"Grade 7","strand":"Cybersecurity","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.DA.8","title":7.8,"text":"The student will discuss the correctness of a model representing a system by comparing the model’s generated results with data that were observed in the system being modeled.","grade":"Grade 7","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.DA.9","title":7.9,"text":"The student will refine computational models based on the data they have generated.","grade":"Grade 7","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.IC.10","title":7.1,"text":"The student will explain how advances in technology have contributed to Virginia’s prosperity and role in the global economy.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.IC.11","title":7.11,"text":"The student will describe the development of new technologies in communication, entertainment, and business and their impact on American life.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.IC.12","title":7.12,"text":"The student will explore careers related to the Internet.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.NI.13","title":7.13,"text":"The student will outline the advantages and disadvantages of transmitting information over the Internet, including speed, reliability, cost, and security.","grade":"Grade 7","strand":"Networking & the Internet","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.NI.14","title":7.14,"text":"The student will explain why protocols are necessary in data transmission. Model the role of protocols in transmitting data across networks and the Internet.","grade":"Grade 7","strand":"Networking & the Internet","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.NI.15","title":7.15,"text":"The student will model how information is broken down into smaller pieces, transmitted as packets through multiple devices over networks and the Internet, and reassembled at the destination.","grade":"Grade 7","strand":"Networking & the Internet","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.AP.7","title":7.7,"text":null,"grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.MT.NS.1","title":7.1,"text":"The student will","grade":"Grade 7","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["investigate and describe the concept of negative exponents for powers of ten;","compare and order numbers greater than zero written in scientific notation;","compare and order rational numbers;","determine square roots of perfect squares; and","identify and describe absolute value of rational numbers."]},{"id":"7.MT.CE.2","title":7.2,"text":"The student will solve practical problems involving operations with rational numbers.","grade":"Grade 7","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.CE.3","title":7.3,"text":"The student will solve single-step and multistep practical problems, using proportional reasoning.","grade":"Grade 7","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.MG.4","title":7.4,"text":"The student will","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["describe and determine the volume and surface area of rectangular prisms and cylinders; and","solve problems, including practical problems, involving the volume and surface area of rectangular prisms and cylinders."]},{"id":"7.MT.MG.5","title":7.5,"text":"The student will solve problems, including practical problems, involving the relationship between corresponding sides and corresponding angles of similar quadrilaterals and triangles.","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.MG.6","title":7.6,"text":"The student will","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["compare and contrast quadrilaterals based on their properties; and","determine unknown side lengths or angle measures of quadrilaterals."]},{"id":"7.MT.MG.7","title":7.7,"text":"The student will apply translations and reflections of right triangles or rectangles in the coordinate plane.","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.PS.8","title":7.8,"text":"The student will","grade":"Grade 7","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["determine the theoretical and experimental probabilities of an event; and","investigate and describe the difference between the experimental probability and theoretical probability of an event."]},{"id":"7.MT.PS.9","title":7.9,"text":"The student, given data in a practical situation, will","grade":"Grade 7","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["represent data in a histogram;","make observations and inferences about data represented in a histogram; and","compare histograms with the same data represented in stem-and-leaf plots, line plots, and circle graphs."]},{"id":"7.MT.PA.10","title":7.1,"text":"The student will","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":["determine the slope, m, as rate of change in a proportional relationship between two quantities and write an equation in the form y = mx to represent the relationship;","graph a line representing a proportional relationship between two quantities given the slope and an ordered pair, or given the equation in y = mx form where m represents the slope as rate of change;","determine the y-intercept, b, in an additive relationship between two quantities and write an equation in the form y = x + b to represent the relationship;","graph a line representing an additive relationship between two quantities given the yintercept and an ordered pair, or given the equation in the form y = x + b, where b represents the y-intercept; and","make connections between and among representations of a proportional or additive relationship between two quantities using verbal descriptions, tables, equations, and graphs."]},{"id":"7.MT.PA.11","title":7.11,"text":"The student will evaluate algebraic expressions for given replacement values of the variables.","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.PA.12","title":7.12,"text":"The student will solve two-step linear equations in one variable, including practical problems that require the solution of a two-step linear equation in one variable.","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.PA.13","title":7.1,"text":"The student will solve one- and two-step linear inequalities in one variable, including practical problems, involving addition, subtraction, multiplication, and division, and graph  the solution on a number line.","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.VA.CP.1","title":7.1,"text":"The student will apply creative thinking to communicate ideas, experiences, and narratives in works of art.","grade":"Grade 7","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.CP.2","title":7.2,"text":"The student will apply steps of a creative process.","grade":"Grade 7","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Use, and record in a digital or traditional sketchbook/journal, steps of the creative process, including research to create works of art.","Use ideas, concepts, and prior knowledge to solve artmaking challenges and create works of art."]},{"id":"7.VA.CC.3","title":7.3,"text":"The student will analyze, interpret, and evaluate artwork.","grade":"Grade 7","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Identify subjects, themes, and symbols as they relate to meaning in works of art.","Compare and contrast the processes artists use to create works of art.","Analyze, interpret, and evaluate works of art, based on personal, cultural, and contextual information.","Evaluate the work of self and others using developed and established criteria."]},{"id":"7.VA.CC.4","title":7.4,"text":"The student will formulate, justify, and examine personal responses to art.","grade":"Grade 7","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Identify ways that social and cultural beliefs can influence responses to works of art.","Describe personal responses to visual qualities of works of art.","Analyze and reflect on the purposes and meaning of art."]},{"id":"7.VA.CC.5","title":7.5,"text":"The student will develop communication and collaboration skills for a community of artists.","grade":"Grade 7","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Contribute to group discussions about visual arts topics.","Describe procedures for the safety and care of art materials and tools."]},{"id":"7.VA.HC.6","title":7.6,"text":"The student will explore and understand historical and cultural influences of art.","grade":"Grade 7","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":["Identify styles and themes in historical and contemporary works of art from a variety of cultures.","Analyze how art and culture influence each other."]},{"id":"7.VA.HC.7","title":7.7,"text":"The student will identify venues for experiencing visual arts in the community and the Commonwealth.","grade":"Grade 7","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.HC.8","title":7.8,"text":"The student will describe and apply digital citizenship skills related to intellectual property in art research, creation, use of source materials, and sharing.","grade":"Grade 7","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.IA.9","title":7.9,"text":"The student will compare and contrast various visual arts careers in relation to career preparation.","grade":"Grade 7","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.IA.10","title":7.1,"text":"The student will investigate and explore a variety of contemporary and digital media tools for following the creative process.","grade":"Grade 7","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.IA.11","title":7.11,"text":"The student will use ideas, concepts, and cross-curricular knowledge to create original works of art.","grade":"Grade 7","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.12","title":7.12,"text":"The student will use elements of art and principles of design to express meaning in works of art:","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Color—harmonious chromatic relationships.","Line—contrast, gradation.","Space—positive, negative.","Emphasis—focal point, dominance.","Proportion—actual, exaggerated."]},{"id":"7.VA.TA.13","title":7.13,"text":"The student will use a variety of compositional techniques, including perspective, to create the illusion of space within the picture plane.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.14","title":7.14,"text":"The student will apply a variety of techniques in observational and expressive drawing.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.15","title":7.15,"text":"The student will refine media techniques to demonstrate developing technical skill.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.16","title":7.16,"text":"The student will create three-dimensional works of art, using various processes to include clay hand-building techniques.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.17","title":7.17,"text":"The student will create and respond to representational and nonrepresentational artwork.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]}]