[{"id":"7.CVE.SK.0","title":"Skills","text":"The student will apply history and social science skills to the content by","grade":"Grade 7","strand":"Skills","subject":"Civics & Economics","course":"Civics & Economics","subs":["selecting and synthesizing evidence from information sources, including, but not limited to artifacts, primary and secondary sources, charts, graphs, and diagrams to understand civics and economics;","applying geographic skills to determine and predict patterns and trends of people, places, or events;","developing questions, enhancing curiosity, and engaging in critical thinking and analysis;","integrating evidence to construct and analyze timelines, classify events, and to distinguish fact and opinion;","comparing and contrasting historical, cultural, economic, and political perspectives;","determining and explaining cause and effect relationships;","analyzing the costs and benefits and incentives and consequences of a specific choice using various economic decision-making models;","engaging and communicating as a civil and informed individual with persons with different perspectives; and","developing products that reflect an understanding of research, content, and civics and economic concepts."]},{"id":"7.CVE.ACG.1","title":"CE.1","text":"The student will apply history and social science skills to explain the foundations of the American constitutional democracy by","grade":"Grade 7","strand":"American Constitutional Government","subject":"Civics & Economics","course":"Civics & Economics","subs":["explaining the fundamental principles of limited government, republicanism, federalism, checks and balances, separation of powers, and popular sovereignty;","describing the Magna Carta, English common law, charters of the Virginia Company of London (April 10, 1606; May 23, 1609; and March 12, 1612), the Virginia Declaration of Rights, the Declaration of Independence, the Articles of Confederation, and the Virginia Statute for Religious Freedom and their influence on the Constitution of Virginia and the Constitution of the United States, including the Bill of Rights;","comparing and contrasting debates, compromises, and plans surrounding the drafting and ratification of the U.S. Constitution and the Bill of Rights;","describing the purpose of the Constitution of the United States as stated in its Preamble;","explaining the fundamental concepts of the U.S. government, including but not limited to  due process, equal justice under the law, equal protection, elections and a representative government, limited government, right to private property, rule of law, Supremacy Clause, and separation of powers; and","describing the procedures for amending the Constitution of Virginia and the Constitution of the United States."]},{"id":"7.CVE.ACG.2","title":"CE.2","text":"The student will apply history and social science skills to analyze how American constitutional government functions at the national level by","grade":"Grade 7","strand":"American Constitutional Government","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the structure and powers of the government (the three branches of government);","explaining the legislative branch and the lawmaking process as explained in Article I of the U.S. Constitution;","explaining the particular role and powers of the executive branch as explained in Article II of the U.S. Constitution;","explaining the particular role and powers of the judicial branch as explained in Article III of the U.S. Constitution; and","explaining the principle of separation of powers and the operation of checks and balances."]},{"id":"7.CVE.ACG.3","title":"CE.3","text":"The student will apply history and social science skills to analyze how constitutional government functions at the state level by","grade":"Grade 7","strand":"American Constitutional Government","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the structure and powers of the state government (the three branches of government);","explaining the state lawmaking process;","describing the roles and powers of the executive branch and regulatory boards as they affect states;","explaining the relationship between state governments and the national government in the federal system, referencing Federalist No.10 and Federalist No. 51; and","explaining the principle of separation of powers and the operation of checks and balances at the state level."]},{"id":"7.CVE.ACG.4","title":"CE.4","text":"The student will apply history and social science skills to analyze American constitutional government at the local level by","grade":"Grade 7","strand":"American Constitutional Government","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the structure and powers of the local government and explaining the local lawmaking process;","describing how state, national, and international issues and events impact local decision making; and","comparing and contrasting powers and responsibilities of local, state, federal, and tribal governments, including, but not limited to citizen engagement, how each is financed, and how they work together and independently."]},{"id":"7.CVE.ACG.5","title":"CE.5","text":"The student will apply history and social science skills to explain the judicial systems established by the Constitution of Virginia and the Constitution of the United States by","grade":"Grade 7","strand":"American Constitutional Government","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the system of state and federal courts, including, but not limited to jurisdiction and judicial review;","describing how due-process protections seek to ensure justice;","comparing and contrasting civil and criminal cases; and","explaining the effects of Supreme Court cases affecting the judiciary, including, but not limited to Marbury v. Madison."]},{"id":"7.CVE.CCL.6","title":"CE.6","text":"The student will apply history and social science skills to define citizenship by","grade":"Grade 7","strand":"Citizenship and Civic Life","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the processes by which an individual becomes a citizen of the United States;","describing the rights and privileges guaranteed by the First Amendment, including freedoms of religion, speech, press, assembly, and petition, the rights guaranteed by due process and equal protection under the law (Fifth, Sixth, and Fourteenth Amendments), and protection from unreasonable government search and seizure (Fourth Amendment);","examining ways to peacefully work for change in communities or the nation by participating in political campaigns and methods of peacefully petitioning the government for change;","examining how civic participation can address community needs and serve the public good, including the importance of volunteering, staying informed about current issues, and respecting differing beliefs in a diverse society;","examining the process and importance of immigration policies at different points in U.S. history; and","reviewing the criteria and exam for naturalizing U.S. citizens."]},{"id":"7.CVE.CCL.","title":"CE.7","text":"The student will apply history and social science skills that exhibit effective and respectful participation in civic life, including, but not limited to civility, trustworthiness and honesty, courtesy and respect for the rights of others, personal responsibility, military service, self-reliance, hard work, respect for the law, patriotism, and service in one’s community.","grade":"Grade 7","strand":"Citizenship and Civic Life","subject":"Civics & Economics","course":"Civics & Economics","subs":[]},{"id":"7.CVE.PP.8","title":"CE.8","text":"The student will apply history and social science skills to examine the political process at the local, state, and national levels of government by","grade":"Grade 7","strand":"The Political Process","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing the origins, history, and functions of political parties;","analyzing campaigns for elective office, with emphasis on the roles of candidates, volunteers, the media, voters, and poll watchers;","explaining the role of campaign contributions and the cost of campaigns;","examining the history of and requirements for voter registration; and","describing the role of the Electoral College in the election of the president and vice president."]},{"id":"7.CVE.PP.9","title":"CE.9","text":"The student will apply history and social science skills to explain the role of the media and social media and the influence on local, state, and national levels of government by","grade":"Grade 7","strand":"The Political Process","subject":"Civics & Economics","course":"Civics & Economics","subs":["explaining the role and rights of the press in reporting events;","describing the effect biased reporting can have on public opinion;","explaining that individuals play in the political policy-making process by expressing their opinions formally or informally via print, electronically, or in person;","evaluating the effect of social media on political campaigns, politics, and civic discourse;","identifying the source of information and considering possible motivations or biases of its creator; and","evaluating multiple sources describing the same event or idea and reflecting on the reasons for any discrepancies."]},{"id":"7.CVE.PP.10","title":"CE.10","text":"The students will apply history and social science skills to analyze the role of public participation in American civic life by","grade":"Grade 7","strand":"The Political Process","subject":"Civics & Economics","course":"Civics & Economics","subs":["describing duties of citizens, including paying taxes, serving on a jury, following the law, voting, and registering for selective service;","evaluating voting dates and processes in Virginia; and","explaining voter eligibility and requirements for registration."]},{"id":"7.CVE.ED.11","title":"CE.11","text":"The student will apply history and social science skills to analyze how economic decisions are made in the marketplace and in daily life by","grade":"Grade 7","strand":"Economic Decisions","subject":"Civics & Economics","course":"Civics & Economics","subs":["explaining that because of scarcity, consumers, producers, and governments must make economic choices, and understanding that all choices have an opportunity cost;","explaining the importance of innovation and productivity, including the freedom to choose occupations, the role of technology, and the development of human capital; and","comparing and contrasting free-market, command, and mixed economies to determine how each affects the allocation of limited resources and the subsequent effects on individuals’ lives."]},{"id":"7.CVE.ED.12","title":"CE.12","text":"The student will apply history and social science skills to describe the United States economy by","grade":"Grade 7","strand":"Economic Decisions","subject":"Civics & Economics","course":"Civics & Economics","subs":["evaluating the shared fundamental principles and connection of free enterprise and democracy;","describing the critical components of the United States economy, such as limited government, private property, markets, consumer sovereignty, and competition;","explaining the effect of supply and demand in a market economy on consumer prices and the concept of inflation;","describing the types of business organizations and the role of entrepreneurship;","explaining the role of consumers, producers, and government interactions on the economy;","explaining how financial institutions are critical to creating capital to fuel economic growth for individuals and the larger economy by channeling funds from savers to borrowers through lending; and","analyzing the role of Virginia in the United States and global economies, with an emphasis on the effect of technological innovations."]},{"id":"7.CVE.ED.13","title":"CE.13","text":"The student will apply history and social science skills to analyze the role of government in the United States economy by","grade":"Grade 7","strand":"Economic Decisions","subject":"Civics & Economics","course":"Civics & Economics","subs":["examining the effect of competition in the marketplace;","explaining how and why government provides certain public goods and services;","describing how local, state, and federal governments allocate their budgets and collect taxes to pay for goods and services;","explaining the structure and main function of the Federal Reserve System and how it acts as the nation’s central bank;","explaining the role of government currency and analyzing the purpose of a money economy;","describing how governments regulate commerce to protect consumers, the environment, competition in the marketplace, and property rights; and","evaluating how and why governments regulate industry, labor, competition, and monopolies in the marketplace."]},{"id":"7.CVE.ED.14","title":"CE.14","text":"The student will apply history and social science skills to explain career opportunities and understand the fundamentals of personal finance by","grade":"Grade 7","strand":"Economic Decisions","subject":"Civics & Economics","course":"Civics & Economics","subs":["identifying the talents, interests, and aspirations that can influence career choice;","identifying the attitudes and behaviors that strengthen the individual work ethic and promote career success;","identifying human capital, abilities, intellectual and physical skills, work habits, and education and the changing supply of and demand for them in the economy;","examining the effect of technological change and globalization on career opportunities;","describing the importance of education to one’s intellectual life, lifelong learning, and personal goals;","analyzing the role of financial responsibility in good citizenship, including, but not limited to evaluating common forms of credit, savings, and investments;","describing the importance of equal opportunities for access to education and training; and","researching jobs and careers in the public and private sector and understanding the pathways to various careers."]},{"id":"7.CS.AP.1","title":7.1,"text":"The student will construct programs to accomplish a task as a means of creative expression or scientific exploration using a block based or text based programming language, both independently and collaboratively,","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":["combining control structures such as if-statements and loops including compound conditionals; and","creating clearly named variables that represent different data types, including numeric and non-numeric data, and perform operations on their values."]},{"id":"7.CS.AP.2","title":7.2,"text":"The student will document programs to make them easier to follow, test, and debug.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.AP.3","title":7.3,"text":"The student will distribute tasks and maintain a project timeline when collaboratively developing computational artifacts.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.AP.4","title":7.4,"text":"The student will decompose problems and subproblems into parts to facilitate the design, implementation, and review of programs.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.SYS.5","title":7.5,"text":"The student will describe how the Internet connects devices and networks all over the world. Exclusion: Specific devices used to implement the Internet are beyond the scope of these standards.","grade":"Grade 7","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.CY.6","title":7.6,"text":"The student will describe how physical and digital security measures protect electronic information.","grade":"Grade 7","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.CY.7","title":7.7,"text":"The student will identify existing cybersecurity concerns associated with Internet use and Internet-based systems and potential options to address these issues.","grade":"Grade 7","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.DA.8","title":7.8,"text":"The student will discuss the correctness of a model representing a system by comparing the model’s generated results with data that were observed in the system being modeled.","grade":"Grade 7","strand":"Data & Analysis","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.DA.9","title":7.9,"text":"The student will refine computational models based on the data they have generated.","grade":"Grade 7","strand":"Data & Analysis","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.IC.10","title":7.1,"text":"The student will explain how advances in technology have contributed to Virginia’s prosperity and role in the global economy.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.IC.11","title":7.11,"text":"The student will describe the development of new technologies in communication, entertainment, and business and their impact on American life.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.IC.12","title":7.12,"text":"The student will explore careers related to the Internet.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.NI.13","title":7.13,"text":"The student will outline the advantages and disadvantages of transmitting information over the Internet, including speed, reliability, cost, and security.","grade":"Grade 7","strand":"Networking & the Internet","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.NI.14","title":7.14,"text":"The student will explain why protocols are necessary in data transmission. Model the role of protocols in transmitting data across networks and the Internet.","grade":"Grade 7","strand":"Networking & the Internet","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.NI.15","title":7.15,"text":"The student will model how information is broken down into smaller pieces, transmitted as packets through multiple devices over networks and the Internet, and reassembled at the destination.","grade":"Grade 7","strand":"Networking & the Internet","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS.AP.7","title":7.7,"text":null,"grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"7.CS24.AP.1","title":"7.AP.1","text":"The student will apply computational thinking to design programs to accomplish a task as a means of creative expression or scientific exploration.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify patterns and repeated steps in an algorithm, problem, or process.","Decompose an algorithm, problem, or process into sub-components.","Abstract relevant information to identify essential details.","Contrast various algorithms to solve reasoning problems when accomplishing a task."]},{"id":"7.CS24.AP.2","title":"7.AP.2","text":"The student will plan and implement algorithms that include sequencing, loops, variables, user input, conditional control structures, and functions using a block-based or text-based programming tool.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe the concept of functions for use in a computer program.","Plan an algorithm using plain language, pseudocode, or diagrams.","Read and write programs that collect and use numeric and text data from users.","Read and write programs that contain nested conditionals and nested loops."]},{"id":"7.CS24.AP.3","title":"7.AP.3","text":"The student will use the iterative design process to create, test, and debug programs using a block-based or text-based programming language.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create and test programs that contain multiple control structures.","Trace and predict outcomes of programs.","Analyze the outcomes of programs to identify logic and syntax errors.","Analyze and describe the results of a program to assess validity of outcomes.","Revise and improve an algorithm to resolve errors or produce desired outcomes."]},{"id":"7.CS24.AP.4","title":"7.AP.4","text":"The student will apply proper attribution when incorporating other sources into original work.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Apply proper methods of attribution when using work from the Internet and other sources.","Incorporate information or assets from the Internet into a program with proper attribution."]},{"id":"7.CS24.CSY.1","title":"7.CSY.1","text":"The student will design projects that use computing devices to collect and exchange data.","grade":"Grade 7","strand":"Computing Systems","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Apply project management skills to distribute tasks and maintain project timeline.","Generate ideas combining hardware and software components that can be used to collect and exchange data.","Describe how hardware and software can be used together to collect and exchange data.","Evaluate the usability of hardware and software to collect and exchange data.","Select the hardware and software components for project designs by considering factors such as functionality, cost, size, speed, accessibility, and aesthetics."]},{"id":"7.CS24.CSY.2","title":"7.CSY.2","text":"The student will apply computational thinking to troubleshoot and document hardware and software-related problems.","grade":"Grade 7","strand":"Computing Systems","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Apply systematic processes to resolve hardware, software, and connectivityrelated problems.","Compile and record successful methods used to resolve problems for common hardware, software, and connectivity-related problems."]},{"id":"7.CS24.CYB.1","title":"7.CYB.1","text":"The student will differentiate physical and digital security measures that protect electronic information.","grade":"Grade 7","strand":"Cybersecurity","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Compare and contrast physical and digital security measures.","Research and synthesize the tradeoffs between usability and security.","Identify common threats and vulnerabilities associated with Internet use and Internet-based systems.","Identify potential solutions to address common threats and vulnerabilities."]},{"id":"7.CS24.DA.1","title":"7.DA.1","text":"The student will utilize computational tools to visualize and evaluate data to draw conclusions and make predictions.","grade":"Grade 7","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Develop computational models that simulate real-world phenomena, considering relevant variables and relationships.","Refine and modify computational models based on observed data and feedback, ensuring alignment with empirical evidence.","Analyze patterns and trends within observed data, comparing them with the predictions made by computational models.","Evaluate the effectiveness and accuracy of computational models in capturing and explaining the observed data."]},{"id":"7.CS24.DA.2","title":"7.DA.2","text":"The student will explain the process and application of computational thinking in machine learning.","grade":"Grade 7","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Explain how supervised, unsupervised, and/or reinforcement learning methods utilize decomposition, pattern recognition, abstraction, and algorithms to learn from and make decisions.","Explore neural networks and its role in machine learning and artificial intelligence"]},{"id":"7.CS24.IC.1","title":"7.IC.1","text":"The student will assess the national and global impact of computing technologies.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Discuss specific examples of how computing technologies have influenced various national and global industries and sectors.","Analyze the implications of emerging technologies and potential real-world impact nationally and globally.","Evaluate the environmental impact of computing technologies nationally and globally"]},{"id":"7.CS24.IC.2","title":"7.IC.2","text":"The student will describe and explain the impact of screen time on interactions with others","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe the positive and negative impact of social media on socialization.","Research the type of data collected on social media and online platforms that monitor social interactions.","Describe and explain the evolution of screen time and the impact it has had on social interactions.","Create a social media usage plan that demonstrates safe practices, meaningful use, and a balanced approach."]},{"id":"7.CS24.IC.3","title":"7.IC.3","text":"The student will identify individual preferences, skillset, and experiences and determine how these relate to a chosen computer science career field.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Use a career interest assessment to identify and categorize preferences, skillsets, and experiences.","Evaluate and connect personal skillsets, interests, talents, and values to a computer science career."]},{"id":"7.CS24.IC.4","title":"7.IC.4","text":"The student will identify and apply strategies to prevent personal and public works from being pirated and plagiarized.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Discuss and describe intellectual property protections.","Research and list safeguards used to prevent intellectual property infringement."]},{"id":"7.CS24.IC.5","title":"7.IC.5","text":"The student will evaluate the effect of Artificial Intelligence (AI) in various professions.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Research AI integration in various professions and evaluate its impact on the job market and society.","Examine and analyze the impact on job creation and changes in employment needs based on the use of AI.","Evaluate and explain the benefits and drawbacks of the implementation of AI technologies in various professions"]},{"id":"7.CS24.NI.1","title":"7.NI.1","text":"The student will describe and explain why protocols are essential in data transmission.","grade":"Grade 7","strand":"Networking & the Internet","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Define packet, router, and protocol.","Describe the process of sending a file through a network.","Explain the role of Internet Protocol (IP) addresses in transmitting information.","Explain how packets ensure reliable communication among computing devices.","Model how data is transmitted over networks and the Internet."]},{"id":"7.EN.COM.1","title":7.1,"text":"The student will participate in and contribute to small-group activities.","grade":"Grade 7","strand":"Communication","subject":"English","course":"English","subs":["The student will participate in and contribute to conversations, group discussions, and oral presentations.","Communicate ideas and information orally in an organized and succinct manner.","Ask probing questions to seek elaboration and clarification of ideas.","Make statements to communicate agreement or tactful disagreement with others’ ideas.","Use language and style appropriate to audience, topic, and purpose.","Use a variety of strategies to listen actively."]},{"id":"7.EN.COM.2","title":7.2,"text":"The student will identify and demonstrate the relationship between a speaker’s verbal and nonverbal messages.","grade":"Grade 7","strand":"Communication","subject":"English","course":"English","subs":["Use verbal communication skills, such as word choice, pitch, feeling, tone, and voice appropriate for the intended audience.","Use nonverbal communication skills, such as eye contact, posture, and gestures to enhance verbal communication skills.","Compare/contrast a speaker’s verbal and nonverbal messages."]},{"id":"7.EN.COM.3","title":7.3,"text":"The student will understand the elements of media literacy.","grade":"Grade 7","strand":"Communication","subject":"English","course":"English","subs":["Identify persuasive/informative techniques used in nonprint media including television, radio, video, and Internet.","Distinguish between fact and opinion, and between evidence and inference.","Describe how word choice and visual images convey a viewpoint.","Compare and contrast the techniques in auditory, visual, and written media messages.","Craft and publish audience-specific media messages."]},{"id":"7.EN.RD.4","title":7.4,"text":"The student will read to determine the meanings and pronunciations of unfamiliar words and phrases within authentic texts.","grade":"Grade 7","strand":"Reading","subject":"English","course":"English","subs":["Identify word origins and derivations.","Use roots, cognates, affixes, synonyms, and antonyms to expand vocabulary.","Identify and analyze figurative language.","Identify connotations.","Use context and sentence structure to determine meanings and differentiate among multiple meanings of words.","Extend general and specialized vocabulary through speaking, listening, reading, and writing."]},{"id":"7.EN.RD.5","title":7.5,"text":"The student will read and demonstrate comprehension of a variety of fictional texts, narrative nonfiction, and poetry.","grade":"Grade 7","strand":"Reading","subject":"English","course":"English","subs":["Describe the elements of narrative structure including setting, character development, plot structure, theme, and conflict.","Compare and contrast various forms and genres of fictional text.","Identify conventional elements and characteristics of a variety of genres.","Describe the impact of word choice, imagery, and literary devices including figurative language.","Make, confirm, and revise predictions.","Use prior and background knowledge as a context for new learning.","Make inferences and draw conclusions based on the text.","Identify the main idea.","Summarize text relating supporting details.","Identify the author’s organizational pattern.","Identify cause and effect relationships.","Use reading strategies to monitor comprehension throughout the reading process."]},{"id":"7.EN.RD.6","title":7.6,"text":"The student will read and demonstrate comprehension of a variety of nonfiction texts.","grade":"Grade 7","strand":"Reading","subject":"English","course":"English","subs":["Use prior and background knowledge as a context for new learning.","Use text structures to aid comprehension.","Identify an author’s organizational pattern using textual clues, such as transitional words and phrases.","Draw conclusions and make inferences on explicit and implied information.","Differentiate between fact and opinion.","Identify the source, viewpoint, and purpose of texts.","Describe how word choice and language structure convey an author’s viewpoint.","Identify the main idea.","Summarize text identifying supporting details.","Identify cause and effect relationships.","Organize and synthesize information for use in written formats.","Use reading strategies to monitor comprehension throughout the reading process."]},{"id":"7.EN.WR.7","title":7.7,"text":"The student will write in a variety of forms with an emphasis on exposition, narration, and persuasion.","grade":"Grade 7","strand":"Writing","subject":"English","course":"English","subs":["Identify intended audience.","Use a variety of prewriting strategies including graphic organizers to generate and organize ideas.","Organize writing structure to fit mode or topic.","Establish a central idea and organization.","Compose a topic sentence or thesis statement.","Write multiparagraph compositions with unity elaborating the central idea.","Select vocabulary and information to enhance the central idea, tone, and voice.","Expand and embed ideas by using modifiers, standard coordination, and subordination in complete sentences.","Use clauses and phrases for sentence variety.","Revise sentences for clarity of content including specific vocabulary and information.","Use computer technology to plan, draft, revise, edit, and publish writing."]},{"id":"7.EN.WR.8","title":7.8,"text":"The student will edit writing for correct grammar, capitalization, punctuation, spelling, sentence structure, and paragraphing.","grade":"Grade 7","strand":"Writing","subject":"English","course":"English","subs":["Use a variety of graphic organizers, including sentence diagrams, to analyze and improve sentence formation and paragraph structure.","Choose appropriate adjectives and adverbs to enhance writing.","Use pronoun-antecedent agreement to include indefinite pronouns.","Use subject-verb agreement with intervening phrases and clauses.","Edit for verb tense consistency and point of view.","Demonstrate understanding of sentence formation by identifying the eight parts of speech and their functions in sentences.","Use quotation marks with dialogue.","Use correct spelling for commonly used words."]},{"id":"7.EN.RE.9","title":7.9,"text":"The student will apply knowledge of appropriate reference materials to produce a research product.","grade":"Grade 7","strand":"Research","subject":"English","course":"English","subs":["Collect and organize information from multiple sources including online, print and media.","Evaluate the validity and authenticity of sources.","Use technology as a tool to research, organize, evaluate, and communicate information.","Cite primary and secondary sources.","Define the meaning and consequences of plagiarism and follow ethical and legal guidelines for gathering and using information."]},{"id":"7.MT.NS.1","title":7.1,"text":"The student will","grade":"Grade 7","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["investigate and describe the concept of negative exponents for powers of ten;","compare and order numbers greater than zero written in scientific notation;","compare and order rational numbers;","determine square roots of perfect squares; and","identify and describe absolute value of rational numbers."]},{"id":"7.MT.CE.2","title":7.2,"text":"The student will solve practical problems involving operations with rational numbers.","grade":"Grade 7","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.CE.3","title":7.3,"text":"The student will solve single-step and multistep practical problems, using proportional reasoning.","grade":"Grade 7","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.MG.4","title":7.4,"text":"The student will","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["describe and determine the volume and surface area of rectangular prisms and cylinders; and","solve problems, including practical problems, involving the volume and surface area of rectangular prisms and cylinders."]},{"id":"7.MT.MG.5","title":7.5,"text":"The student will solve problems, including practical problems, involving the relationship between corresponding sides and corresponding angles of similar quadrilaterals and triangles.","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.MG.6","title":7.6,"text":"The student will","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["compare and contrast quadrilaterals based on their properties; and","determine unknown side lengths or angle measures of quadrilaterals."]},{"id":"7.MT.MG.7","title":7.7,"text":"The student will apply translations and reflections of right triangles or rectangles in the coordinate plane.","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.PS.8","title":7.8,"text":"The student will","grade":"Grade 7","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["determine the theoretical and experimental probabilities of an event; and","investigate and describe the difference between the experimental probability and theoretical probability of an event."]},{"id":"7.MT.PS.9","title":7.9,"text":"The student, given data in a practical situation, will","grade":"Grade 7","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["represent data in a histogram;","make observations and inferences about data represented in a histogram; and","compare histograms with the same data represented in stem-and-leaf plots, line plots, and circle graphs."]},{"id":"7.MT.PA.10","title":7.1,"text":"The student will","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":["determine the slope, m, as rate of change in a proportional relationship between two quantities and write an equation in the form y = mx to represent the relationship;","graph a line representing a proportional relationship between two quantities given the slope and an ordered pair, or given the equation in y = mx form where m represents the slope as rate of change;","determine the y-intercept, b, in an additive relationship between two quantities and write an equation in the form y = x + b to represent the relationship;","graph a line representing an additive relationship between two quantities given the yintercept and an ordered pair, or given the equation in the form y = x + b, where b represents the y-intercept; and","make connections between and among representations of a proportional or additive relationship between two quantities using verbal descriptions, tables, equations, and graphs."]},{"id":"7.MT.PA.11","title":7.11,"text":"The student will evaluate algebraic expressions for given replacement values of the variables.","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.PA.12","title":7.12,"text":"The student will solve two-step linear equations in one variable, including practical problems that require the solution of a two-step linear equation in one variable.","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.PA.13","title":7.1,"text":"The student will solve one- and two-step linear inequalities in one variable, including practical problems, involving addition, subtraction, multiplication, and division, and graph  the solution on a number line.","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.SEL.SEA.1","title":"SeA1:7-8","text":"Recognize and understand the interaction between one’s own thoughts and emotions. (Critical Thinking)","grade":"Grade 7","strand":"Self-Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning"},{"id":"7.SEL.SEA.2","title":"SeA2:7-8","text":"Develop a positive identity and recognize personal strengths, interests, values, and challenges. (Creative Thinking)","grade":"Grade 7","strand":"Self-Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can analyze how my personal strengths, interests, challenges, and values influence my ability to plan for the future.","I can identify and communicate what motivates me when taking on challenges.","I can identify how my values and experiences influence my own learning.","I can comfortably talk about myself and positively describe my various group identities."]},{"id":"7.SEL.SEM.1","title":"SeM1:7-8","text":"Develop and demonstrate strategies for managing and expressing one's own emotions to persevere in challenging situations. (Communication)","grade":"Grade 7","strand":"Self-Management","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can identify the difference between healthy and unhealthy stress levels.","I can apply coping skills to process thoughts, express my emotions and manage stressful situations.","I can reframe a challenging situation into a positive or learning opportunity for growth."]},{"id":"7.SEL.SEM.2","title":"SeM2:7-8","text":"Demonstrate the skills related to achieving personal and academic goals. (Creative Thinking)  SOCIAL AWARENESS","grade":"Grade 7","strand":"Self-Management","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can evaluate my goals in relation to my previous accomplishments.","I can monitor progress toward a specified goal by developing checkpoints or adjusting the plan as needed.","I can evaluate how my ability to prioritize and manage my time impacts my goal achievement."]},{"id":"7.SEL.SOA.1","title":"SoA1:7-8","text":"Demonstrate the ability to empathize with and show gratitude for others, including those with different and diverse perspectives, abilities, backgrounds, and cultures. (Collaboration)","grade":"Grade 7","strand":"Social Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can accept when the viewpoints or perceptions of others are different from mine.","I can develop an understanding and appreciation of different abilities, backgrounds, cultures and social groups.","I can independently express gratitude in multiple settings."]},{"id":"7.SEL.SOA.2","title":"SoA2:7-8","text":"Demonstrate the ability to understand broader historical and social contexts’ impact on humanity. (Citizenship) RELATIONSHIP SKILLS","grade":"Grade 7","strand":"Social Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can recognize and describe unfairness and injustice in many forms including attitudes, speech, behaviors, policies, practices, and laws.","I can explain the difference between conscious bias and unconscious bias."]},{"id":"7.SEL.RES.1","title":"ReS1:7-8","text":"Apply verbal and non-verbal communication and listening skills to interact with others, form and maintain positive relationships, and resolve conflict constructively. (Communication)","grade":"Grade 7","strand":"Relationship Skills","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can explain how my interactions directly impact my reputation and relationships (including interactions on social and digital media).","I can recognize the non-verbal communication of others to improve my listening skills.","I can outline and practice the use of conflict resolution skills to solve problems peacefully.","I can identify causes that matter to me and how I can advocate or take action for change."]},{"id":"7.SEL.RES.2","title":"ReS2:7-8","text":"Demonstrate the ability to effectively collaborate and navigate relationships while valuing different and diverse perspectives, abilities, backgrounds, and cultures. (Collaboration)","grade":"Grade 7","strand":"Relationship Skills","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can advocate for my role within a group as well as for the inclusion of others.","I can identify a relationship building skill that I would like to improve.","I can identify characteristics of positive and negative relationships.","I can offer and receive constructive feedback."]},{"id":"7.SEL.DEM.1","title":"DeM1:7-8","text":"Demonstrate the ability to evaluate, through reflection, the benefits and consequences of various actions within the decision-making process. (Critical Thinking)","grade":"Grade 7","strand":"Decision Making","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can reflect on lessons learned from actual experiences to inform future practices.","I can demonstrate open-mindedness by evaluating how external factors can impact my decision-making.","I can compare and contrast possible outcomes of my decisions."]},{"id":"7.SEL.DEM.2","title":"DeM2:7-8","text":"Demonstrate the ability to make ethical decisions as a global citizen and evaluate outcomes based on one's own identity and the impact on humanity. (Citizenship)","grade":"Grade 7","strand":"Decision Making","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can evaluate how my membership in multiple groups combine to make me who I am and that none of my individual groups on their own fully defines me.","I can evaluate how my decisions impact myself and others."]},{"id":"7.VA.CP.1","title":7.1,"text":"The student will apply creative thinking to communicate ideas, experiences, and narratives in works of art.","grade":"Grade 7","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.CP.2","title":7.2,"text":"The student will apply steps of a creative process.","grade":"Grade 7","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Use, and record in a digital or traditional sketchbook/journal, steps of the creative process, including research to create works of art.","Use ideas, concepts, and prior knowledge to solve artmaking challenges and create works of art."]},{"id":"7.VA.CC.3","title":7.3,"text":"The student will analyze, interpret, and evaluate artwork.","grade":"Grade 7","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Identify subjects, themes, and symbols as they relate to meaning in works of art.","Compare and contrast the processes artists use to create works of art.","Analyze, interpret, and evaluate works of art, based on personal, cultural, and contextual information.","Evaluate the work of self and others using developed and established criteria."]},{"id":"7.VA.CC.4","title":7.4,"text":"The student will formulate, justify, and examine personal responses to art.","grade":"Grade 7","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Identify ways that social and cultural beliefs can influence responses to works of art.","Describe personal responses to visual qualities of works of art.","Analyze and reflect on the purposes and meaning of art."]},{"id":"7.VA.CC.5","title":7.5,"text":"The student will develop communication and collaboration skills for a community of artists.","grade":"Grade 7","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Contribute to group discussions about visual arts topics.","Describe procedures for the safety and care of art materials and tools."]},{"id":"7.VA.HC.6","title":7.6,"text":"The student will explore and understand historical and cultural influences of art.","grade":"Grade 7","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":["Identify styles and themes in historical and contemporary works of art from a variety of cultures.","Analyze how art and culture influence each other."]},{"id":"7.VA.HC.7","title":7.7,"text":"The student will identify venues for experiencing visual arts in the community and the Commonwealth.","grade":"Grade 7","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.HC.8","title":7.8,"text":"The student will describe and apply digital citizenship skills related to intellectual property in art research, creation, use of source materials, and sharing.","grade":"Grade 7","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.IA.9","title":7.9,"text":"The student will compare and contrast various visual arts careers in relation to career preparation.","grade":"Grade 7","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.IA.10","title":7.1,"text":"The student will investigate and explore a variety of contemporary and digital media tools for following the creative process.","grade":"Grade 7","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.IA.11","title":7.11,"text":"The student will use ideas, concepts, and cross-curricular knowledge to create original works of art.","grade":"Grade 7","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.12","title":7.12,"text":"The student will use elements of art and principles of design to express meaning in works of art:","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Color—harmonious chromatic relationships.","Line—contrast, gradation.","Space—positive, negative.","Emphasis—focal point, dominance.","Proportion—actual, exaggerated."]},{"id":"7.VA.TA.13","title":7.13,"text":"The student will use a variety of compositional techniques, including perspective, to create the illusion of space within the picture plane.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.14","title":7.14,"text":"The student will apply a variety of techniques in observational and expressive drawing.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.15","title":7.15,"text":"The student will refine media techniques to demonstrate developing technical skill.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.16","title":7.16,"text":"The student will create three-dimensional works of art, using various processes to include clay hand-building techniques.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.17","title":7.17,"text":"The student will create and respond to representational and nonrepresentational artwork.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]}]