[{"id":"7.CS.AP.1","title":7.1,"text":"The student will construct programs to accomplish a task as a means of creative expression or scientific exploration using a block based or text based programming language, both independently and collaboratively,","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":["combining control structures such as if-statements and loops including compound conditionals; and","creating clearly named variables that represent different data types, including numeric and non-numeric data, and perform operations on their values."]},{"id":"7.CS.AP.2","title":7.2,"text":"The student will document programs to make them easier to follow, test, and debug.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.AP.3","title":7.3,"text":"The student will distribute tasks and maintain a project timeline when collaboratively developing computational artifacts.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.AP.4","title":7.4,"text":"The student will decompose problems and subproblems into parts to facilitate the design, implementation, and review of programs.","grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.SYS.5","title":7.5,"text":"The student will describe how the Internet connects devices and networks all over the world. Exclusion: Specific devices used to implement the Internet are beyond the scope of these standards.","grade":"Grade 7","strand":"Computing Systems","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.CY.6","title":7.6,"text":"The student will describe how physical and digital security measures protect electronic information.","grade":"Grade 7","strand":"Cybersecurity","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.CY.7","title":7.7,"text":"The student will identify existing cybersecurity concerns associated with Internet use and Internet-based systems and potential options to address these issues.","grade":"Grade 7","strand":"Cybersecurity","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.DA.8","title":7.8,"text":"The student will discuss the correctness of a model representing a system by comparing the model’s generated results with data that were observed in the system being modeled.","grade":"Grade 7","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.DA.9","title":7.9,"text":"The student will refine computational models based on the data they have generated.","grade":"Grade 7","strand":"Data & Analysis","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.IC.10","title":7.1,"text":"The student will explain how advances in technology have contributed to Virginia’s prosperity and role in the global economy.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.IC.11","title":7.11,"text":"The student will describe the development of new technologies in communication, entertainment, and business and their impact on American life.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.IC.12","title":7.12,"text":"The student will explore careers related to the Internet.","grade":"Grade 7","strand":"Impacts of Computing","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.NI.13","title":7.13,"text":"The student will outline the advantages and disadvantages of transmitting information over the Internet, including speed, reliability, cost, and security.","grade":"Grade 7","strand":"Networking & the Internet","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.NI.14","title":7.14,"text":"The student will explain why protocols are necessary in data transmission. Model the role of protocols in transmitting data across networks and the Internet.","grade":"Grade 7","strand":"Networking & the Internet","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.NI.15","title":7.15,"text":"The student will model how information is broken down into smaller pieces, transmitted as packets through multiple devices over networks and the Internet, and reassembled at the destination.","grade":"Grade 7","strand":"Networking & the Internet","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.CS.AP.7","title":7.7,"text":null,"grade":"Grade 7","strand":"Algorithms & Programming","subject":"Computer Science","course":"Computer Science","subs":[]},{"id":"7.MT.NS.1","title":7.1,"text":"The student will","grade":"Grade 7","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["investigate and describe the concept of negative exponents for powers of ten;","compare and order numbers greater than zero written in scientific notation;","compare and order rational numbers;","determine square roots of perfect squares; and","identify and describe absolute value of rational numbers."]},{"id":"7.MT.CE.2","title":7.2,"text":"The student will solve practical problems involving operations with rational numbers.","grade":"Grade 7","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.CE.3","title":7.3,"text":"The student will solve single-step and multistep practical problems, using proportional reasoning.","grade":"Grade 7","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.MG.4","title":7.4,"text":"The student will","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["describe and determine the volume and surface area of rectangular prisms and cylinders; and","solve problems, including practical problems, involving the volume and surface area of rectangular prisms and cylinders."]},{"id":"7.MT.MG.5","title":7.5,"text":"The student will solve problems, including practical problems, involving the relationship between corresponding sides and corresponding angles of similar quadrilaterals and triangles.","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.MG.6","title":7.6,"text":"The student will","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["compare and contrast quadrilaterals based on their properties; and","determine unknown side lengths or angle measures of quadrilaterals."]},{"id":"7.MT.MG.7","title":7.7,"text":"The student will apply translations and reflections of right triangles or rectangles in the coordinate plane.","grade":"Grade 7","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.PS.8","title":7.8,"text":"The student will","grade":"Grade 7","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["determine the theoretical and experimental probabilities of an event; and","investigate and describe the difference between the experimental probability and theoretical probability of an event."]},{"id":"7.MT.PS.9","title":7.9,"text":"The student, given data in a practical situation, will","grade":"Grade 7","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["represent data in a histogram;","make observations and inferences about data represented in a histogram; and","compare histograms with the same data represented in stem-and-leaf plots, line plots, and circle graphs."]},{"id":"7.MT.PA.10","title":7.1,"text":"The student will","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":["determine the slope, m, as rate of change in a proportional relationship between two quantities and write an equation in the form y = mx to represent the relationship;","graph a line representing a proportional relationship between two quantities given the slope and an ordered pair, or given the equation in y = mx form where m represents the slope as rate of change;","determine the y-intercept, b, in an additive relationship between two quantities and write an equation in the form y = x + b to represent the relationship;","graph a line representing an additive relationship between two quantities given the yintercept and an ordered pair, or given the equation in the form y = x + b, where b represents the y-intercept; and","make connections between and among representations of a proportional or additive relationship between two quantities using verbal descriptions, tables, equations, and graphs."]},{"id":"7.MT.PA.11","title":7.11,"text":"The student will evaluate algebraic expressions for given replacement values of the variables.","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.PA.12","title":7.12,"text":"The student will solve two-step linear equations in one variable, including practical problems that require the solution of a two-step linear equation in one variable.","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.MT.PA.13","title":7.1,"text":"The student will solve one- and two-step linear inequalities in one variable, including practical problems, involving addition, subtraction, multiplication, and division, and graph  the solution on a number line.","grade":"Grade 7","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"7.VA.CP.1","title":7.1,"text":"The student will apply creative thinking to communicate ideas, experiences, and narratives in works of art.","grade":"Grade 7","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.CP.2","title":7.2,"text":"The student will apply steps of a creative process.","grade":"Grade 7","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Use, and record in a digital or traditional sketchbook/journal, steps of the creative process, including research to create works of art.","Use ideas, concepts, and prior knowledge to solve artmaking challenges and create works of art."]},{"id":"7.VA.CC.3","title":7.3,"text":"The student will analyze, interpret, and evaluate artwork.","grade":"Grade 7","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Identify subjects, themes, and symbols as they relate to meaning in works of art.","Compare and contrast the processes artists use to create works of art.","Analyze, interpret, and evaluate works of art, based on personal, cultural, and contextual information.","Evaluate the work of self and others using developed and established criteria."]},{"id":"7.VA.CC.4","title":7.4,"text":"The student will formulate, justify, and examine personal responses to art.","grade":"Grade 7","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Identify ways that social and cultural beliefs can influence responses to works of art.","Describe personal responses to visual qualities of works of art.","Analyze and reflect on the purposes and meaning of art."]},{"id":"7.VA.CC.5","title":7.5,"text":"The student will develop communication and collaboration skills for a community of artists.","grade":"Grade 7","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Contribute to group discussions about visual arts topics.","Describe procedures for the safety and care of art materials and tools."]},{"id":"7.VA.HC.6","title":7.6,"text":"The student will explore and understand historical and cultural influences of art.","grade":"Grade 7","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":["Identify styles and themes in historical and contemporary works of art from a variety of cultures.","Analyze how art and culture influence each other."]},{"id":"7.VA.HC.7","title":7.7,"text":"The student will identify venues for experiencing visual arts in the community and the Commonwealth.","grade":"Grade 7","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.HC.8","title":7.8,"text":"The student will describe and apply digital citizenship skills related to intellectual property in art research, creation, use of source materials, and sharing.","grade":"Grade 7","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.IA.9","title":7.9,"text":"The student will compare and contrast various visual arts careers in relation to career preparation.","grade":"Grade 7","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.IA.10","title":7.1,"text":"The student will investigate and explore a variety of contemporary and digital media tools for following the creative process.","grade":"Grade 7","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.IA.11","title":7.11,"text":"The student will use ideas, concepts, and cross-curricular knowledge to create original works of art.","grade":"Grade 7","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.12","title":7.12,"text":"The student will use elements of art and principles of design to express meaning in works of art:","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Color—harmonious chromatic relationships.","Line—contrast, gradation.","Space—positive, negative.","Emphasis—focal point, dominance.","Proportion—actual, exaggerated."]},{"id":"7.VA.TA.13","title":7.13,"text":"The student will use a variety of compositional techniques, including perspective, to create the illusion of space within the picture plane.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.14","title":7.14,"text":"The student will apply a variety of techniques in observational and expressive drawing.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.15","title":7.15,"text":"The student will refine media techniques to demonstrate developing technical skill.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.16","title":7.16,"text":"The student will create three-dimensional works of art, using various processes to include clay hand-building techniques.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"7.VA.TA.17","title":7.17,"text":"The student will create and respond to representational and nonrepresentational artwork.","grade":"Grade 7","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]}]