[{"id":"8.CS24.AP.1","title":"8.AP.1","text":"The student will apply computational thinking to construct programs to accomplish a task as a means of creative expression or scientific exploration.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify patterns and repeated steps in an algorithm, problem, or process.","Decompose an algorithm, problem, or process into sub-components.","Abstract relevant information to identify essential details.","Use pseudocode, decision trees, or flowcharts to illustrate complex problems as algorithms."]},{"id":"8.CS24.AP.2","title":"8.AP.2","text":"The student will plan and implement algorithms that include sequencing, loops, variables, user input, conditional control structures, functions, and various data types.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe the concept of input and output of various data types for use in a computer program.","Plan an algorithm using plain language, pseudocode, or diagrams.","Write and test algorithms expressed using block-based or text-based programming languages."]},{"id":"8.CS24.AP.3","title":"8.AP.3","text":"The student will use the iterative design process to create, test, and debug programs using a block-based or text-based programming language.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create and test programs that contain multiple control structures.","Trace and predict outcomes of programs.","Analyze the outcomes of programs to identify logic and syntax errors.","Analyze and describe the results of a program to assess validity of outcomes.","Revise and improve an algorithm to resolve errors or produce desired outcomes."]},{"id":"8.CS24.AP.4","title":"8.AP.4","text":"The student will incorporate work from others into programs and projects.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Explain the role of Creative Commons licensing for the use and modification or \"remixing\" of information.","Utilize Creative Commons assets in a programming project.","Use and remix code from other projects within a programming project and provide proper attribution."]}]