[{"id":"8.CS.AP.1","title":8.1,"text":"The student will construct programs to accomplish a task as a means of creative expression or scientific exploration using a block based or text based programming language, both independently and collaboratively,","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":["combining control structures such as if-statements and loops including nested conditionals and loops;","using clearly named variables that represent different data types, including numeric and non-numeric data, and perform operations on their values; and","create procedures with parameters"]},{"id":"8.CS.AP.2","title":8.2,"text":"The student will systematically test and refine programs using a range of test cases.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS.AP.3","title":8.3,"text":"The student will explain how effective communication between participants is required for successful collaboration when developing programs.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS.AP.4","title":8.4,"text":"The student will use flowcharts and/or pseudocode to address complex problems as algorithms.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS.SYS.5","title":8.5,"text":"The student will, using the elements of computing devices such as primary memory, secondary storage, processor, input and output devices, and network connectivity, analyze the advantages and limitations of a given computing system.","grade":"Grade 8","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS.CY.6","title":8.6,"text":"The student will evaluate physical and digital security measures used to protect electronic information.","grade":"Grade 8","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS.CY.7","title":8.7,"text":"The student will identify impacts of hacking, ransomware, scams, fake vulnerability scans, and the ethical and legal concerns involved. Exclusion: Students do not need to implement solutions.","grade":"Grade 8","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS.DA.8","title":8.8,"text":"The student will","grade":"Grade 8","strand":"Data & Analysis","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":["explain the difference between a model and a simulation; and","create computational models to conduct simulations."]},{"id":"8.CS.IC.9","title":8.9,"text":"The student will describe tradeoffs between allowing information to be public and\\ keeping information private.","grade":"Grade 8","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS.IC.10","title":8.1,"text":"The student will evaluate online and print sources for appropriateness and credibility.","grade":"Grade 8","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS.IC.11","title":8.11,"text":"The student will discuss the social impacts and ethical considerations associated with the field of cybersecurity.","grade":"Grade 8","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS.IC.12","title":8.12,"text":"The student will explore careers related to the field of cybersecurity.","grade":"Grade 8","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS.NI.13","title":8.13,"text":"The student will identify existing cybersecurity concerns associated with Internet use and Internet-based systems and potential options to address these issues.","grade":"Grade 8","strand":"Networking & the Internet","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"8.CS24.AP.1","title":"8.AP.1","text":"The student will apply computational thinking to construct programs to accomplish a task as a means of creative expression or scientific exploration.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify patterns and repeated steps in an algorithm, problem, or process.","Decompose an algorithm, problem, or process into sub-components.","Abstract relevant information to identify essential details.","Use pseudocode, decision trees, or flowcharts to illustrate complex problems as algorithms."]},{"id":"8.CS24.AP.2","title":"8.AP.2","text":"The student will plan and implement algorithms that include sequencing, loops, variables, user input, conditional control structures, functions, and various data types.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe the concept of input and output of various data types for use in a computer program.","Plan an algorithm using plain language, pseudocode, or diagrams.","Write and test algorithms expressed using block-based or text-based programming languages."]},{"id":"8.CS24.AP.3","title":"8.AP.3","text":"The student will use the iterative design process to create, test, and debug programs using a block-based or text-based programming language.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create and test programs that contain multiple control structures.","Trace and predict outcomes of programs.","Analyze the outcomes of programs to identify logic and syntax errors.","Analyze and describe the results of a program to assess validity of outcomes.","Revise and improve an algorithm to resolve errors or produce desired outcomes."]},{"id":"8.CS24.AP.4","title":"8.AP.4","text":"The student will incorporate work from others into programs and projects.","grade":"Grade 8","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Explain the role of Creative Commons licensing for the use and modification or \"remixing\" of information.","Utilize Creative Commons assets in a programming project.","Use and remix code from other projects within a programming project and provide proper attribution."]},{"id":"8.CS24.CSY.1","title":"8.CSY.1","text":"The student will recommend and design improvements to computing devices based on the needs of various users.","grade":"Grade 8","strand":"Computing Systems","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Analyze existing computing devices for advantages and limitations.","Recommend and design improvements to computing devices based on user interactions."]},{"id":"8.CS24.CSY.2","title":"8.CSY.2","text":"The student will apply computational thinking to troubleshoot and document hardware and software-related problems.","grade":"Grade 8","strand":"Computing Systems","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Apply systematic processes to resolve hardware, software, and connectivityrelated problems.","Design an end-user document/guide to resolve hardware, software, and connectivity-related problems."]},{"id":"8.CS24.CYB.1","title":"8.CYB.1","text":"The student will investigate and describe ways to protect sensitive data from malware and other attacks.","grade":"Grade 8","strand":"Cybersecurity","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify impacts of hacking, ransomware, scams, phishing, fake vulnerability scans and the ethical and legal concerns.","Describe how cyber-attacks can affect a computing system.","Compare and contrast safe and unsafe computing practices.","Explore how industries and emerging technologies are addressing cyber solutions.","Model common prevention practices for cyber-attacks."]},{"id":"8.CS24.CYB.2","title":"8.CYB.2","text":"The student will investigate and explain how physical and digital security measures can protect electronic information for businesses, governments, and organizations.","grade":"Grade 8","strand":"Cybersecurity","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Investigate and explain how physical and digital security measures are used to safeguard electronic information.","Research the advantages and limitations of different security measures in protecting users against security threats."]},{"id":"8.CS24.DA.1","title":"8.DA.1","text":"The student will create computational models to simulate events or represent phenomena.","grade":"Grade 8","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Compare and contrast the use of computational models and simulations to analyze patterns and replicate phenomena.","Design and create complex computational models that simulate dynamic systems (abstraction), incorporating multiple variables and interactions.","Refine computational models based on generated outcomes."]},{"id":"8.CS24.DA.2","title":"8.DA.2","text":"The student will evaluate computational models to analyze patterns and make recommendations or predictions.","grade":"Grade 8","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Define data biases within a dataset and the unintended consequences that may impact data reliability and final analysis.","Analyze patterns and interpret data generated by computational models and simulations, identifying meaningful patterns and relationships.","Utilize data visualization techniques to communicate and present findings derived from computational models and simulations."]},{"id":"8.CS24.IC.1","title":"8.IC.1","text":"The student will assess the social impacts and ethical considerations of computing technologies.","grade":"Grade 8","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Analyze the impact of sharing data through computing technologies.","Critique the role the Internet plays in social life, the global economy, and culture.","Evaluate online and print sources for credibility and reliability.","Research and discuss factors that impact access and availability to computing technologies.","Discuss ethical issues around cybersecurity and networks: censorship, privacy, safety, and access."]},{"id":"8.CS24.IC.2","title":"8.IC.2","text":"The student will analyze and evaluate the ramifications of screen time in one's life.","grade":"Grade 8","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Analyze scenarios or case studies to assess the impact of screen time on one's physical and mental health.","Justify the argument that excessive screen time and video games can have significant consequences for the physical, emotional, and cognitive development of children and adolescents."]},{"id":"8.CS24.IC.3","title":"8.IC.3","text":"The student will identify opportunities for education, training, and preparation to enter into a chosen computer science career field.","grade":"Grade 8","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify an education and training plan for a chosen computer science career.","Outline the use of computer science skills required in a chosen career.","Develop short-and long-term goals for a chosen career.","Research emerging trends in a chosen career path."]},{"id":"8.CS24.NI.1","title":"8.NI.1","text":"The student will model and describe the role of computing devices in transmitting data in and on computing networks and the Internet.","grade":"Grade 8","strand":"Networking & the Internet","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify the roles of computing devices: routers, switches, servers, and clients communicating over a network.","Design a network topology of computing devices.","Demonstrate how data is transmitted over networks and the Internet.","Analyze factors that strengthen or weaken network connectivity."]},{"id":"8.EN.COM.1","title":8.1,"text":"The student will use interviewing techniques to gain information.","grade":"Grade 8","strand":"Communication","subject":"English","course":"English","subs":["Prepare and ask relevant questions for the interview.","Make notes of responses.","Compile, accurately report, and publish responses.","Evaluate the effectiveness of the interview."]},{"id":"8.EN.COM.2","title":8.2,"text":"The student will develop and deliver oral presentations in groups and individually.","grade":"Grade 8","strand":"Communication","subject":"English","course":"English","subs":["Choose topic and purpose appropriate to the audience.","Choose vocabulary and tone appropriate to the audience, topic, and purpose.","Use appropriate verbal and nonverbal presentation skills.","Respond to audience questions and comments.","Differentiate between standard English and informal language.","Critique oral presentations.","Assume shared responsibility for collaborative work.","Use a variety of strategies to listen actively."]},{"id":"8.EN.COM.3","title":8.3,"text":"The student will analyze, develop, and produce creative or informational media messages.","grade":"Grade 8","strand":"Communication","subject":"English","course":"English","subs":["Evaluate the persuasive/informational technique being used in nonprint media including television, radio, video, and Internet.","Examine how values and viewpoints are included or excluded and how the media can influence beliefs, behaviors, and interpretations.","Use media and visual literacy skills to create products that express new understandings.","Evaluate sources for relationships between intent and factual content."]},{"id":"8.EN.RD.4","title":8.4,"text":"The student will apply knowledge of word origins, analogies, and figurative language to extend vocabulary development within authentic texts.","grade":"Grade 8","strand":"Reading","subject":"English","course":"English","subs":["Identify and analyze an author’s use of figurative language.","Use context, structure, and connotations to determine meaning and differentiate among multiple meanings of words and phrases.","Use roots, affixes, cognates, synonyms, and antonyms to determine the meaning of unfamiliar words and technical vocabulary.","Use dictionaries, thesauruses, and glossaries to determine definition, pronunciation, etymology, spelling, and usage of words.","Discriminate between connotative and denotative meanings and interpret the connotation.","Extend general and specialized vocabulary through speaking, listening, reading, and writing."]},{"id":"8.EN.RD.5","title":8.5,"text":"The student will read and analyze a variety of fictional texts, narrative nonfiction, and poetry.","grade":"Grade 8","strand":"Reading","subject":"English","course":"English","subs":["Explain the use of symbols and figurative language.","Make inferences and draw conclusions based on explicit and implied information using evidence from text as support.","Explain how authors use characters, conflict, point of view, voice, and tone to create meaning.","Understand the author’s use of conventional elements and characteristics within a variety of genres.","Compare and contrast the author’s use of word choice, dialogue, form, rhyme, rhythm, and voice in different texts.","Compare and contrast authors’ styles.","Identify and ask questions that clarify various viewpoints.","Identify the main idea.","Summarize text relating supporting details.","Identify an author’s organizational pattern using textual clues, such as transitional words and phrases.","Identify cause and effect relationships.","Use prior and background knowledge as a context for new learning.","Use reading strategies to monitor comprehension throughout the reading process."]},{"id":"8.EN.RD.6","title":8.6,"text":"The student will read, comprehend, and analyze a variety of nonfiction texts.","grade":"Grade 8","strand":"Reading","subject":"English","course":"English","subs":["Draw on background knowledge and knowledge of text structure to understand selections.","Make inferences and draw conclusions based on explicit and implied information using evidence from text as support.","Analyze the author’s qualifications, viewpoint, and impact.","Analyze the author’s use of text structure and word choice.","Analyze details for relevance and accuracy.","Differentiate between fact and opinion.","Identify the main idea.","Summarize the text identifying supporting details.","Identify an author’s organizational pattern using textual clues, such as transitional words and phrases.","Identify cause and effect relationships.","Evaluate, organize, and synthesize information for use in written and oral formats.","Use reading strategies to monitor comprehension throughout the reading process."]},{"id":"8.EN.WR.7","title":8.7,"text":"The student will write in a variety of forms, including narration, exposition, persuasion, and informational.","grade":"Grade 8","strand":"Writing","subject":"English","course":"English","subs":["Identify intended audience.","Use prewriting strategies to generate and organize ideas.","Distinguish between a thesis statement and a topic sentence.","Organize details to elaborate the central idea and provide unity.","Select specific vocabulary and information for audience and purpose.","Use interview quotations as evidence.","Revise writing for clarity of content, word choice, sentence variety, and transitions among paragraphs.","Use computer technology to plan, draft, revise, edit, and publish writing."]},{"id":"8.EN.WR.8","title":8.8,"text":"The student will edit writing for correct grammar, capitalization, punctuation, spelling, sentence structure, and paragraphing.","grade":"Grade 8","strand":"Writing","subject":"English","course":"English","subs":["Use a variety of graphic organizers, including sentence diagrams, to analyze and improve sentence formation and paragraph structure.","Use and punctuate correctly varied sentence structures to include conjunctions and transition words.","Choose the correct case and number for pronouns in prepositional phrases with compound objects.","Maintain consistent verb tense across paragraphs.","Use comparative and superlative degrees in adverbs and adjectives.","Use quotation marks with dialogue and direct quotations.","Use correct spelling for frequently used words."]},{"id":"8.EN.RE.9","title":8.9,"text":"The student will apply knowledge of appropriate reference materials to produce a research product.","grade":"Grade 8","strand":"Research","subject":"English","course":"English","subs":["Collect and synthesize information from multiple sources including online, print and media.","Evaluate the validity and authenticity of texts.","Use technology as a tool to research, organize, evaluate, and communicate information.","Make sense of information gathered from diverse sources by identifying misconceptions, main and supporting ideas, conflicting information, point of view or bias.","Cite primary and secondary sources using Modern Language Association (MLA) or American Psychological Association (APA) style.","Publish findings and respond to feedback.","Define the meaning and consequences of plagiarism and follow ethical and legal guidelines for gathering and using information."]},{"id":"8.MT.NS.1","title":8.1,"text":"The student will compare and order real numbers.","grade":"Grade 8","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"8.MT.NS.2","title":8.2,"text":"The student will describe the relationships between the subsets of the real number system.","grade":"Grade 8","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"8.MT.NS.3","title":8.3,"text":"The student will","grade":"Grade 8","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["estimate and determine the two consecutive integers between which a square root lies; and","determine both the positive and negative square roots of a given perfect square."]},{"id":"8.MT.CE.4","title":8.4,"text":"The student will solve practical problems involving consumer applications.","grade":"Grade 8","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"8.MT.MG.5","title":8.5,"text":"The student will use the relationships among pairs of angles that are vertical angles, adjacent angles, supplementary angles, and complementary angles to determine the measure of unknown angles.","grade":"Grade 8","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"8.MT.MG.6","title":8.6,"text":"The student will","grade":"Grade 8","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["solve problems, including practical problems, involving volume and surface area ofcones and square-based pyramids; and","describe how changing one measured attribute of a rectangular prism affects the volume and surface area."]},{"id":"8.MT.MG.7","title":8.7,"text":"The student will","grade":"Grade 8","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["given a polygon, apply transformations, to include translations, reflections, and dilations, in the coordinate plane; and","identify practical applications of transformations."]},{"id":"8.MT.MG.8","title":8.2,"text":"The student will construct a three-dimensional model, given the top or bottom, side, and front views.","grade":"Grade 8","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"8.MT.MG.9","title":8.9,"text":"The student will","grade":"Grade 8","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["verify the Pythagorean Theorem; and","apply the Pythagorean Theorem."]},{"id":"8.MT.MG.10","title":8.1,"text":"The student will solve area and perimeter problems, including practical problems, involving composite plane figures.","grade":"Grade 8","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"8.MT.PS.11","title":8.11,"text":"The student will","grade":"Grade 8","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["compare and contrast the probability of independent and dependent events; and","determine probabilities for independent and dependent events."]},{"id":"8.MT.PS.12","title":8.12,"text":"The student will","grade":"Grade 8","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["represent numerical data in boxplots;","make observations and inferences about data represented in boxplots; and","compare and analyze two data sets using boxplots."]},{"id":"8.MT.PS.13","title":8.13,"text":"The student will","grade":"Grade 8","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["represent data in scatterplots;","make observations about data represented in scatterplots; and","use a drawing to estimate the line of best fit for data represented in a scatterplot."]},{"id":"8.MT.PA.14","title":8.14,"text":"The student will","grade":"Grade 8","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":["evaluate an algebraic expression for given replacement values of the variables; and","simplify algebraic expressions in one variable."]},{"id":"8.MT.PA.15","title":8.15,"text":"The student will","grade":"Grade 8","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":["determine whether a given relation is a function; and","determine the domain and range of a function."]},{"id":"8.MT.PA.16","title":8.16,"text":"The student will","grade":"Grade 8","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":["recognize and describe the graph of a linear function with a slope that is positive, negative, or zero;","identify the slope and y-intercept of a linear function, given a table of values, a graph, or an equation in y = mx + b form;","determine the independent and dependent variable, given a practical situation modeled by a linear function;","graph a linear function given the equation in y = mx + b form; and","make connections between and among representations of a linear function using verbal descriptions, tables, equations, and graphs."]},{"id":"8.MT.PA.17","title":8.17,"text":"The student will solve multistep linear equations in one variable with the variable on one or both sides of the equation, including practical problems that require the solution of a multistep linear equation in one variable.","grade":"Grade 8","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"8.MT.PA.18","title":8.18,"text":"The student will solve multistep linear inequalities in one variable with the variable on one or both sides of the inequality symbol, including practical problems, and graph the solution on a number line.","grade":"Grade 8","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"8.SEL.SEA.1","title":"SeA1:7-8","text":"Recognize and understand the interaction between one’s own thoughts and emotions. (Critical Thinking)","grade":"Grade 8","strand":"Self-Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning"},{"id":"8.SEL.SEA.2","title":"SeA2:7-8","text":"Develop a positive identity and recognize personal strengths, interests, values, and challenges. (Creative Thinking)","grade":"Grade 8","strand":"Self-Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can analyze how my personal strengths, interests, challenges, and values influence my ability to plan for the future.","I can identify and communicate what motivates me when taking on challenges.","I can identify how my values and experiences influence my own learning.","I can comfortably talk about myself and positively describe my various group identities."]},{"id":"8.SEL.SEM.1","title":"SeM1:7-8","text":"Develop and demonstrate strategies for managing and expressing one's own emotions to persevere in challenging situations. (Communication)","grade":"Grade 8","strand":"Self-Management","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can identify the difference between healthy and unhealthy stress levels.","I can apply coping skills to process thoughts, express my emotions and manage stressful situations.","I can reframe a challenging situation into a positive or learning opportunity for growth."]},{"id":"8.SEL.SEM.2","title":"SeM2:7-8","text":"Demonstrate the skills related to achieving personal and academic goals. (Creative Thinking)  SOCIAL AWARENESS","grade":"Grade 8","strand":"Self-Management","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can evaluate my goals in relation to my previous accomplishments.","I can monitor progress toward a specified goal by developing checkpoints or adjusting the plan as needed.","I can evaluate how my ability to prioritize and manage my time impacts my goal achievement."]},{"id":"8.SEL.SOA.1","title":"SoA1:7-8","text":"Demonstrate the ability to empathize with and show gratitude for others, including those with different and diverse perspectives, abilities, backgrounds, and cultures. (Collaboration)","grade":"Grade 8","strand":"Social Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can accept when the viewpoints or perceptions of others are different from mine.","I can develop an understanding and appreciation of different abilities, backgrounds, cultures and social groups.","I can independently express gratitude in multiple settings."]},{"id":"8.SEL.SOA.2","title":"SoA2:7-8","text":"Demonstrate the ability to understand broader historical and social contexts’ impact on humanity. (Citizenship) RELATIONSHIP SKILLS","grade":"Grade 8","strand":"Social Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can recognize and describe unfairness and injustice in many forms including attitudes, speech, behaviors, policies, practices, and laws.","I can explain the difference between conscious bias and unconscious bias."]},{"id":"8.SEL.RES.1","title":"ReS1:7-8","text":"Apply verbal and non-verbal communication and listening skills to interact with others, form and maintain positive relationships, and resolve conflict constructively. (Communication)","grade":"Grade 8","strand":"Relationship Skills","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can explain how my interactions directly impact my reputation and relationships (including interactions on social and digital media).","I can recognize the non-verbal communication of others to improve my listening skills.","I can outline and practice the use of conflict resolution skills to solve problems peacefully.","I can identify causes that matter to me and how I can advocate or take action for change."]},{"id":"8.SEL.RES.2","title":"ReS2:7-8","text":"Demonstrate the ability to effectively collaborate and navigate relationships while valuing different and diverse perspectives, abilities, backgrounds, and cultures. (Collaboration)","grade":"Grade 8","strand":"Relationship Skills","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can advocate for my role within a group as well as for the inclusion of others.","I can identify a relationship building skill that I would like to improve.","I can identify characteristics of positive and negative relationships.","I can offer and receive constructive feedback."]},{"id":"8.SEL.DEM.1","title":"DeM1:7-8","text":"Demonstrate the ability to evaluate, through reflection, the benefits and consequences of various actions within the decision-making process. (Critical Thinking)","grade":"Grade 8","strand":"Decision Making","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can reflect on lessons learned from actual experiences to inform future practices.","I can demonstrate open-mindedness by evaluating how external factors can impact my decision-making.","I can compare and contrast possible outcomes of my decisions."]},{"id":"8.SEL.DEM.2","title":"DeM2:7-8","text":"Demonstrate the ability to make ethical decisions as a global citizen and evaluate outcomes based on one's own identity and the impact on humanity. (Citizenship)","grade":"Grade 8","strand":"Decision Making","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can evaluate how my membership in multiple groups combine to make me who I am and that none of my individual groups on their own fully defines me.","I can evaluate how my decisions impact myself and others."]},{"id":"8.VA.CP.1","title":8.1,"text":"The student will apply creative thinking to artmaking.","grade":"Grade 8","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Communicate ideas, experiences, and narratives through the creation of original works of art, using self-selected media.","Synthesize prior knowledge and experience to develop a personal investigation by creating a series of works of art."]},{"id":"8.VA.CP.2","title":8.2,"text":"The student will apply steps of a creative process.","grade":"Grade 8","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Plan for and reflect on the creative process, using a digital or traditional sketchbook/journal.","Develop and use a digital or traditional art portfolio as an idea-building resource to create works of art."]},{"id":"8.VA.CC.3","title":8.3,"text":"The student will analyze, interpret, and evaluate artwork.","grade":"Grade 8","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Analyze how visual organization in works of art affects the communication of ideas.","Analyze the uses and impact of persuasive techniques (e.g., selection of images, design, type, media) in print and contemporary media.","Communicate how personal experiences influence critical interpretations and evaluations of works of art.","Formulate a working definition of art.","Analyze purposes, values, and meanings of works of art.","Critique personal work and the work of others to refine the quality of technical skill and communication of creative intent."]},{"id":"8.VA.CC.4","title":8.4,"text":"The student will describe and justify personal responses to visual qualities in works of art.","grade":"Grade 8","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.VA.CC.5","title":8.5,"text":"The student will develop communication and collaboration skills for a community of artists.","grade":"Grade 8","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Develop visual art topics for group discussions.","Recognize a variety of contributions to the class community.","Explain procedures for the safety and care of art materials and tools."]},{"id":"8.VA.HC.6","title":8.6,"text":"The student will explore and understand historical and cultural influences of art.","grade":"Grade 8","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":["Describe how works of art are influenced by social, political, and economic factors.","Describe how society, politics, and economics may be influenced by art.","Compare and contrast works of art according to medium, time period, culture, style, and artist.","Identify contributions and significance of artists in historical and contemporay societies"]},{"id":"8.VA.HC.7","title":8.7,"text":"The student will identify visual art resources in the community and the Commonwealth, including but not limited to community art centers, museums, and galleries.","grade":"Grade 8","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.VA.HC.8","title":8.8,"text":"The student will explain and apply digital citizenship skills related to intellectual property in art research, creation, use of source materials, and sharing","grade":"Grade 8","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.VA.IA.9","title":8.9,"text":"The student will investigate connections between visual arts skills and college, career, and workplace skills.","grade":"Grade 8","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.VA.IA.10","title":8.1,"text":"The student will explore digital media for creating and engaging others through their artwork.","grade":"Grade 8","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.VA.IA.11","title":8.11,"text":"The student will synthesize knowledge from other content areas to connect to visual arts knowledge and processes in order develop solutions to solve a real-world problem","grade":"Grade 8","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.VA.TA.12","title":8.12,"text":"The student will use elements of art and principles of design to express meaning in works of art.","grade":"Grade 8","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Color—contrasting relationships.","Value—shading.","Proportion—scale, ratio relationships.","Unity—harmony.","Variety."]},{"id":"8.VA.TA.13","title":8.13,"text":"The student will combine a variety of compositional techniques to create the illusion of space within the picture plane.","grade":"Grade 8","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.VA.TA.14","title":8.14,"text":"The student will use observational and expressive drawing techniques to demonstrate multiple viewpoints (e.g., above, below, front, back).","grade":"Grade 8","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.VA.TA.15","title":8.15,"text":"The student will refine personal works of art to improve quality of craftsmanship.","grade":"Grade 8","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.VA.TA.16","title":8.16,"text":"The student will create three-dimensional works of art by combining a variety of techniques and processes.","grade":"Grade 8","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.VA.TA.17","title":8.17,"text":"The student will explore abstraction of subject matter.","grade":"Grade 8","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"8.WG.SK.0","title":"Skills WG","text":"The student will demonstrate skills for historical thinking, geographical analysis, economic decision making, and responsible citizenship by","grade":"Grade 8","strand":"Skills","subject":"World Geography","course":"World Geography","subs":["selecting and synthesizing evidence from information sources, including, but not limited to artifacts, primary and secondary sources, charts, graphs, diagrams, and geospatial technologies, including maps, GIS, and GPS imagery, to understand the regions of the world;","applying geographic skills to determine and predict patterns and movement of people, places, and events;","developing questions, enhancing curiosity, and engaging in critical thinking and analysis;","investigating and analyzing evidence from multiple sources to construct arguments;","comparing and contrasting historical, cultural, economic, and political perspectives;","determining and explaining cause-and-effect relationships;","using economic decision-making models to analyze and explain the incentives for and consequences of a specific choice;","engaging and communicating as a civil and informed individual with persons with different perspectives;","developing products that reflect an understanding of research, content, and world geography concepts; and","contextualizing, corroborating, and evaluating sources for credibility, propaganda, and bias to determine patterns and trends to understand the world."]},{"id":"8.WG.ING.1","title":"WG.1","text":"The student will apply history and social science skills to explain how geographic information and geospatial tools are used to make decisions by","grade":"Grade 8","strand":"Introduction to Geography","subject":"World Geography","course":"World Geography","subs":["explaining how characteristics of regions have led to regional labels;","describing how regional landscapes reflect the physical environment and the cultural characteristics of their inhabitants;","analyzing how cultural characteristics, including the world’s major languages, ethnicities, and religions, link or divide regions; and","explaining how cartography is used to reflect regional perspectives, point of view, and perceptions of an area and the creation of mental maps."]},{"id":"8.WG.RE.2","title":"WG.2","text":"The student will apply history and social science skills to evaluate the significance of natural, human, and capital resources by","grade":"Grade 8","strand":"Resources and the Environment","subject":"World Geography","course":"World Geography","subs":["comparing the distribution of major natural resources throughout world regions;","showing the influence of resources on patterns of economic activity and land use; and","evaluating perspectives regarding the use of resources."]},{"id":"8.WG.CIR.3","title":"WG.3","text":"The student will analyze the characteristics of the regions of the United States and Canada by","grade":"Grade 8","strand":"Classifying and Identifying Regions","subject":"World Geography","course":"World Geography","subs":["identifying and analyzing the location of major geographic regions and major cities on maps and a globe;","describing major physical and environmental features and how geography may change over time;","analyzing cultural influences and landscapes; and","explaining important economic characteristics, including the distribution of economic activities and global trade."]},{"id":"8.WG.CIR.4","title":"WG.4","text":"The student will analyze the characteristics of the regions of Latin America and the Caribbean by","grade":"Grade 8","strand":"Classifying and Identifying Regions","subject":"World Geography","course":"World Geography","subs":["identifying and analyzing the location of major geographic regions and major cities on maps and globe;","describing major physical and environmental features and how geography may change over time;","analyzing cultural influences and landscapes; and","explaining important economic characteristics, including the distribution of economic activities and global trade."]},{"id":"8.WG.CIR.5","title":"WG.5","text":"The students will analyze the characteristics of the regions of Europe by","grade":"Grade 8","strand":"Classifying and Identifying Regions","subject":"World Geography","course":"World Geography","subs":["identifying and analyzing the location of major geographic regions and major cities on maps and globe;","describing major physical and environmental features and how geography may change over time;","analyzing cultural influences and landscapes; and","explaining important economic characteristics, including the distribution of economic activities and global trade."]},{"id":"8.WG.CIR.6","title":"WG.6","text":"The student will analyze the characteristics of the regions of Russia and Central Asia by","grade":"Grade 8","strand":"Classifying and Identifying Regions","subject":"World Geography","course":"World Geography","subs":["identifying and analyzing the location of major geographic regions and major cities on maps and globe;","describing major physical and environmental features and how geography may change over time;","analyzing cultural influences and landscapes; and","explaining important economic characteristics, including the distribution of economic activities and global trade."]},{"id":"8.WG.CIR.7","title":"WG.7","text":"The student will analyze the characteristics of the regions of sub-Saharan Africa by","grade":"Grade 8","strand":"Classifying and Identifying Regions","subject":"World Geography","course":"World Geography","subs":["identifying and analyzing the location of major geographic regions and major cities on maps and globe;","describing major physical and environmental features and how geography may change over time;","analyzing cultural influences and landscapes; and","explaining important economic characteristics, including the distribution of economic activities and global trade."]},{"id":"8.WG.CIR.8","title":"WG.8","text":"The student will analyze the characteristics of the regions of North Africa and Southwest Asia regions by","grade":"Grade 8","strand":"Classifying and Identifying Regions","subject":"World Geography","course":"World Geography","subs":["identifying and analyzing the location of major geographic regions and major cities on maps and globe;","describing major physical and environmental features and how geography may change over time;","analyzing cultural influences and landscapes; and","explaining important economic characteristics, including the distribution of economic activities and global trade."]},{"id":"8.WG.CIR.9","title":"WG.9","text":"The student will analyze the characteristics of the regions of South Asia and Southeast Asia by","grade":"Grade 8","strand":"Classifying and Identifying Regions","subject":"World Geography","course":"World Geography","subs":["identifying and analyzing the location of major geographic regions and major cities on maps and globe;","describing major physical and environmental features and how geography may change over time;","analyzing cultural influences and landscapes; and","explaining important economic characteristics, including the distribution of economic activities and global trade."]},{"id":"8.WG.CIR.10","title":"WG.10","text":"The student will analyze the characteristics of the East Asian region by","grade":"Grade 8","strand":"Classifying and Identifying Regions","subject":"World Geography","course":"World Geography","subs":["identifying and analyzing the location of major geographic regions and major cities on maps and globe;","describing major physical and environmental features and how geography may change over time;","analyzing cultural influences and landscapes; and","explaining important economic characteristics, including the distribution of economic activities and global trade."]},{"id":"8.WG.CIR.11","title":"WG.11","text":"The student will analyze the characteristics of the Australian and Pacific Islands regions by","grade":"Grade 8","strand":"Classifying and Identifying Regions","subject":"World Geography","course":"World Geography","subs":["identifying and analyzing the location of major geographic regions and major cities on maps and globe;","describing major physical and environmental features and how geography may change over time;","analyzing cultural influences and landscapes; and","explaining important economic characteristics, including the distribution of economic activities and global trade"]},{"id":"8.WG.PM.12","title":"WG.12","text":"The student will apply social science skills to understand the distribution, growth rates, and characteristics of human population by","grade":"Grade 8","strand":"Population and Migration","subject":"World Geography","course":"World Geography","subs":["examining the relationship between demographic data to determine the level of economic development;","distinguishing between developed and developing countries; and","comparing and contrasting the level of economic development to the standard of living, quality of life, form of government, and personal freedom and economic opportunity."]},{"id":"8.WG.PM.13","title":"WG.13","text":"The student will apply history and social science skills to understand population and migration by","grade":"Grade 8","strand":"Population and Migration","subject":"World Geography","course":"World Geography","subs":["explaining how data is used to describe and compare populations; and","analyzing the causes, impacts, and responses related to migration."]},{"id":"8.WG.CL.14","title":"WG.14","text":"The student will apply history and social science skills to determine cultural patterns and interactions across time and place by","grade":"Grade 8","strand":"Cultural","subject":"World Geography","course":"World Geography","subs":["identifying and describing characteristics that contribute to cultural identity, cultural groups, and cultural landscapes; and","explaining the intellectual exchanges among cultures, including, but not limited to the areas of science, geography, mathematics, philosophy, medicine, art, and literature."]},{"id":"8.WG.CL.15","title":"WG.15","text":"The student will apply history and social science skills to analyze the patterns of rural and urban migration and development by","grade":"Grade 8","strand":"Cultural","subject":"World Geography","course":"World Geography","subs":["applying the concepts of site and situation to major cities in each region; and","explaining how the functions of towns and cities have changed over time."]},{"id":"8.WG.GN.16","title":"WG.16","text":"The student will apply history and social science skills to understand the impact of the growing interdependence of the world by","grade":"Grade 8","strand":"Globalization","subject":"World Geography","course":"World Geography","subs":["examining factors that influence the distribution of economic activities and trade; and","analyzing global trade and communication networks."]},{"id":"8.WG.POG.17","title":"WG.17","text":"The student will apply history and social science skills to analyze strategic geographic features and resources by","grade":"Grade 8","strand":"Political Geography","subject":"World Geography","course":"World Geography","subs":["identifying and describing examples of disputed borders and explaining the reasons for the disputes;","describing and explaining examples of the different types of conflicts that may erupt between and among nations; and","analyzing the types of conflicts and cooperation that can occur over the use of rivers and bodies of water."]}]