[{"id":"K.EN.OL.1","title":"K.1","text":"The student will demonstrate growth in the use of oral language.","grade":"Kindergarten","strand":"Oral Language","subject":"English","course":"English","subs":["Listen to a variety of literary forms, including stories and poems.","Participate in a variety of oral language activities including choral and echo speaking and recitation of short poems, rhymes, songs, and stories with repeated word order patterns.","Participate in oral generation of language experience narratives.","Participate in creative dramatics.","Use complete sentences that include subject, verb, and object."]},{"id":"K.EN.OL.2","title":"K.2","text":"The student will expand understanding and use of word meanings.","grade":"Kindergarten","strand":"Oral Language","subject":"English","course":"English","subs":["Increase listening and speaking vocabularies.","Use number words.","Use words to describe/name people, places, and things.","Use words to describe/name location, size, color, and shape.","Use words to describe/name actions.","Ask about words not understood.","Use vocabulary from other content areas."]},{"id":"K.EN.OL.3","title":"K.3","text":"The student will build oral communication skills.","grade":"Kindergarten","strand":"Oral Language","subject":"English","course":"English","subs":["Express ideas in complete sentences and express needs through direct requests.","Begin to initiate conversations.","Begin to follow implicit rules for conversation, including taking turns and staying on topic.","Listen and speak in informal conversations with peers and adults.","Participate in group and partner discussions about various texts and topics.","Begin to use voice level, phrasing, and intonation appropriate for various language situations.","Follow one- and two-step directions.","Begin to ask how and why questions."]},{"id":"K.EN.OL.4","title":"K.4","text":"The student will identify, say, segment, and blend various units of speech sounds.","grade":"Kindergarten","strand":"Oral Language","subject":"English","course":"English","subs":["Begin to discriminate between spoken sentences, words, and syllables.","Identify and produce words that rhyme.","Blend and segment multisyllabic words at the syllable level.","Segment one-syllable words into speech sound units including beginning phoneme(s) (onset) and ending (rimes).","Identify words according to shared beginning and/or ending sounds."]}]