[{"id":"K.MT.MG.10","title":2.1,"text":"The student will","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["determine past and future days of the week; and","identify specific days and dates on a given calendar."]},{"id":"K.MT.MG.11","title":2.11,"text":"The student will read temperature to the nearest 10 degrees.","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.EN.OL.1","title":"K.1","text":"The student will demonstrate growth in the use of oral language.","grade":"Kindergarten","strand":"Oral Language","subject":"English","course":"English","subs":["Listen to a variety of literary forms, including stories and poems.","Participate in a variety of oral language activities including choral and echo speaking and recitation of short poems, rhymes, songs, and stories with repeated word order patterns.","Participate in oral generation of language experience narratives.","Participate in creative dramatics.","Use complete sentences that include subject, verb, and object."]},{"id":"K.EN.OL.2","title":"K.2","text":"The student will expand understanding and use of word meanings.","grade":"Kindergarten","strand":"Oral Language","subject":"English","course":"English","subs":["Increase listening and speaking vocabularies.","Use number words.","Use words to describe/name people, places, and things.","Use words to describe/name location, size, color, and shape.","Use words to describe/name actions.","Ask about words not understood.","Use vocabulary from other content areas."]},{"id":"K.EN.OL.3","title":"K.3","text":"The student will build oral communication skills.","grade":"Kindergarten","strand":"Oral Language","subject":"English","course":"English","subs":["Express ideas in complete sentences and express needs through direct requests.","Begin to initiate conversations.","Begin to follow implicit rules for conversation, including taking turns and staying on topic.","Listen and speak in informal conversations with peers and adults.","Participate in group and partner discussions about various texts and topics.","Begin to use voice level, phrasing, and intonation appropriate for various language situations.","Follow one- and two-step directions.","Begin to ask how and why questions."]},{"id":"K.EN.OL.4","title":"K.4","text":"The student will identify, say, segment, and blend various units of speech sounds.","grade":"Kindergarten","strand":"Oral Language","subject":"English","course":"English","subs":["Begin to discriminate between spoken sentences, words, and syllables.","Identify and produce words that rhyme.","Blend and segment multisyllabic words at the syllable level.","Segment one-syllable words into speech sound units including beginning phoneme(s) (onset) and ending (rimes).","Identify words according to shared beginning and/or ending sounds."]},{"id":"K.EN.RD.5","title":"K.5","text":"The student will understand how print is organized and read.","grade":"Kindergarten","strand":"Reading","subject":"English","course":"English","subs":["Hold print materials in the correct position.","Identify the front cover, back cover, and title page of a book.","Distinguish between print and pictures.","Follow words from left to right and from top to bottom on a printed page.","Match voice with print (concept of word)."]},{"id":"K.EN.RD.6","title":"K.6","text":"The student will demonstrate an understanding that print conveys meaning.","grade":"Kindergarten","strand":"Reading","subject":"English","course":"English","subs":["Identify common signs and logos.","Explain that printed materials provide information.","Read and explain own writing and drawings.","Read his/her name and read fifteen meaningful, concrete words."]},{"id":"K.EN.RD.7","title":"K.7","text":"The student will develop an understanding of basic phonetic principles.","grade":"Kindergarten","strand":"Reading","subject":"English","course":"English","subs":["Identify and name the uppercase and lowercase letters of the alphabet.","Match consonant, short vowel, and initial consonant digraph sounds to appropriate letters.","Demonstrate a speech-to-print match through accurate finger-point reading in familiar text that includes words with more than one syllable.","Identify beginning consonant sounds in single-syllable words."]},{"id":"K.EN.RD.8","title":"K.8","text":"The student will expand vocabulary.","grade":"Kindergarten","strand":"Reading","subject":"English","course":"English","subs":["Discuss meanings of words.","Develop vocabulary by listening to a variety of texts read aloud."]},{"id":"K.EN.RD.9","title":"K.9","text":"The student will demonstrate comprehension of fictional texts.","grade":"Kindergarten","strand":"Reading","subject":"English","course":"English","subs":["Identify what an author does and what an illustrator does.","Relate previous experiences to what is read.","Use pictures to make predictions.","Begin to ask and answer questions about what is read.","Use story language in discussions and retellings.","Retell familiar stories, using beginning, middle, and end.","Discuss characters, setting, and events."]},{"id":"K.EN.RD.10","title":"K.10","text":"The student will demonstrate comprehension of nonfiction texts.","grade":"Kindergarten","strand":"Reading","subject":"English","course":"English","subs":["Use pictures to identify topic and make predictions.","Identify text features specific to the topic, such as titles, headings, and pictures."]},{"id":"K.EN.WR.11","title":"K.11","text":"The student will print in manuscript.","grade":"Kindergarten","strand":"Writing","subject":"English","course":"English","subs":["Print uppercase and lowercase letters of the alphabet independently.","Print his/her first and last names."]},{"id":"K.EN.WR.12","title":"K.12","text":"The student will write to communicate ideas for a variety of purposes.","grade":"Kindergarten","strand":"Writing","subject":"English","course":"English","subs":["Differentiate pictures from writing.","Draw pictures and/or use letters and phonetically spelled words to write about experiences.","Use letters and beginning consonant sounds to spell phonetically words to describe pictures or write about experiences.","Write left to right and top to bottom."]},{"id":"K.EN.WR.13","title":"K.13","text":"The student will use available technology for reading and writing.","grade":"Kindergarten","strand":"Writing","subject":"English","course":"English","subs":[]},{"id":"K.CS.AP.1","title":"K.1","text":"The student will construct sets of step-by-step instructions (algorithms) either independently or collaboratively including sequencing that emphasize the beginning, middle, and end.","grade":"Kindergarten","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS.AP.2","title":"K.2","text":"The student will construct programs to accomplish tasks as a means of creative expression using a block based programming language or unplugged activities, either independently or collaboratively, including sequencing, emphasizing the beginning, middle, and end.","grade":"Kindergarten","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS.AP.3","title":"K.3","text":"The student will create a design document to illustrate thoughts, ideas, and stories in a sequential (step-by-step) manner (e.g., story map, storyboard, and sequential graphic organizer).","grade":"Kindergarten","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS.AP.4","title":"K.4","text":"The student will categorize a group of items based on one attribute or the action of each item, with or without a computing device.","grade":"Kindergarten","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS.SYS.5","title":"K.5","text":"The student will identify components of computing systems (e.g., keyboard, mouse, desktop computer, laptop computer, tablet, and printer).","grade":"Kindergarten","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS.SYS.6","title":"K.6","text":"The student will identify, using accurate terminology, simple hardware and software problems that may occur during use (e.g., app or program is not working as expected, no sound is coming from a device, device will not turn on).","grade":"Kindergarten","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS.CY.7","title":"K.7","text":"The student will identify what is allowed and what is not allowed at school when using technology.","grade":"Kindergarten","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS.CY.8","title":"K.8","text":"The student will identify personal information (e.g., address, telephone number, and name) and the importance of protecting personal information online.","grade":"Kindergarten","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS.DA.9","title":"K.9","text":"The student will gather and display data and organize it in a chart or graph in order to answer questions about the data, with or without a computing device.","grade":"Kindergarten","strand":"Data & Analysis","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS.IC.10","title":"K.10","text":"The student will identify responsible behaviors associated with using information and technology.","grade":"Kindergarten","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS.NI.11","title":"K.11","text":"The student will discuss, in a whole class setting, how information can be communicated electronically (e.g., email, social media).","grade":"Kindergarten","strand":"Networking & the Internet","subject":"Computer Science (2017)","course":"Computer Science (2017)","subs":[]},{"id":"K.CS24.AP.1","title":"K.AP.1","text":"The student will apply computational thinking to identify patterns and sort items into categories based on an attribute.","grade":"Kindergarten","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify attributes of a set of objects.","Compare two objects and list attributes they have in common.","Sort and classify concrete objects based on one attribute."]},{"id":"K.CS24.AP.2","title":"K.AP.2","text":"The student will plan and implement algorithms that include sequential order.","grade":"Kindergarten","strand":"Algorithms & Programming","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify tasks that are completed using sequential step-by-step instructions.","Recall and state thoughts, ideas, and stories in the form of sequential steps.","Create a design document to illustrate thoughts, ideas, and stories in a sequential manner.","Create and test a sequential algorithm emphasizing beginning, middle, and end.","Create and test a sequential algorithm to accomplish a predetermined task."]},{"id":"K.CS24.CSY.1","title":"K.CSY.1","text":"The student will identify the purpose and components of a computing device.","grade":"Kindergarten","strand":"Computing Systems","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify and locate parts of a computing device, including sensors.","Describe the function of common components in a computing device.","Identify different types of computing devices with screens.","Identify tasks and activities at home and at school that use screens.","Demonstrate proper use of computing devices."]},{"id":"K.CS24.CSY.2","title":"K.CSY.2","text":"The student will identify when a computing device might not work as expected.","grade":"Kindergarten","strand":"Computing Systems","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify a problem with a computing device when it is not working as expected.","Explain what to do when a computing device is not working as expected."]},{"id":"K.CS24.CYB.1","title":"K.CYB.1","text":"The student will demonstrate safe and responsible use of computing technologies.","grade":"Kindergarten","strand":"Cybersecurity","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify safe and responsible uses of computing technologies based on the school rules and acceptable use policy (AUP).","Demonstrate safe and responsible uses of computing technologies.","Communicate the process(es) for reporting behaviors that do not comply with school rules or acceptable use policy"]},{"id":"K.CS24.CYB.2","title":"K.CYB.2","text":"The student will describe the importance of protecting personal information online.","grade":"Kindergarten","strand":"Cybersecurity","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe what personal information should be shared and not shared.","Determine to whom personal information should be shared.","Identify safe practices to keep personal information private."]},{"id":"K.CS24.DA.1","title":"K.DA.1","text":"The student will gather and record data with or without a computing device.","grade":"Kindergarten","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Discuss the importance of data.","Identify numeric and non-numeric data.","Record data and communicate possible patterns"]},{"id":"K.CS24.DA.2","title":"K.DA.2","text":"The student will create representations of data to make predictions and draw conclusions.","grade":"Kindergarten","strand":"Data & Analysis","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Create tables, object graphs, picture graphs, and/or models.","Describe the information from a given data visualization.","Use data to answer questions, make predictions, and draw conclusions."]},{"id":"K.CS24.IC.1","title":"K.IC.1","text":"The student will identify and discuss how computing technologies impact people's lives.","grade":"Kindergarten","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["List computing technologies found in the classroom, home, and the community.","Identify how computing technologies are used in daily tasks.","Discuss healthy habits for using computing technologies."]},{"id":"K.CS24.IC.2","title":"K.IC.2","text":"The student will discuss and describe how different careers use computing technologies.","grade":"Kindergarten","strand":"Impacts of Computing","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Describe how computing technologies are used in various careers.","Discuss the advantages of using computing technologies in different careers.","Identify local jobs that utilize computing technologies."]},{"id":"K.CS24.NI.1","title":"K.NI.1","text":"The student will describe how people can communicate with others by using connected computing devices and the Internet.","grade":"Kindergarten","strand":"Networking & the Internet","subject":"Computer Science (2024)","course":"Computer Science (2024)","subs":["Identify ways to communicate with others using connected computing devices and the Internet.","Describe the benefits of communicating with others using connected computing devices and the Internet."]},{"id":"K.HSS.SK.0","title":"Skills K","text":"The student will apply history and social science skills to the content by","grade":"Kindergarten","strand":"Skills","subject":"History & Social Science","course":"History & Social Science","subs":["viewing and exploring information sources, including, but not limited to artifacts, primary and secondary sources, charts, graphs, and diagrams;","applying geographic skills to identify and understand geographic features;","demonstrating curiosity and critical thinking through questioning;","sequencing and organizing information;","identifying similarities and differences to explain content;","recognizing cause-and-effect relationships;","using economic decision-making models to make informed economic decisions;","practicing civility, respect, hard work, and responsible citizenship skills; and","using content vocabulary to demonstrate comprehension."]},{"id":"K.HSS.CV.1","title":"K.2","text":"The student will apply history and social science skills to practice citizenship in the classroom by","grade":"Kindergarten","strand":"Civics","subject":"History & Social Science","course":"History & Social Science","subs":["taking responsibility for one’s actions;","practicing honesty and showing kindness to oneself and others;","recognizing the purpose of rules and practicing self-control;","caring for one’s personal property and respecting other students’ property; and","taking turns, sharing, and working well with others for the good of everyone else."]},{"id":"K.HSS.CV.2","title":"K.2","text":"The student will apply history and social science skills to explain how communities honor state and national traditions and recognize designated Virginia holidays, including but not limited to","grade":"Kindergarten","strand":"Civics","subject":"History & Social Science","course":"History & Social Science","subs":["Labor Day;","Columbus Day (Yorktown Victory Day);","Election Day;","Veterans Day;","Thanksgiving Day;","Christmas Day;","New Year’s Day;","Martin Luther King, Jr. Day;","George Washington Day (commonly known as Presidents’ Day);","Memorial Day;","Juneteenth; and","Independence Day."]},{"id":"K.HSS.CV.3","title":"K.3","text":"The student will apply history and social science skills to define patriotism and explain how communities express patriotism by","grade":"Kindergarten","strand":"Civics","subject":"History & Social Science","course":"History & Social Science","subs":["identifying the American and Virginia flags;","identifying national and state symbols, including, but not limited to the bald eagle, the dogwood, and the cardinal;","recognizing the Pledge of Allegiance and the National Anthem; and","identifying the current president and explaining that the president is the leader of the United States and is elected by voters."]},{"id":"K.HSS.HY.4","title":"K.4","text":"The student will apply history and social science skills to recognize Virginia’s earliest communities by","grade":"Kindergarten","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["identifying examples of historic events, stories, and legends;","identifying early communities, changemakers, and contributions of leaders, including, but not limited to Indigenous tribes, farmers, traders, early settlers, minorities, women, and children;","recognizing that places change over time; and","identifying people who helped establish and lead the local community over time."]},{"id":"K.HSS.HY.5","title":"K.5","text":"The student will apply history and social science skills to understand and explain what makes communities unique by","grade":"Kindergarten","strand":"History","subject":"History & Social Science","course":"History & Social Science","subs":["explaining the roles of important local community members, such as, but not limited to medical personnel, first responders, teachers, and business leaders;","identifying historic events; and","telling the stories of the people that developed their local communities."]},{"id":"K.HSS.GE.6","title":"K.6","text":"The student will apply history and social science skills to describe the relative location of people, places, and objects by using positional words, including, but not limited to near/far, over/under, above/below, left/right, behind/in front, next to and between.","grade":"Kindergarten","strand":"Geography","subject":"History & Social Science","course":"History & Social Science","subs":[]},{"id":"K.HSS.GE.7","title":"K.7","text":"The student will apply history and social science skills to demonstrate an understanding of maps and globes by","grade":"Kindergarten","strand":"Geography","subject":"History & Social Science","course":"History & Social Science","subs":["identifying the similarities and differences between a map and a globe;","identifying basic map symbols;","identifying land and bodies of water in the local community; and","identifying the geographic location of the United States and Virginia on a map and globe."]},{"id":"K.HSS.EC.8","title":"K.8","text":"The student will apply history and social science skills to demonstrate an understanding of primary economic principles by","grade":"Kindergarten","strand":"Economics","subject":"History & Social Science","course":"History & Social Science","subs":["describing ways people work to earn and save money to buy the things they need and want; and","recognizing that Americans are free to make choices about what to buy and that they must make choices because they cannot have everything they want."]},{"id":"K.MT.NS.1","title":"K.1","text":"The student will","grade":"Kindergarten","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["tell how many are in a given set of 20 or fewer objects by counting orally; and","read, write, and represent numbers from 0 through 20."]},{"id":"K.MT.NS.2","title":"K.2","text":"The student, given no more than three sets, each set containing 10 or fewer concrete objects, will","grade":"Kindergarten","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["compare and describe one set as having more, fewer, or the same number of objects as the other set(s); and","compare and order sets from least to greatest and greatest to least."]},{"id":"K.MT.NS.3","title":"K.3","text":"The student will","grade":"Kindergarten","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["count forward orally by ones from 0 to 100;","count backward orally by ones when given any number between 1 and 10;","identify the number after, without counting, when given any number between 0 and 100 and identify the number before, without counting, when given any number between 1 and 10; and","count forward by tens to determine the total number of objects to 100."]},{"id":"K.MT.NS.4","title":"K.4","text":"The student will","grade":"Kindergarten","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":["recognize and describe with fluency part-whole relationships for numbers up to 5; and","investigate and describe part-whole relationships for numbers up to 10."]},{"id":"K.MT.NS.5","title":"K.5","text":"The student will investigate fractions by representing and solving practical problems involving equal sharing with two sharers","grade":"Kindergarten","strand":"Number & Number Sense","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.MT.CE.6","title":"K.6","text":"The student will model and solve single-step story and picture problems with sums to 10 and differences within 10, using concrete objects.","grade":"Kindergarten","strand":"Computation & Estimation","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.MT.MG.7","title":"K.7","text":"The student will recognize the attributes of a penny, nickel, dime, and quarter and identify the number of pennies equivalent to a nickel, a dime, and a quarter.","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.MT.MG.8","title":"K.3","text":"The student will investigate the passage of time by reading and interpreting a calendar","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.MT.MG.9","title":"K.3","text":"The student will compare two objects or events, using direct comparisons, according to one or more of the following attributes: length (longer, shorter), height (taller, shorter), weight (heavier, lighter), temperature (hotter, colder), volume (more, less), and time (longer, shorter)","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.MT.MG.10","title":"K.10","text":"The student will","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["identify and describe plane figures (circle, triangle, square, and rectangle","compare the size (smaller, larger) and shape of plane figures (circle, triangle, square, and rectangle)","describe the location of one object relative to another (above, below, next to) and identify representations of plane figures (circle, triangle, square, and rectangle) regardless of their positions and orientations in space"]},{"id":"K.MT.PS.11","title":"K.11","text":"The student will","grade":"Kindergarten","strand":"Probability & Statistics","subject":"Mathematics","course":"Mathematics","subs":["collect, organize, and represent data;","read and interpret data in object graphs, picture graphs, and tables."]},{"id":"K.MT.PA.12","title":"K.12","text":"The student will sort and classify objects according to one attribute.","grade":"Kindergarten","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.MT.PA.13","title":"K.13","text":"The student will identify, describe, extend, create, and transfer repeating patterns.","grade":"Kindergarten","strand":"Patterns, Functions, & Algebra","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.SC.SE.1","title":"K.1","text":"The student will demonstrate an understanding of scientific and engineering practices by...","grade":"Kindergarten","strand":"Scientific & Engineering Practices","subject":"Science","course":"Science","subs":["asking questions and defining problems (ask questions based on observations, identify a problem based on need, make predictions based on observations)","planning and carrying out investigations (with guidance, conduct investigations to produce data, identify characteristics and properties of objects by observations, use tools to measure relative length, weight, volume, and temperature of common objects)","interpreting, analyzing, and evaluating data (use and share pictures, drawings, and/or writings of observations, describe patterns and relationships, classify and arrange objects based on a single physical characteristic or property, organize and represent various forms of data using tables, picture graphs, and object graphs, read and interpret data displayed in tables, picture graphs, and object graphs, using the vocabulary more, less, fewer, greater than, less than, and equal to)","constructing and critiquing conclusions and explanations (make simple conclusions based on data or observations, recognize unusual or unexpected results)","developing and using models (use physical models to demonstrate simple phenomena and natural processes)","obtaining, evaluating, and communicating information (communicate observations and data using simple graphs, pictures, drawings, numbers, speech and/or writing)"]},{"id":"K.SC.FM.2","title":"K.2","text":"The student will investigate and understand that pushes and pulls affect the motion of objects. Key ideas include","grade":"Kindergarten","strand":"Force, Motion, & Energy","subject":"Science","course":"Science","subs":["pushes and pulls can cause an object to move;","pushes and pulls can change the direction of an object; and","changes in motion are related to the strength of the push or pull."]},{"id":"K.SC.MA.3","title":"K.3","text":"The student will investigate and understand that physical properties of an objectcan be described. Properties include","grade":"Kindergarten","strand":"Matter","subject":"Science","course":"Science","subs":["colors;","shapes and forms;","textures and feel; and","relative sizes and weights of objects."]},{"id":"K.SC.LP.4","title":"K.4","text":"The student will investigate and understand that water is important in our daily lives and has properties. Key ideas include","grade":"Kindergarten","strand":"Living Systems & Processes","subject":"Science","course":"Science","subs":["water has many uses;","water can be found in many places;","water occurs in different phases; and","water flows downhill."]},{"id":"K.SC.LP.5","title":"K.5","text":"The students will investigate and understand that senses allow humans to seek, find, take in, and react or respond to different information. Key ideas include","grade":"Kindergarten","strand":"Living Systems & Processes","subject":"Science","course":"Science","subs":["the five basic senses correspond to specific human body structures; and","senses are used in our daily lives."]},{"id":"K.SC.LP.6","title":"K.6","text":"The student will investigate and understand that there are differences between living organisms and nonliving objects. Key ideas include","grade":"Kindergarten","strand":"Living Systems & Processes","subject":"Science","course":"Science","subs":["all things can be classified as living or nonliving; and","living organisms have certain characteristics that distinguish them from nonliving objects."]},{"id":"K.SC.LP.7","title":"K.7","text":"The student will investigate and understand that plants and animals have basic needs and life processes. Key ideas include","grade":"Kindergarten","strand":"Living Systems & Processes","subject":"Science","course":"Science","subs":["living things need adequate food, water, shelter, air, and space to survive;","plants and animals have life cycles; and","offspring of plants and animals are similar but not identical to their parents or to one another."]},{"id":"K.SC.ES.8","title":"K.8","text":"The student will investigate and understand that light influences temperature on Earth’s surfaces and can cause shadows. Key ideas include","grade":"Kindergarten","strand":"Earth & Space Systems","subject":"Science","course":"Science","subs":["the sun provides light and warms Earth’s surface;","shadows can be produced when sunlight or artificial light is blocked by an object; and","objects in shadows and objects in sunlight have different temperatures."]},{"id":"K.SC.ES.9","title":"K.9","text":"The student will investigate and understand that there are patterns in nature. Key patterns include","grade":"Kindergarten","strand":"Earth & Space Systems","subject":"Science","course":"Science","subs":["daily weather;","seasonal changes; and","day and night."]},{"id":"K.SC.ES.10","title":"K.10","text":"The student will investigate and understand that change occurs over time. Key ideas include","grade":"Kindergarten","strand":"Earth & Space Systems","subject":"Science","course":"Science","subs":["natural and human-made things change over time;","living and nonliving things change over time;","changes can be observed and measured; and","changes may be fast or slow."]},{"id":"K.SC.ER.11","title":"K.11","text":"The student will investigate and understand that humans use resources. Key ideas include","grade":"Kindergarten","strand":"Earth Resources","subject":"Science","course":"Science","subs":["some materials and objects can be used over and over again;","materials can be recycled; and","choices we make impact the air, water, land and living things."]},{"id":"K.SEL.SEA.1","title":"SeA1:K","text":"Recognize and understand the interaction between one’s own thoughts and emotions. (Critical Thinking)","grade":"Kindergarten","strand":"Self-Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can name basic emotions.","I can classify emotions as either comfortable or uncomfortable.","I can be aware of how my body feels when I have different emotions."]},{"id":"K.SEL.SEA.2","title":"SeA2:K","text":"Develop a positive identity and recognize personal strengths, interests, values, and challenges. (Creative Thinking)","grade":"Kindergarten","strand":"Self-Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can list things I do well (strengths) and things I like (interests).","I can recognize when things are hard for me and that it is okay to make mistakes, or ask for help.","I can identify a value/something important to me.","I can recognize how I have similarities with others as well as how I am unique."]},{"id":"K.SEL.SEM.1","title":"SeM1:K","text":"Develop and demonstrate strategies for managing and expressing one's own emotions to persevere in challenging situations. (Communication)","grade":"Kindergarten","strand":"Self-Management","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can use verbal and nonverbal language to communicate different emotions.","I can identify strategies that allow me to stay calm.","I can define and identify a time when I showed courage and perseverance."]},{"id":"K.SEL.SEM.2","title":"SeM2:K","text":"Demonstrate the skills related to achieving personal and academic goals. (Creative Thinking)  SOCIAL AWARENESS","grade":"Kindergarten","strand":"Self-Management","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can describe something I have accomplished.","I can identify a personal or academic goal.","I can work independently and ask for help when needed."]},{"id":"K.SEL.SOA.1","title":"SoA1:K","text":"Demonstrate the ability to empathize with and show gratitude for others, including those with different and diverse perspectives, abilities, backgrounds, and cultures. (Collaboration)","grade":"Kindergarten","strand":"Social Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can recognize the feelings and strengths of others.","I can identify and value similarities and differences in abilities, cultures, traditions and beliefs.","I can explain why I am grateful for someone or something in my life."]},{"id":"K.SEL.SOA.2","title":"SoA2:K","text":"Demonstrate the ability to understand broader historical and social contexts’ impact on humanity. (Citizenship) RELATIONSHIP SKILLS","grade":"Kindergarten","strand":"Social Awareness","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can explain why something is fair or unfair."]},{"id":"K.SEL.RES.1","title":"ReS1:K","text":"Apply verbal and non-verbal communication and listening skills to interact with others, form and maintain positive relationships, and resolve conflict constructively. (Communication)","grade":"Kindergarten","strand":"Relationship Skills","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can be considerate of others by taking turns, sharing; and using compliments to encourage others.","I can name the actions of an active listener.","I can recognize when I can solve a problem on my own or when I need adult support.","I can identify situations that are unkind or unfair."]},{"id":"K.SEL.RES.2","title":"ReS2:K","text":"Demonstrate the ability to effectively collaborate and navigate relationships while valuing different and diverse perspectives, abilities, backgrounds, and cultures. (Collaboration)","grade":"Kindergarten","strand":"Relationship Skills","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can name the actions of a helpful teammate or group member.","I can understand that everyone has a need for personal space."]},{"id":"K.SEL.DEM.1","title":"DeM1:K","text":"Demonstrate the ability to evaluate, through reflection, the benefits and consequences of various actions within the decision-making process. (Critical Thinking)","grade":"Kindergarten","strand":"Decision Making","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can describe a problem.","I can recognize there may be more than one way to solve a problem.","I can describe that all actions have outcomes."]},{"id":"K.SEL.DEM.2","title":"DeM2:K","text":"Demonstrate the ability to make ethical decisions as a global citizen and evaluate outcomes based on one's own identity and the impact on humanity. (Citizenship)","grade":"Kindergarten","strand":"Decision Making","subject":"Social-Emotional Learning","course":"Social-Emotional Learning","subs":["I can describe how I want to be treated.","I can feel good about myself by showing kindness towards others."]},{"id":"K.VA.CP.1","title":"K.1","text":"The student will apply creative thinking to artmaking.","grade":"Kindergarten","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Draw from imagination","Create works of art that represent personal responses to art-making challenges."]},{"id":"K.VA.CP.2","title":"K.2","text":"The student will apply a creative process for artmaking.","grade":"Kindergarten","strand":"Creative Process","subject":"Visual Art","course":"Visual Art","subs":["Ask questions about art and artmaking.","Generate multiple ideas for an art challenge.","Share ideas with a group."]},{"id":"K.VA.CC.3","title":"K.3","text":"The student will analyze and interpret artwork using art vocabulary.","grade":"Kindergarten","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":["Describe works of art.","Describe objects in the environment by their visual qualities (e.g., location, size, color, texture, line, shape, pattern).","Describe ideas, experiences, and feelings expressed in personal and other works of art."]},{"id":"K.VA.CC.4","title":"K.4","text":"The student will describe personal connections to and interests in visual art.","grade":"Kindergarten","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"K.VA.CC.5","title":"K.5","text":"The student will describe how artists work together in a creative community.","grade":"Kindergarten","strand":"Critical Thinking & Communication","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"K.VA.HC.6","title":"K.6","text":"The student will explore cultural and historical influences of art.","grade":"Kindergarten","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":["Describe the concept that people in all cultures create works of art.","Respond to art from a variety of time periods and places."]},{"id":"K.VA.HC.7","title":"K.7","text":"The student will identify a variety of purposes for creating works of art including art to commemorate personal and community events.","grade":"Kindergarten","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"K.VA.HC.8","title":"K.8","text":"The student will identify information about art from provided resources.","grade":"Kindergarten","strand":"History, Culture, & Citizenship","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"K.VA.IA.9","title":"K.9","text":"The student will identify people, including oneself, who make art as artists.","grade":"Kindergarten","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"K.VA.IA.10","title":"K.10","text":"The student will identify works of art created with contemporary media.","grade":"Kindergarten","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"K.VA.IA.11","title":"K.11","text":"The student will recognize connections between the arts, incorporating or responding to music, theatre, or dance in their artwork.","grade":"Kindergarten","strand":"Innovation in the Arts","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"K.VA.TA.12","title":"K.12","text":"The student will identify and use the following in works of art:","grade":"Kindergarten","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Color—red, blue, yellow, green, orange, violet, brown, black, white.","Line—straight/curved, thick/thin, long/short, up/down/across.","Shape—circle, square, triangle, rectangle, oval.","Texture—visual, tactile.","Pattern—occurring naturally, made by people."]},{"id":"K.VA.TA.13","title":"K.13","text":"The student will identify spatial relationships for composition.","grade":"Kindergarten","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Identify spatial relationships—left, right, top, bottom, side, center, front, back, over, and under.","Make observations of objects in space"]},{"id":"K.VA.TA.14","title":"K.14","text":"The student will create drawings from observation.","grade":"Kindergarten","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"K.VA.TA.15","title":"K.15","text":"The student will use motor skills to create two-dimensional and three-dimensional works of art (e.g., pinching, pulling, squeezing, twisting, pounding, rolling, folding, cutting, modeling, stamping).","grade":"Kindergarten","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"K.VA.TA.16","title":"K.16","text":"The student will explore a variety of media, techniques, and processes to create twodimensional and three-dimensional artwork.","grade":"Kindergarten","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":[]},{"id":"K.VA.TA.17","title":"K.17","text":"The student will create artworks inspired by a variety of sources and subjects.","grade":"Kindergarten","strand":"Technique & Application","subject":"Visual Art","course":"Visual Art","subs":["Depict the human figure.","Use nature as inspiration."]}]