[{"id":"K.MT.MG.10","title":2.1,"text":"The student will","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["determine past and future days of the week; and","identify specific days and dates on a given calendar."]},{"id":"K.MT.MG.11","title":2.11,"text":"The student will read temperature to the nearest 10 degrees.","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.MT.MG.7","title":"K.7","text":"The student will recognize the attributes of a penny, nickel, dime, and quarter and identify the number of pennies equivalent to a nickel, a dime, and a quarter.","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.MT.MG.8","title":"K.3","text":"The student will investigate the passage of time by reading and interpreting a calendar","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.MT.MG.9","title":"K.3","text":"The student will compare two objects or events, using direct comparisons, according to one or more of the following attributes: length (longer, shorter), height (taller, shorter), weight (heavier, lighter), temperature (hotter, colder), volume (more, less), and time (longer, shorter)","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":[]},{"id":"K.MT.MG.10","title":"K.10","text":"The student will","grade":"Kindergarten","strand":"Measurement & Geometry","subject":"Mathematics","course":"Mathematics","subs":["identify and describe plane figures (circle, triangle, square, and rectangle","compare the size (smaller, larger) and shape of plane figures (circle, triangle, square, and rectangle)","describe the location of one object relative to another (above, below, next to) and identify representations of plane figures (circle, triangle, square, and rectangle) regardless of their positions and orientations in space"]}]