[{"id":"MS.SC.LS.1","title":"LS.1","text":"The student will demonstrate an understanding of scientific and engineering practices by","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["asking questions and defining problems (ask questions and develop hypotheses to determine relationships between independent and dependent variables, offer simple solutions to design problems)","planning and carrying out investigations (independently and collaboratively plan and conduct observational and experimental investigations; identify variables, constants, and controls where appropriate and include the safe use of chemicals and equipment, evaluate the accuracy of various methods for collecting data, take metric measurements using appropriate tools and technologies including the use of microscopes)","interpreting, analyzing, and evaluating data (identify, interpret, and evaluate patterns in data, construct, analyze, and interpret graphical displays of data, compare and contrast data collected by different groups and discuss similarities and differences in their findings, consider limitations of data analysis and/or seek to improve precision and accuracy of data, use data to evaluate and refine design solutions)","constructing and critiquing conclusions and explanations (construct explanations that include qualitative or quantitative relationships between variables, construct scientific explanations based on valid and reliable evidence obtained from sources (including the students’ own investigations), differentiate between a scientific hypothesis and theory)","developing and using models (construct and use models and simulations to illustrate, predict, and/or explain observable and unobservable phenomena, life processes, or mechanisms, evaluate limitations of models)","obtaining, evaluating, and communicating information (read scientific texts, including those adapted for classroom use, to obtain scientific and/or technical information, gather, read, and synthesize information from multiple appropriate sources and assess the credibility, accuracy, and possible bias of each publication, construct, use, and/or present an argument supported by empirical evidence and scientific reasoning)"]},{"id":"MS.SC.LS.2","title":"LS.2","text":"The student will investigate and understand that all living things are composed of one or more cells that support life processes, as described by the cell theory. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["the development of the cell theory demonstrates the nature of science;","cell structure and organelles support life processes;","similarities and differences between plant and animal cells determine how they support life processes;","cell division is the mechanism for growth and reproduction; and","cellular transport (osmosis and diffusion) is important for life processes."]},{"id":"MS.SC.LS.3","title":"LS.3","text":"The student will investigate and understand that there are levels of structural organization in living things. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["patterns of cellular organization support life processes;","unicellular and multicellular organisms have comparative structures; and","similar characteristics determine the classification of organisms."]},{"id":"MS.SC.LS.4","title":"LS.4","text":"The student will investigate and understand that there are chemical processes of energy transfer which are important for life. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["photosynthesis is the foundation of virtually all food webs; and","photosynthesis and cellular respiration support life processes."]},{"id":"MS.SC.LS.5","title":"LS.5","text":"The student will investigate and understand that biotic and abiotic factors affect an ecosystem. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["matter moves through ecosystems via the carbon, water, and nitrogen cycles;","energy flow is represented by food webs and energy pyramids; and","relationships exist among producers, consumers, and decomposers."]},{"id":"MS.SC.LS.6","title":"LS.6","text":"The student will investigate and understand that populations in a biological community interact and are interdependent. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["relationships exist between predators and prey and these relationships are modeled in food webs;","the availability and use of resources may lead to competition and cooperation;","symbiotic relationships support the survival of different species; and","the niche of each organism supports survival."]},{"id":"MS.SC.LS.7","title":"LS.7","text":"The student will investigate and understand that adaptations support an organism’s survival in an ecosystem. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["biotic and abiotic factors define land, marine, and freshwater ecosystems; and","physical and behavioral characteristics enable organisms to survive within a specific ecosystem."]},{"id":"MS.SC.LS.8","title":"LS.8","text":"The student will investigate and understand that ecosystems, communities, populations, and organisms are dynamic and change over time. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["organisms respond to daily, seasonal, and long-term changes;","changes in the environment may increase or decrease population size; and","large-scale changes such as eutrophication, climate changes, and catastrophic disturbances affect ecosystems."]},{"id":"MS.SC.LS.9","title":"LS.9","text":"The student will investigate and understand that relationships exist between ecosystem dynamics and human activity. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["changes in habitat can disturb populations;","disruptions in ecosystems can change species competition; and","variations in biotic and abiotic factors can change ecosystems."]},{"id":"MS.SC.LS.10","title":"LS.10","text":"The student will investigate and understand that organisms reproduce and transmit genetic information to new generations. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["DNA has a role in making proteins that determine organism traits;","the role of meiosis is to transfer traits to the next generation; and","Punnett squares are mathematical models used to predict the probability of traits in offspring."]},{"id":"MS.SC.LS.11","title":"LS.11","text":"The student will investigate and understand that populations of organisms can change over time. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["mutation, adaptation, natural selection, and extinction change populations;","the fossil record, genetic information, and anatomical comparisons provide evidence for evolution; and","environmental factors and genetic variation, influence survivability and diversity of organisms."]},{"id":"MS.CSE.AP.1","title":"MSCSE.1","text":"The student will design and iteratively develop programs that combine control structures, including loops and conditionals.","grade":"Middle School Courses","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.AP.2","title":"MSCSE.2","text":"The student will investigate variables and data types, including simple operations on strings.","grade":"Middle School Courses","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.AP.3","title":"MSCSE.3","text":"The student will implement a program that accepts input values, stores them in appropriately named variables, and produces output.","grade":"Middle School Courses","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.AP.4","title":"MSCSE.4","text":"The student will document programs in order to make them easier to trace, test, and debug.","grade":"Middle School Courses","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.IC.5","title":"MSCSE.5","text":"The student will discuss issues of bias and accessibility in the design of existing technologies.","grade":"Middle School Courses","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.IC.6","title":"MSCSE.6","text":"The student will describe and explain the history of computer science, including naming significant historical figures and describing their impact on the field.","grade":"Middle School Courses","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.AP.7","title":"MSCSE.7","text":"The student will use flowcharts and/or pseudocode to address complex problems as algorithms.","grade":"Middle School Courses","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.AP.8","title":"MSCSE.8","text":"The student will incorporate existing code, media, and libraries into original programs, and give attribution.","grade":"Middle School Courses","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.AP.9","title":"MSCSE.9","text":"The student will systematically test and refine programs using a range of test cases.","grade":"Middle School Courses","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.NI.10","title":"MSCSE.10","text":"The student will model the role of protocols in transmitting data across networks and the Internet.","grade":"Middle School Courses","strand":"Networking & the Internet","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.CY.11","title":"MSCSE.11","text":"The student will apply multiple methods of encryption to model the secure transmission of information.","grade":"Middle School Courses","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.CY.12","title":"MSCSE.12","text":"The student will explain how physical and digital security measures protect electronic information.","grade":"Middle School Courses","strand":"Cybersecurity","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.DA.13","title":"MSCSE.13","text":"The student will collect data using computational tools and transform the data to make it more useful and reliable.","grade":"Middle School Courses","strand":"Data & Analysis","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.DA.14","title":"MSCSE.14","text":"The student will refine computational models based on the data they have generated.","grade":"Middle School Courses","strand":"Data & Analysis","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.DA.15","title":"MSCSE.15","text":"The student will represent data using multiple encoding schemes.","grade":"Middle School Courses","strand":"Data & Analysis","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.IC.16","title":"MSCSE.16","text":"The student will compare tradeoffs associated with computing technologies that affect people's everyday activities and career options.","grade":"Middle School Courses","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.IC.17","title":"MSCSE.17","text":"The student will collaborate with many contributors through strategies such as crowdsourcing or surveys when creating a computational artifact or visualization.","grade":"Middle School Courses","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.IC.18","title":"MSCSE.18","text":"The student will describe tradeoffs between allowing information to be public and keeping information private and secure.","grade":"Middle School Courses","strand":"Impacts of Computing","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.SYS.19","title":"MSCSE.19","text":"The student will systematically identify and correct problems with computing devices and their components.","grade":"Middle School Courses","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.SYS.20","title":"MSCSE.20","text":"The student will explore the relationship between hardware and software using the Internet of Things.","grade":"Middle School Courses","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.AP.21","title":"MSCSE.21","text":"The student will","grade":"Middle School Courses","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":["work in a team to distribute tasks;","maintain a timeline; and","use iterative design to solve problems, including peer review and feedback."]},{"id":"MS.CSE.AP.22","title":"MSCSE.22","text":"The student will decompose problems and subproblems into parts to facilitate the design, implementation, and review of programs.","grade":"Middle School Courses","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.AP.23","title":"MSCSE.23","text":"The student will create procedures with parameters to organize code and make it easier to reuse.","grade":"Middle School Courses","strand":"Algorithms & Programming","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.SYS.24","title":"MSCSE.24","text":"The student will recommend improvements to the design of computing devices, based on an analysis of how users interact with the devices.","grade":"Middle School Courses","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.CSE.SYS.25","title":"MSCSE.25","text":"The student will design projects that combine hardware and software components to collect and exchange data.","grade":"Middle School Courses","strand":"Computing Systems","subject":"Computer Science (2017)","course":"Middle School CS Elective","subs":[]},{"id":"MS.SC.PS.1","title":"PS.1","text":"The student will demonstrate an understanding of scientific and engineering practices by","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["asking questions and defining problems (ask questions that require empirical evidence to answer, develop hypotheses indicating relationships between independent and dependent variables, offer simple solutions to design problems)","planning and carrying out investigations (independently and collaboratively plan and conduct observational and experimental investigations; identify variables, constants, and controls where appropriate and include the safe use of chemicals and equipment, evaluate the accuracy of various methods for collecting data, take metric measurements using appropriate tools and technologies, apply scientific ideas or principles to design, construct, and/or test a design of an object, tool, process or system)","interpreting, analyzing, and evaluating data (construct and interpret data tables showing independent and dependentvariables, repeated trials, and means, construct, analyze, and interpret graphical displays of data and considerlimitations of data analysis, apply mathematical concepts and processes to scientific questions, use data to evaluate and refine design solutions to best meet criteria)","constructing and critiquing conclusions and explanations (construct scientific explanations based on valid and reliable evidence obtained from sources (including the students’ own investigations), construct arguments supported by empirical evidence and scientific reasoning, generate and compare multiple solutions to problems based on how wellthey meet the criteria and constraints, differentiate between a scientific hypothesis, theory, and law)","developing and using models (construct, develop, and use models and simulations to illustrate and/or explain observable and unobservable phenomena, evaluate limitations of models)","obtaining, evaluating, and communicating information (read scientific texts, including those adapted for classroom use, to determine the central idea and/or obtain scientific and/or technical information, gather, read, and synthesize information from multiple appropriate sources and assess the credibility, accuracy, and possible bias of each publication, construct, use, and/or present an oral and written argument supported by empirical evidence and scientific reasoning)"]},{"id":"MS.SC.PS.2","title":"PS.2","text":"The student will investigate and understand that matter is composed of atoms. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["our understanding of atoms has developed over time;","the periodic table can be used to predict the chemical and physical properties of matter; and","the kinetic molecular theory is used to predict and explain matter interactions."]},{"id":"MS.SC.PS.3","title":"PS.3","text":"The student will investigate and understand that matter has properties and is conserved in chemical and physical processes. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["pure substances can be identified based on their chemical and physical properties;","pure substances can undergo physical and chemical changes that may result in a change of properties;","compounds form through ionic and covalent bonding; and","balanced chemical equations model the conservation of matter."]},{"id":"MS.SC.PS.4","title":"PS.4","text":"The student will investigate and understand that the periodic table is a model used to organize elements based on their atomic structure. Key uses include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["symbols, atomic numbers, atomic mass, chemical groups (families), and periods are identified on the periodic table; and","elements are classified as metals, metalloids, and nonmetals."]},{"id":"MS.SC.PS.5","title":"PS.5","text":"The student will investigate and understand that energy is conserved. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["energy can be stored in different ways;","energy is transferred and transformed; and","energy can be transformed to meet societal needs."]},{"id":"MS.SC.PS.6","title":"PS.6","text":"TThe student will investigate and understand that waves are important in the movement of energy. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["energy may be transferred in the form of longitudinal and transverse waves;","mechanical waves need a medium to transfer energy;","waves can interact; and","energy associated with waves has many applications."]},{"id":"MS.SC.PS.7","title":"PS.7","text":"The student will investigate and understand that electromagnetic radiation has characteristics. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["electromagnetic radiation, including visible light, has wave characteristics and behavior; and","regions of the electromagnetic spectrum have specific characteristics and uses."]},{"id":"MS.SC.PS.8","title":"PS.8","text":"The student will investigate and understand that work, force, and motion are related. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["motion can be described using position and time; an","motion is described by Newton’s laws."]},{"id":"MS.SC.PS.9","title":"PS.9","text":"The student will investigate and understand that there are basic principles of electricity and magnetism. Key ideas include","grade":"Middle School Courses","subject":"Science","course":"Science","subs":["an imbalance of charge generates static electricity;","materials have different conductive properties;","electric circuits transfer energy;","magnetic fields cause the magnetic effects of certain materials;","electric current and magnetic fields are related; and","many technologies use electricity and magnetism."]}]