{"content":"\n<h2>Overview</h2>\n<p>This lesson sequence by Sara Fergus, Christa VanOlst, &#x26; Jon Stapleton offers students and teachers a way to develop data science skills using the CODAP “low-code” data analysis tool. Through a mix of “plugged” and “unplugged” activities, students engaging with the lessons in this sequence will learn about different types of data, create and evaluate data visualizations, and identify patterns in data sets using descriptive statistics, modeling, and other techniques. At the end of the sequence, students generate an original research question based on their individual goals, interests, needs, and desires and address it using the data science skills they have developed over the course of the sequence.</p>\n<h2>Learning Objectives</h2>\n<p><em>The students will be able to . . .</em></p>\n<ul>\n  <li>Use a wide range of data collection techniques (e,g., surveys, public data sets, crowdsourcing) to generate useful information to address data questions</li>\n  <li>Interpret, create, and evaluate data visualizations using CODAP to explore patterns in data sets and to communicate trends and patterns to non-technical audiences</li>\n  <li>Identify patterns, relationships, and trends in data using a variety of data science techniques (e.g., descriptive statistics, visualizations, modeling)</li>\n  <li>Use predictive models (including linear regression) to make predictions given a related dataset</li>\n  <li>Evaluate predictive models, assess how to use them appropriately to inform human decision-making, and identify problems with models which make them unreliable (e.g., bias, overfitting)</li>\n  <li>Identify the role data science and statistics play in society at large, including the impact of misleading data visualizations, bias in data collection and analysis, and other issues at the intersection of data science and human experience.</li>\n</ul>\n<div class=\"supporter-disclaimer\">\n  <div class=\"img-wrap\">\n    <img src=\"/images/donate.png\">\n  </div>\n  <p class=\"text\">CodeVA created this material with support from a private donor. It has not been reviewed or endorsed by the VDOE or other authorities for alignment to the Virginia Standards of Learning.</p>\n</div>\n","frontmatter":{"title":"Data Science with CODAP","authors":"Sara Barbolish, Christa VanOlst, Jon Stapleton","types":["Lesson Plan"],"links":{"goopen":"https://goopenva.org/courseware/lesson/6198/overview","drive":"https://drive.google.com/drive/u/0/folders/19lbOUGIKPKPJXffgMZEed6yo9piDykKw","pdf":"https://drive.google.com/file/d/155kOLJb9CWmkJZNWI4aN23ltLdRgMJqN/view?usp=drive_link"},"pathData":{"exists":true,"path":"data-science/codap.md"},"subjects":["Computer Science","Data Science"],"grades":["9-12"],"license":{"name":"CC-BY-NC-SA","link":"https://creativecommons.org/licenses/by-nc-sa/4.0/"},"tags":["computer science","cs","data science","high school","hs","statistics","stats"],"audiences":["Classroom Teachers"],"image":"data-science.png","parents":[{"title":"Data Science Project-Based Learning","authors":"Sara Barbolish, Christa VanOlst, Jon Stapleton","types":"Unit of Study","subjects":"Computer Science, Data Science","standards":"HS.CSF.NI, HS.DS, HS.CSF.SYS.1","grades":"9-12","contents":["./unplugged.md","./codap.md","./python.md"],"tags":"computer science, cs, data science, high school, hs, statistics, stats","links":{"drive":"https://drive.google.com/drive/folders/1NxUvF4jhhswMM6v7MQ-rAS2HtZ68AAyM"},"image":"data-science.png","audiences":"Classroom Teachers","pathData":{"exists":true,"path":"/data-science/meta.md"}}],"members":[]}}